// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	уатФиксацияБюджетов.Ссылка КАК Регистратор,
	|	уатФиксацияБюджетов.Дата КАК Период,
	|	уатФиксацияБюджетов.Сценарий,
	|	уатФиксацияБюджетов.ЦФО,
	|	уатФиксацияБюджетов.Проект,
	|	уатФиксацияБюджетов.ГраницаФиксации
	|ИЗ
	|	Документ.уатФиксацияБюджетов КАК уатФиксацияБюджетов
	|ГДЕ
	|	уатФиксацияБюджетов.Ссылка = &Ссылка";
	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГраницПериодов", мЗапрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
		
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);

КонецПроцедуры