&НаКлиенте
Процедура ЭтоФиксЗначениеПриИзменении(Элемент)
	ЭтоФиксПриИзменении(); 
КонецПроцедуры

&НаКлиенте
Процедура ЭтоФиксПриИзменении()
	
	Если ЭтоФикс Тогда
		Элементы.СписокВыбора.Доступность = Ложь;
		Элементы.ФиксированноеЗначение.Доступность = Истина;
	Иначе
		Элементы.СписокВыбора.Доступность = Истина;
		Элементы.ФиксированноеЗначение.Доступность = Ложь;		
	КонецЕсли;	

КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокКолонокПроцент") Тогда
		СписокВыбора = Параметры.СписокКолонокПроцент;		
	КонецЕсли;
			
	Если Параметры.Свойство("ИмяТЧ") И Параметры.Свойство("ОписаниеТипаФиксЗначения") Тогда
		Элементы.ФиксированноеЗначение.ОграничениеТипа = Параметры.ОписаниеТипаФиксЗначения;
		
		Если СтрНайти(НРег(Параметры.ИмяТЧ), "время") <> 0 Тогда
			Элементы.ФиксированноеЗначение.ФорматРедактирования = "ДФ=ЧЧ:мм"; 
		КонецЕсли;		
	КонецЕсли;
	
	Если Параметры.Свойство("Фикс") Тогда
		Если Параметры.Фикс Тогда
			ЭтоФикс = Параметры.Фикс;
			Если Параметры.Свойство("ФиксЗначение") Тогда
				ФиксЗначение = Параметры.ФиксЗначение;				
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтоФиксПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если ЭтоФикс Тогда
		ВыборанноеЗначение = ФиксЗначение;		
	Иначе	
		ВыборанноеЗначение = Новый СписокЗначений;
		Для Каждого ЭлементК Из СписокВыбора Цикл
			Если ЭлементК.Пометка Тогда
				ВыборанноеЗначение.Добавить(ЭлементК.Значение, ЭлементК.Представление);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Закрыть(ВыборанноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура УбратьВсе(Команда)
	Для Каждого ЭлементК Из СписокВыбора Цикл
		ЭлементК.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
