
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	уатРазнарядкаРазнарядка.Ссылка КАК Регистратор,
	|	уатРазнарядкаРазнарядка.ТС,
	|	уатРазнарядкаРазнарядка.ДатаВыезда КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.уатСостояниеТС.СформированаРазнарядка) КАК Состояние,
	|	уатРазнарядкаРазнарядка.ДатаВозвращения КАК ДатаОкончания
	|ИЗ
	|	Документ.уатРазнарядка.Разнарядка КАК уатРазнарядкаРазнарядка
	|ГДЕ
	|	уатРазнарядкаРазнарядка.Ссылка = &Ссылка";	
	
	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянийТС",мЗапрос.Выполнить().Выгрузить());
	
КонецПроцедуры


// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
КонецПроцедуры
