
&НаКлиенте
Процедура КомандаОК(Команда)
	ИзменитьТСиВодителя(фПутевойЛист, фВодитель1, фВодитель2, фТС);
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	ЭтаФорма.Закрыть(Ложь);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьТСиВодителя(пПутевойЛист, пВодитель1, пВодитель2, пТС)
	мОбъектДокументаПЛ = пПутевойЛист.ПолучитьОбъект();
	мОбъектДокументаПЛ.Водитель1 = пВодитель1;
	мОбъектДокументаПЛ.Водитель2 = пВодитель2;
	мОбъектДокументаПЛ.ТранспортноеСредство = пТС;
	
	Если мОбъектДокументаПЛ.ТранспортноеСредство.Модель.НаличиеСпидометра Тогда
		мОбъектДокументаПЛ.СпидометрВыезда = уатОбщегоНазначения.уатТекущийСпидометр(мОбъектДокументаПЛ.ТранспортноеСредство, мОбъектДокументаПЛ.ДатаВыезда);
	Иначе
		мОбъектДокументаПЛ.СпидометрВыезда = уатОбщегоНазначения.уатТекущийСчетчикМЧ(мОбъектДокументаПЛ.ТранспортноеСредство, мОбъектДокументаПЛ.ДатаВыезда);
	КонецЕсли;
	
	мОбъектДокументаПЛ.ВыдатьГорючее = мОбъектДокументаПЛ.ТранспортноеСредство.Модель.ОсновноеТопливо;
	мОбъектДокументаПЛ.Записать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ПутевойЛист", фПутевойЛист);
	фВодитель1 = фПутевойЛист.Водитель1;
	фВодитель2 = фПутевойЛист.Водитель2;
	фТС = фПутевойЛист.ТранспортноеСредство;
КонецПроцедуры
