Функция ПолучитьДанные(ДатаНачала,ДатаОкончания,ТС = Неопределено) Экспорт
	
	ФильтрПоТС = ТС = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонсервацияТС.ТС КАК ТС,
		|	КонсервацияТС.Период КАК ДатаКонсервации,
		|	ДОБАВИТЬКДАТЕ(КонсервацияТС.Период, МЕСЯЦ, 3) КАК ДатаСброса
		|ПОМЕСТИТЬ ТЗКонсервацияТС
		|ИЗ
		|	РегистрСведений.уатМестонахождениеТС КАК КонсервацияТС
		|ГДЕ
		|	КонсервацияТС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И КонсервацияТС.Состояние.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.уатВидыСостоянийТС.НаКонсервации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уатСостояниеТС.ТС.ГаражныйНомер КАК ТСГаражныйНомер,
		|	уатСостояниеТС.ТС,
		|	уатСостояниеТС.Состояние,
		|	уатСостояниеТС.Период КАК ДатаСмены,
		|	ТЗТС.ДатаКонсервации КАК ДатаКонсервации
		|ИЗ
		|	РегистрСведений.уатМестонахождениеТС КАК уатСостояниеТС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗКонсервацияТС КАК ТЗТС
		|		ПО уатСостояниеТС.ТС = ТЗТС.ТС
		|			И уатСостояниеТС.Период > ТЗТС.ДатаКонсервации
		|			И уатСостояниеТС.Период < ТЗТС.ДатаСброса
		|ГДЕ
		|	уатСостояниеТС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И уатСостояниеТС.Состояние.ВидСостояния <> ЗНАЧЕНИЕ(Перечисление.уатВидыСостоянийТС.НаКонсервации)
		|	И уатСостояниеТС.Состояние.ВидСостояния <> ЗНАЧЕНИЕ(Перечисление.уатВидыСостоянийТС.Выбыло)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТСГаражныйНомер,
		|	ДатаКонсервации";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(ДатаНачала,-3));
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ТС", ТС);
	
	Результат = Запрос.Выполнить();
	
	ТЗ = Результат.Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции	

Функция КонтрольСрокаКонсервации(ТЗ,НовСостояние) Экспорт
	Отказ = Ложь;
	Для каждого ХХХ Из ТЗ Цикл
		Если ЗначениеЗаполнено(ХХХ.ТС) Тогда
			КонтрольнаяДата = ДобавитьМесяц(ХХХ.ДатаВвода,-3);
			ДанныеТС = уатОбщегоНазначения.МестонахождениеТС(ХХХ.ТС, ХХХ.ДатаВвода-1);
			Состояние = ДанныеТС.Состояние;
			ДатаКонсервации = ДанныеТС.Период;
			Если (Состояние.ВидСостояния <> НовСостояние.ВидСостояния) //отсекаем перемещения в рамках одного вида состояния 
				И (Состояние.ВидСостояния = Перечисления.уатВидыСостоянийТС.НаКонсервации) //берем все то, что имеет вид "На консервации"
				И (ДатаКонсервации > КонтрольнаяДата) // берем только тех, где срок меньше указанного (т.е. 3-х месяцев)
				Тогда
				Сообщить("Внимание!!! В строке № " + ХХХ.НомерСтроки + " для ТС гар. номер " + ХХХ.ТС.ГаражныйНомер + " срок консервации был меньше 3-х месяцев: с " + Формат(ДатаКонсервации,"ДЛФ=D") + " по " + Формат(ХХХ.ДатаВвода,"ДЛФ=D") + "!!!");
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Ложь;
КонецФункции	