
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = " 
	| SELECT
	| &Дт Период,
	| ТблЗП.Сотрудник Водитель,
	| ТблЗП.ССылка.ВидРасчета ВидРасчета,
	| ТблЗП.ССылка.ЦехКонтрагента ЦехКонтрагента,
	| ТблЗП.ССылка.ЦехКонтрагента.Владелец Контрагент,
	| НачалоПериода(&Дт,МЕсяц) ПериодРаботы,
	| &Дт ДатаРаботы,
	| тблЗП.ТранспортноеСредство ТС,
	| 0  Тариф,
	| CASE WHEN ТБлЗП.ВремяРаботы = 0 THEN 1 ELSE 0 END ЧасыДляОборота,
	|  ТБлЗП.ВремяРаботы Количество,
	| тблЗП.Сумма Сумма
	|
	|FROM Документ.ДоплатаПоБригадномуПодряду.Исполнители как тблЗП
	|WHERE тблЗП.ссылка = &сс
	|   и  Сумма<>0
	|";
	
	запрос.УстановитьПараметр("сс",Ссылка);
	запрос.УстановитьПараметр("Дт",КонецДня(Дата));
	
	Рег = Движения.РаботаВодителей;
	Рег.Загрузить(Запрос.Выполнить().Выгрузить());
	Рег.Записать();
	

КонецПроцедуры

Функция СткШапка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтвРук.ФизическоеЛицо Рук,
	               |	ОтвОтиз.ФизическоеЛицо КАК ОТИЗ,
	               |	ОтвОК.ФизическоеЛицо КАК ОК
	               |ИЗ
	               |	Документ.ДоплатаПоБригадномуПодряду КАК ТабельКС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(&Дт,ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизации.ДирЭкспл)) КАК ОтвРук
	               |		ПО ТабельКС.Организация = ОтвРук.СтруктурнаяЕдиница
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(&Дт,ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизации.НачОТИЗ)) КАК ОтвОтиз
	               |		ПО ТабельКС.Организация = ОтвОтиз.СтруктурнаяЕдиница
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(&Дт,ОтветственноеЛицо = Значение(Перечисление.ОтветственныеЛицаОрганизации.НачОК)) КАК ОтвОК
	               |		ПО ТабельКС.Организация = ОтвОК.СтруктурнаяЕдиница
				   |WHERE &сс = ссылка";
				   Запрос.УстановитьПараметр("Дт",Ссылка.Дата);
				   Запрос.УстановитьПараметр("сс",Ссылка);
				   тбл = запрос.Выполнить().Выгрузить();
				   
				   Стк = Новый Структура("Рук,ДлжРук,ОТИЗ,ДлжОТИЗ,Нач,ДлжНач,ОК,ДлжОК,ДлжДисп,Дисп");
				   ЗаполнитьЗначенияСвойств(Стк,Тбл[0]);
				   
				   С = уатОбщегоНазначенияТиповые.ДанныеФизЛица(Организация,Тбл[0].Рук,Дата);
				   Стк.Рук = С.Представление;
				   Стк.длжРук = С.Должность;
				   
				   С = уатОбщегоНазначенияТиповые.ДанныеФизЛица(Организация,Тбл[0].ОТИЗ,Дата);
				   Стк.ОТИЗ = С.Представление;
				   Стк.длжОТИЗ = С.Должность;
				   
				   С = уатОбщегоНазначенияТиповые.ДанныеФизЛица(Организация,Тбл[0].ОК,Дата);
				   Стк.ОК = С.Представление;
				   Стк.длжОК = С.Должность;
				   
				   Возврат Стк;
	
КонецФункции

Функция ДанныеПечать()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеНачислениеИсполнители.Сотрудник,
	               |	CASE WHEN Ссылка.Проведен THEN  ДополнительныеНачислениеИсполнители.КТУ ELSE 0 END КТУ,
	               |	СУММА(CASE WHEN Ссылка.Проведен THEN ДополнительныеНачислениеИсполнители.сумма ELSE 0 END) КАК сумма,
	               |	СУММА(ДополнительныеНачислениеИсполнители.суммаПовр) КАК суммаПовр,
	               |	СУММА(ДополнительныеНачислениеИсполнители.ВремяРаботы) КАК ВремяРаботы,
	               |	ДополнительныеНачислениеИсполнители.Сотрудник.Код КАК Код,
	               |	уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации
	               |ИЗ
	               |	Документ.ДоплатаПоБригадномуПодряду.Исполнители КАК ДополнительныеНачислениеИсполнители
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСведенияОСотрудниках.СрезПоследних(&Дт, Сотрудник В (&МасСотр)) КАК уатСведенияОСотрудникахСрезПоследних
	               |		ПО ДополнительныеНачислениеИсполнители.Сотрудник = уатСведенияОСотрудникахСрезПоследних.Сотрудник
	               |ГДЕ
	               |	ДополнительныеНачислениеИсполнители.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДополнительныеНачислениеИсполнители.Сотрудник,
	               |	ДополнительныеНачислениеИсполнители.Ссылка.Проведен,
	               |	ДополнительныеНачислениеИсполнители.КТУ,
	               |	ДополнительныеНачислениеИсполнители.Сотрудник.Код,
	               |	уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации";
				   
				   Запрос.УстановитьПараметр("ССылка",ССылка);
				   Запрос.УстановитьПараметр("Дт",ССылка.Дата);
				   Запрос.УстановитьПараметр("МасСотр",Ссылка.Исполнители.ВыгрузитьКолонку("Сотрудник"));
				   
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура Печать() Экспорт
	
	
	Если Не уатОбщегоНазначенияТиповые.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Исполнители.Количество()=0 ТОгда
		Предупреждение("Нет данных для вывода на печать!");
		Возврат;
	КонецеСЛИ;
	
	Таб = Новый ТабличныйДокумент;
	Таб.ИмяПараметровПечати = "ДокументЗПпоБП";
	Макет = ПолучитьМакет("Макет");
	
	СткШапка = СткШапка();
	
	обШапка = Макет.ПолучитьОбласть("Шапка");
	обСтрока = Макет.ПолучитьОбласть("Строка");
	обИтог = Макет.ПолучитьОбласть("Итог");
	
	обШАпка.Параметры.Заполнить(ССылка);
	обШАпка.Параметры.Заполнить(СткШапка);
	//обШапка.Параметры.ДАтаДОк = Формат(Ссылка.Дата,"ДФ=dd.MM.yyyy");
	Таб.Вывести(обШапка);
	ТБл = ДанныеПечать();
	ном = 0;
	ДЛя каждого стр из Тбл Цикл
		
		обСтрока.Параметры.Заполнить(Стр);
		ном= ном+1;
		обСтрока.Параметры.НомерСтроки = ном;
		Таб.Вывести(обСтрока);
		
	КонецЦикла;
	
	Тбл.свернуть("","Сумма,СуммаПовр,ВремяРаботы");
	обИтог.Параметры.Заполнить(СткШапка);
	обИтог.Параметры.Заполнить(Тбл[0]);
	
	Таб.Вывести(обИтог);
	
	
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.Показать();
	
КонецПроцедуры
