// Вызывается при перенаправлении задачи.
//
// Параметры
//   ЗадачаСсылка  – ЗадачаСсылка.ЗадачаИсполнителя – перенаправляемая задача.
//   НоваяЗадачаСсылка  – ЗадачаСсылка.ЗадачаИсполнителя – задача для нового исполнителя.
//
Процедура ПриПеренаправленииЗадачи(ЗадачаСсылка) Экспорт
	
	//// Изменяем бизнес-процесс
	//УстановитьПривилегированныйРежим(Истина);
	//БизнесПроцессОбъект = ЗадачаСсылка.БизнесПроцесс.ПолучитьОбъект();
	//БизнесПроцессОбъект.Заблокировать();
	//Строка = БизнесПроцессОбъект.ДополнительныеИсполнители.Добавить();
	//Если Не ЗадачаСсылка.Исполнитель.Пустая() Тогда
	//	Строка.Исполнитель = ЗадачаСсылка.Исполнитель;
	//Иначе	
	//	Строка.Исполнитель = ЗадачаСсылка.РольИсполнителя;
	//КонецЕсли;	
	//Строка.ОсновнойОбъектАдресации = ЗадачаСсылка.ОсновнойОбъектАдресации;
	//Строка.ДополнительныйОбъектАдресации = ЗадачаСсылка.ДополнительныйОбъектАдресации;
	//
	//Если ТипЗнч(Строка.Исполнитель) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
	//	Строка.ГруппаДоступаИсполнителей = Справочники.ГруппыИсполнителейЗадач.ГруппаИсполнителейЗадач(
	//		Строка.Исполнитель, Строка.ОсновнойОбъектАдресации, Строка.ДополнительныйОбъектАдресации);
	//Иначе		
	//	Строка.ГруппаДоступаИсполнителей = Строка.Исполнитель;
	//КонецЕсли;		
	//
	//БизнесПроцессОбъект.Записать();
	//УстановитьПривилегированныйРежим(Ложь);
	//
	//РаботаСБизнесПроцессами.ПриПеренаправленииЗадачи(ЗадачаСсылка);
	
КонецПроцедуры
