Функция ЗаполнитьПереченьПодразделений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение,
		|	уатМестонахождениеТССрезПоследних.Подразделение.Наименование КАК Наименование,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	РегистрСведений.уатМестонахождениеТС.СрезПоследних(&ДатаЗапроса, ) КАК уатМестонахождениеТССрезПоследних
		|ГДЕ
		|	уатМестонахождениеТССрезПоследних.Состояние.ЗапретитьВыпискуПЛ = ЛОЖЬ
		|	И уатМестонахождениеТССрезПоследних.Состояние <> ЗНАЧЕНИЕ(Справочник.уатСостояниеТС.Привлеченный)
		|	И уатМестонахождениеТССрезПоследних.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	уатМестонахождениеТССрезПоследних.Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Подразделение
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаЗапроса", ТекущаяДата());
	
	//РезультатЗапроса = Запрос.Выполнить();
	
	//Выборка = РезультатЗапроса.Выбрать();
	
	//Пока Выборка.Следующий() Цикл
	//	Элементы.Подразделение.СписокВыбора.Добавить(Выборка.Подразделение);
	//КонецЦикла;
	
	Возврат Запрос.Выполнить().Выгрузить();
	//ПереченьПодразделений.Загрузить(Запрос.Выполнить().Выгрузить());

КонецФункции


Процедура СформироватьФайлДанных_АвтоГРАФ5() Экспорт
	СистемаМониторинга = Справочники.СистемыМониторинга.НайтиПоРеквизиту("ФлагПриоритетнаяСистема",Истина);
	ТекстОшибки			 = "";
	ТекстJSON = "";
	ДанныеЗапроса = Неопределено;
	ВнешняяСистема	 = СистемаМониторинга.ВидСистемыGPS;
	УчетнаяЗапись	 = СистемаМониторинга;
	Если ВнешняяСистема = Перечисления.ВидСистемыGPS.Автограф Тогда
		КодВозврата = глСистемыМониторингаСервер.АвтоГРАФ5_GetOnlineInfoAll(УчетнаяЗапись, ДанныеЗапроса, ТекстОшибки, ТекстJSON);
		Если КодВозврата = 0 И ТекстОшибки = "" Тогда
			Текст = Новый ЗаписьТекста("E:\Work\out.txt");
			Текст.Записать(ТекстJSON);
			Текст.Закрыть();			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
