////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт; // Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения.


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

//Процедура проверяет заполнение обязательных реквизитов документов
//
//
Процедура ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента,Отказ, Заголовок)
	
	уатОбщегоНазначенияТиповые.уатПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,СтруктураШапкиДокумента, Отказ, Заголовок);
	СтруктураПолей = Новый Структура("Билет,Количество");
	уатОбщегоНазначенияТиповые.уатПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Билеты", СтруктураПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Подготовка таблицы для формирования движений по ОстаткамАгрегатов
//
//Возвращаемое значение:
// РезультатЗапроса
//
Функция ПодготовитьТаблицуБилетов()
	Запрос =  Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатПоступлениеБилетов.Билет,
	               |	уатПоступлениеБилетов.Количество,
	               |	уатПоступлениеБилетов.Цена,
	               |	уатПоступлениеБилетов.Ссылка.Склад
	               |ИЗ
	               |	Документ.уатПоступлениеБилетов.Билеты КАК уатПоступлениеБилетов
	               |ГДЕ
	               |	уатПоступлениеБилетов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Возврат Запрос.Выполнить();
КонецФункции

// Процедура движений по регистру ОстаткиАгрегатов
//
Процедура ФормированиеДвиженийПоСкладу(Отказ, Заголовок, РежимПроведения)
	
	ТаблицаОстатков											= ПодготовитьТаблицуБилетов();
	НаборЗаписейПоОстаткам									= Движения.уатБилетыНаСкладах;
	НаборЗаписейПоОстаткам.ДокументОбъект					= ЭтотОбъект;
	НаборЗаписейПоОстаткам.РезультатЗапросаПоБилетам		= ТаблицаОстатков;
	Отказ													= НЕ НаборЗаписейПоОстаткам.Приход() ИЛИ Отказ;
	
КонецПроцедуры // ФормированиеДвиженийПоСкладу()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	#Если Клиент Тогда
		// Заголовок для сообщений об ошибках проведения.
		Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(Ссылка);
		
		// Сформируем структуру реквизитов шапки документа
		//	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
		СтруктураШапкиДокумента = Новый Структура("Организация, Склад");
		
		ПроверитьЗаполнениеДокумента(СтруктураШапкиДокумента,Отказ, Заголовок);
		
		ФормированиеДвиженийПоСкладу(Отказ, Заголовок, Режим);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	уатОбщегоНазначения.уатПроверкаПравПередЗаписьюВДокументах(ЭтотОбъект, Отказ, , Права);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = Билеты.Итог("Сумма");
КонецПроцедуры // ПередЗаписью

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПраваУАТ;
#КонецЕсли
