
Функция СформироватьСообщение(Событие,Состояние,ДопЗн="") Экспорт
	
	Стк = Новый Структура("ИдОбъекта,ДатаСообщения,Событие,Состояние,ДопЗн","","","","","");
	Стк.ИдОбъекта = СтрокаСоединенияИнформационнойБазы();
	Стк.ДатаСообщения = ТекущаяДата();
	Стк.Событие = Событие;
	Стк.Состояние = Состояние;
	Стк.ДопЗн = ДопЗн;
	
	Возврат ЗначениеВСтрокуВнутр(Стк);
	
КонецФункции

Функция ПолучитьИнПрофиль(Отправитель,Пароль="1!qqqqqq") экспорт
	

	ИнПрофиль = Новый ИнтернетПочтовыйПрофиль;   
	
	ИнПрофиль.ПользовательSMTP="1c@urals-capital.ru";     
	ИнПрофиль.АдресСервераSMTP="mail.tdcl.ru";   
	ИнПрофиль.ПортSMTP = 25;   
	ИнПрофиль.ПарольSMTP="1!qqqqqq";     
	ИНПрофиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	
	Возврат ИнПрофиль;
	
КонецФункции

Функция Почта(Текст) Экспорт
	
	Отправитель = "uralsdoc@yandex.ru";
	Получатель = "of501@yandex.ru";	
	
	ИнПрофиль = ПолучитьИнПрофиль(Отправитель);
	
	
	//Отправим почту
	
	Письмо=Новый ИнтернетПочтовоеСообщение;
	Письмо.Получатели.Добавить(Получатель);
	
	Письмо.ИмяОтправителя=Отправитель;//+"@yandex.ru";//"@mail.ru";
	Письмо.Отправитель=Отправитель;//+"@yandex.ru";//"@mail.ru";
	Письмо.Кодировка="windows-1251";
	Письмо.Тема="Отправка лог: "+СтрокаСоединенияИнформационнойБазы();
	Письмо.Тексты.Добавить(Текст);
	
	ИнПочта=Новый ИнтернетПочта;
	ИнПочта.Подключиться(ИнПрофиль);
	ИнПочта.Послать(Письмо);
	Сообщить("Почта отправлена!");
	ИнПочта.Отключиться();
	
	Письмо = Неопределено;
	
	Возврат Истина;

КонецФункции

