Процедура ЗаписатьРегистрацию(Обк)  Экспорт
	ТекСС = Обк.ссылка;
	Если ЗначениеЗаполнено(ТекСС) = ложь ТОгда Возврат; КонецЕСЛИ;
	
	Наб = РегистрыСведений.ксРегистрацияОбменаЧтениеВЦентре.СоздатьНаборЗаписей();
	Наб.Отбор.Док.Установить(ТекСС);
	Зап = Наб.Добавить();
	Зап.Док = Тексс;
	Зап.ДатаИзменения = Тексс.ДатаИзмененияВПереферийнойИБ;
	
	Наб.Записать();
	
КонецПроцедуры

Функция ПолучитьЗаписьРегистрации(ТекСС) Экспорт
	
	Стк = Новый Структура("ДтРег,ДтИзм",Неопределено,Неопределено);
	Если ЗначениеЗаполнено(ТекСС) = ложь ТОгда Возврат Стк; КонецЕСЛИ;
	
	Наб = РегистрыСведений.ксРегистрацияОбменаЧтениеВЦентре.СоздатьНаборЗаписей();
	Наб.Отбор.Док.Установить(ТекСС);
	Наб.Прочитать();
	Если Наб.Количество() = 0 Тогда Возврат Стк; КонецесЛИ;
	Стк.ДтРег = Наб[0].ДатаРегистрации;
	Стк.ДтИзм = Наб[0].ДатаИзменения;
	
	Возврат Стк;
	
КонецФункции

