////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

Процедура ПередЗаписью(Отказ)
	
	//Двойное оборудование нельзя
	Т = ОборудованиеГСМ.Выгрузить();
	Т.Колонки.Добавить("Инд",Новый ОписаниеТипов("Число"));
	Т.ЗаполнитьЗначения(1,"Инд");
	Т.Свернуть("Оборудование","Инд");
	Для каждого С из Т ЦИкл
		ЕСли с.Инд>1 ТОгда
			Сообщить("Оборудование для расхода ГСМ "+С.Оборудование+" указано более одного раза");
			Отказ=Истина;
		КонецЕСЛИ;
	КонецЦикла;
	
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначения.уатПроверкаПравПередЗаписьюВСправочниках(ЭтотОбъект, Отказ);
	
	Если ЗначениеЗаполнено(ИДвСистемеНавигации) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ИДвСистемеНавигации", ИДвСистемеНавигации);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатТС.Наименование КАК Наименование,
		|	уатТС.ГаражныйНомер КАК ГаражныйНомер
		|ИЗ
		|	Справочник.уатТС КАК уатТС
		|ГДЕ
		|	уатТС.Ссылка <> &Ссылка
		|	И уатТС.ИДвСистемеНавигации = &ИДвСистемеНавигации";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначения.СообщитьОбОшибке("ID в системе GPS " + ИДвСистемеНавигации + " уже установлен для ТС """ + Выборка.Наименование + " г/н " + Выборка.ГаражныйНомер + """.", Отказ,,СтатусСообщения.Важное);
		КонецЦикла;
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ ЭтоГруппа И НЕ Отказ И ПривлеченноеТС Тогда
	//	// проверка на принадлежность ТС к одному из регистров
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	уатМестонахождениеТССрезПоследних.ТС,
	//	|	NULL КАК МодельТС
	//	|ИЗ
	//	|	РегистрСведений.уатМестонахождениеТС.СрезПоследних(&Дата, ) КАК уатМестонахождениеТССрезПоследних
	//	|ГДЕ
	//	|	уатМестонахождениеТССрезПоследних.ТС = &ТС
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	уатСчетчикиТССрезПоследних.ТС,
	//	|	NULL
	//	|ИЗ
	//	|	РегистрСведений.уатСчетчикиТС.СрезПоследних(&Дата, ) КАК уатСчетчикиТССрезПоследних
	//	|ГДЕ
	//	|	уатСчетчикиТССрезПоследних.ТС = &ТС
	//	|
	//	|";
	//	
	//	Запрос.УстановитьПараметр("ТС"  , Ссылка);
	//	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	//	
	//	Если НЕ Запрос.Выполнить().Пустой() ИЛИ ЗначениеЗаполнено(Ссылка.ОсновноеСредство) Тогда
	//		#Если Клиент Тогда
	//			ТекстСообщения = "Запись невозможна. Транспортное средство участвует в документообороте.";
	//			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
	//		#КонецЕсли
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если НЕ ЭтоГруппа И НЕ Отказ И ПривлеченноеТС Тогда
	//	МенеджерЗаписи = РегистрыСведений.уатПризнакиКонтрагентов_уэ.СоздатьМенеджерЗаписи();
	//	МенеджерЗаписи.Контрагент = ВладелецТС;
	//	МенеджерЗаписи.Прочитать();
	//	МенеджерЗаписи.Контрагент = ВладелецТС;
	//	МенеджерЗаписи.Перевозчик = Истина;
	//	МенеджерЗаписи.Записать();
	//КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если уатОбщегоНазначения.уатДоступностьКомпоненты("УЭ") Тогда
		Если ПривлеченноеТС Тогда
			Если ВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт И ПустаяСтрока(ГосударственныйНомер) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не заполнен гос. номер!", Отказ);
			КонецЕсли;
			Если (ВладелецТС = Неопределено ИЛИ ВладелецТС.Пустая()) тогда
				ТекстСообщения = "Для транспортного средства '"+ Наименование + "' необходимо указать владельца, элемент не записан.";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт Тогда
		Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ПредставлениеТСКакГосНомер) И ПустаяСтрока(ГосударственныйНомер) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнен гос. номер!", Отказ);
		ИначеЕсли (НЕ уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ПредставлениеТСКакГосНомер)) И ПустаяСтрока(ГаражныйНомер) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не заполнен гаражный номер!", Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если (НЕ ЭтоГруппа) И ДатаВводаВЭксплуатацию <> '00010101' Тогда
		ДатаВводаВЭксплуатацию = '00010101';
	КонецЕсли;
	Если (НЕ ЭтоГруппа) И ЗначениеЗаполнено(Организация) Тогда
		Организация = Неопределено;
	КонецЕсли;
	Если (НЕ ЭтоГруппа) И ЗначениеЗаполнено(Подразделение) Тогда
		Подразделение = Неопределено;
	КонецЕсли;
	Если (НЕ ЭтоГруппа) И ЗначениеЗаполнено(Колонна) Тогда
		Колонна = Неопределено;
	КонецЕсли;
	Если (НЕ ЭтоГруппа) И ЗначениеЗаполнено(ИДвСистемеНавигации) Тогда
		ИДвСистемеНавигации = Неопределено;
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПраваУАТ;
#КонецЕсли