
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фПараметрыЗаполнения = Параметры.ПараметрыЗаполнения;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	Закрыть(фПараметрыЗаполнения);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//пока только это условие остановки. На форме скрыты все остальные условия остановки
	//функционал требует обсуждения и тестирования
	СброситьИспользованиеУсловий(фПараметрыЗаполнения.УсловияЭталонногоПоля, "ОстановитьсяНаЗаполненном");
	УстановитьЗначенияРеквизитовФормы(фПараметрыЗаполнения);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияРеквизитовФормы(пПараметрыУсловия)
	Для Каждого мПараКлючЗначение Из пПараметрыУсловия.УсловияПрочихПолей Цикл
		ЭтаФорма[мПараКлючЗначение.Ключ] = мПараКлючЗначение.Значение.Использовать;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СброситьИспользованиеУсловий(пПараметрыУсловия, пИмяУсловия)
	//сбрасываем все, кроме пИмяУсловия
	Для Каждого мПараКлючЗначение Из пПараметрыУсловия Цикл
		пИспользовать = мПараКлючЗначение.Ключ = пИмяУсловия;
		мПараКлючЗначение.Значение.Использовать = пИспользовать;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УсловияПрочихПолейПриИзменении(Элемент)
	фПараметрыЗаполнения.УсловияПрочихПолей[Элемент.Имя].Использовать = ЭтаФорма[Элемент.Имя];
КонецПроцедуры
