
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фПечатьСразуНаПринтер = Параметры.фПечатьСразуНаПринтер;
	фОтображениеКолонна = Параметры.фОтображениеКолонна;
	фОтображениеПозицияПП = Параметры.фОтображениеПозицияПП;
	фНастройкаУпорядочивания = Параметры.фНастройкаУпорядочивания;
	фОтображениеДат = Параметры.фОтображениеДат;
	фОтображениеПрицеп = Параметры.фОтображениеПрицеп;
	фОтображатьДанныеЗагрузки = Параметры.фОтображатьДанныеЗагрузки;
	фКопироватьВремяСПредыдущегоПЛ = Параметры.фКопироватьВремяСПредыдущегоПЛ;
	фОтображатьВодитель2ВРежимеМаршрутов = Параметры.фОтображатьВодитель2ВРежимеМаршрутов;
	фДатаВозвратаВРежимеМаршрутов = Параметры.фДатаВозвратаВРежимеМаршрутов;
	фНеКопироватьПоПризнакуВыходнойПраздник = Параметры.фНеКопироватьПоПризнакуВыходнойПраздник;
	фОтображатьТипТСПЛ = Параметры.фОтображатьТипТСПЛ;
	//пока хардкодинг
	Элементы.фОтображениеДат.Видимость = (Параметры.фОтображениеДат <> Неопределено);
	Элементы.фОтображениеПрицеп.Видимость = (Параметры.фОтображениеПрицеп <> Неопределено);
	Элементы.фОтображатьДанныеЗагрузки.Видимость = (Параметры.фОтображатьДанныеЗагрузки <> Неопределено);
	Элементы.фОтображатьВодитель2ВРежимеМаршрутов.Видимость = (Параметры.фОтображатьВодитель2ВРежимеМаршрутов <> Неопределено);
	Элементы.фКопироватьВремяСПредыдущегоПЛ.Видимость = (Параметры.фКопироватьВремяСПредыдущегоПЛ <> Неопределено);
	Элементы.фДатаВозвратаВРежимеМаршрутов.Видимость = (Параметры.фДатаВозвратаВРежимеМаршрутов <> Неопределено);
	Элементы.фНеКопироватьПоПризнакуВыходнойПраздник.Видимость = (Параметры.фНеКопироватьПоПризнакуВыходнойПраздник <> Неопределено);
	Элементы.фОтображатьТипТСПЛ.Видимость = (Параметры.фОтображатьТипТСПЛ <> Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	мСтруктураЗакрытия = Новый Структура("фПечатьСразуНаПринтер, фОтображениеКолонна, фОтображениеПозицияПП, фНастройкаУпорядочивания, фОтображениеДат, фОтображениеПрицеп, фОтображатьДанныеЗагрузки, фКопироватьВремяСПредыдущегоПЛ, фОтображатьВодитель2ВРежимеМаршрутов, фДатаВозвратаВРежимеМаршрутов, фНеКопироватьПоПризнакуВыходнойПраздник, фОтображатьТипТСПЛ", фПечатьСразуНаПринтер, фОтображениеКолонна, фОтображениеПозицияПП, фНастройкаУпорядочивания, фОтображениеДат, фОтображениеПрицеп, фОтображатьДанныеЗагрузки, фКопироватьВремяСПредыдущегоПЛ, фОтображатьВодитель2ВРежимеМаршрутов, фДатаВозвратаВРежимеМаршрутов, фНеКопироватьПоПризнакуВыходнойПраздник, фОтображатьТипТСПЛ);
	Закрыть(мСтруктураЗакрытия);
КонецПроцедуры
