
// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	Если ТипЗнч(СтруктураСНастройками) <> Тип("Структура") Тогда
		
		СтруктураСНастройками = Новый Структура;
		
	КонецЕсли;
	
	Для каждого ЭлМЕта из этотОбъект.Метаданные().Реквизиты Цикл
		
		РЕк = ЭтотОбъект[ЭлМЕта.Имя];
		Если ТипЗнч(Рек) = ТИп("СписокЗначений") ТОгда
			СтруктураСНастройками.Вставить(ЭлМета.Имя,Рек.Скопировать());
		ИНАче
			СтруктураСНастройками.Вставить(ЭлМета.Имя,Рек);
		КонецЕСЛИ;
		
	КонецЦикла;
	
	
	уатОбщегоНазначения.уатСохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);

КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	уатОбщегоНазначения.уатВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

