Функция Распаковать(СтрКат,ИмяФайла)
	
	Файл1="";
	
	Зип = Новый ЧтениеZipФайла;
	Зип.Открыть(ИМяФайла);
	ДЛя каждого Эл из Зип.Элементы Цикл
		Файл1=СтрКат+"\"+Эл.Имя;
		Сообщить("Записан файл "+"\"+Эл.Имя);
	КонецЦикла;
	Зип.ИзвлечьВсе(СтрКат);
	
	УдалитьФайлы(ИмяФайла);
	
	Возврат Файл1;
	
КонецФункции

Функция ПолучитьПочту(Получатель,СтрКат,ИнПрофиль)
	
	ИнПочта   = Новый ИнтернетПочта;           
	
	ИнПочта.Подключиться(ИнПрофиль);
	Сообщить("Подключение к почтовому ящику "+ИнПрофиль.Пользователь+"@mail.ru прошло успешно.");
	МасПисем = Новый Массив;
	Мас = ИнПочта.Выбрать(Истина);
	Для каждого Письмо из Мас Цикл
		Для каждого Фл из Письмо.Вложения Цикл
			
			ПутьКФайлу = СтрКат+"\"+МасПисем.Количество()+"_"+фл.ИмяФайла;
			Фл.Данные.Записать(ПутьКФайлу);
			МасПисем.Добавить(ПутьКФайлу);
			Сообщить("Записан файл "+ПутьКФайлу);
			
		КонецЦикла;
	КонецЦикла;
	
	ИнПочта.Отключиться();
	Сообщить("Количество записей : "+МАсПисем.Количество()+"
			|  ");
	
	Возврат МасПисем;
	
КонецФункции

Процедура Почта(Получатель,Отправитель,ИмяФайла,ИнПрофиль)
	
	 Зип = Новый ЗаписьZipФайла;
	 Зип.Открыть(ИмяФайла+".zip");
	 Зип.Добавить(ИмяФайла);
	 Зип.Записать();
	 Зип = Неопределено;
	 
	 УдалитьФайлы(ИмяФайла);
	 ИМяФайла = ИмяФайла+".zip";

	
	//Отправим почту
	Кому = Получатель+"@mail.ru";
	Тема = " Обмен с перефирийной базой "+ТекущаяДата();
	Текст = " Обмен с перефирийной базой "+ТекущаяДата();
	
	Письмо=Новый ИнтернетПочтовоеСообщение;
	Письмо.Получатели.Добавить(Кому);
	
		Письмо.Вложения.Добавить(ИмяФайла);
		Сообщить("Подготовлен к отправке : "+ИмяФайла);
	
	Письмо.ИмяОтправителя=Отправитель+"@mail.ru";
	Письмо.Отправитель=Отправитель+"@mail.ru";
	Письмо.Кодировка="windows-1251";
	Письмо.Тема=Тема;
	Письмо.Тексты.Добавить(Текст);
	
	ИнПочта=Новый ИнтернетПочта;
	ИнПочта.Подключиться(ИнПрофиль);
	ИнПочта.Послать(Письмо);
	Сообщить("Почта отправлена!");
	ИнПочта.Отключиться();
	
	Письмо = Неопределено;
	 УдалитьФайлы(ИмяФайла);
	

КонецПроцедуры

Процедура ПрочитатьСообщениеСИзменениями(СтрКАт,ИмяФайла) экспорт 
	
	Файл = Новый Файл(ИмяФайла);
	Если Не Файл.Существует() Тогда
		Сообщить("Файл не найден - "+имяфайла);
		Возврат;
	КонецЕсли;
	
	Если нрег(ПРав(СокрП(ИмяФайла),4)) = ".zip" Тогда 
		ИмяФайла = Распаковать(СтрКат,имяфайла);
	КонецеСЛИ;
	
	
	ЧтениеXML = Новый ЧтениеXML;
	Попытка
		ЧтениеXML.ОткрытьФайл(ИмяФайла);
	Исключение
		Сообщить("Невозможно открыть файл обмена данными.");
		Возврат;
	КонецПопытки;
	Сообщить(" --- загружается файл " + ИмяФайла);
	
	
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	Попытка
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
		ПланыОбмена.ПрочитатьИзменения(ЧтениеСообщения);
		ЧтениеСообщения.ЗакончитьЧтение();
	Исключение
		Сообщить(ОписаниеОшибки());
		Сообщить("Для узла: """ + ЧтениеСообщения+ """ не удалось прочитать изменения!", СтатусСообщения.Важное);
	конецпопытки;
	
	ЧтениеXML.Закрыть();
	
	Если Не КонфигурацияИзменена() Тогда
		УдалитьФайлы(ИмяФайла);
	КонецеСЛИ;
	
КонецПроцедуры

Процедура ХМЛвКаталоге(СтрКАт)
	
	Мас = НайтиФайлы(СтрКАт,"*.xml");	
	Для каждого Эл из Мас Цикл
		ПрочитатьСообщениеСИзменениями(СтрКат,Эл.ПолноеИмя);	
	КонецЦикла;
	
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие() экспорт
	
	WshShell = Новый COMObject("WScript.Shell");
	СтрКат = WshShell.SpecialFolders().Item("Desktop")+"\Обмен_1с\";
	СоздатьКаталог(СтрКат);
	
	Если   ПланыОбмена.ГлавныйУзел() = Неопределено ТОгда
		Отправитель = "ETK_centr";
		Получатель = "etk_base1";
	ИНаче
		Отправитель = "etk_base1";
		Получатель = "ETK_centr";
	КонецЕСЛИ;
	
	ИнПрофиль = Новый ИнтернетПочтовыйПрофиль;          
	ИнПрофиль.АдресСервераSMTP="smtp.mail.ru";     
	ИнПрофиль.АдресСервераPOP3="pop.mail.ru";     
	ИнПрофиль.ПользовательSMTP=Отправитель;     
	ИнПрофиль.ПарольSMTP="1!qqqqqq";     
	ИнПрофиль.Пользователь=Отправитель;     
	ИнПрофиль.Пароль="1!qqqqqq";     
	ИнПрофиль.ПортSMTP = 25;   
	ИнПрофиль.Портpop3 = 110;   
	//ИнПрофиль.POP3ПередSMTP = true;    
	ИНПрофиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	
	//Проверим остались сообщение с прошлых загрузок (возможно было обновление БД)
	ХМЛвКаталоге(СтрКАт);
	
    Мас = ПолучитьПочту(Отправитель,СтрКат,ИнПрофиль);
	Для каждого Эл из Мас Цикл
		ПрочитатьСообщениеСИзменениями(СтрКат,Эл);
	КонецЦикла;
	
	Если КонфигурацияИзменена() Тогда
		ПРедупреждение("Произошло изменение конфигурации. Необходимо закрыть программу у всех пользователей для обновления 1с.");
		Возврат;
	КонецеСЛИ;
	
	
	Мас = МассивУзлов();
	
	Для каждого Эл из мас Цикл
		ИмяФайла = СтрКат+"Обмен_из_"+ПланыОбмена.уатПолный.ЭтотУзел()+"_в_"+Эл.Наименование+".xml"; 
		Сообщить("Выгрузка изменений в файл : "+ИмяФайла);
		
		ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяФайла);
		ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Эл);
		ПланыОбмена.ЗаписатьИзменения(ЗаписьСообщения);
		ЗаписьСообщения.ЗакончитьЗапись();
		ЗаписьXML.Закрыть();
		
		Почта(Получатель,Отправитель,ИмяФайла,ИнПрофиль);
	КонецЦикла;
	
	
КонецПроцедуры

Функция МассивУзлов()
	
	Мас = Новый Массив;
	Если   ПланыОбмена.ГлавныйУзел() = Неопределено ТОгда
		Выборка = ПланыОбмена.уатПолный.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			Если Выборка.Ссылка = ПланыОбмена.уатПолный.ЭтотУзел() Тогда Продолжить; КонецЕСЛИ;
			Мас.добавить(Выборка.Ссылка);
		КонецЦикла;
	ИНаче
		Мас.добавить(ПланыОбмена.ГлавныйУзел());
	КонецЕСли;
	Возврат Мас;	
	
КонецФункции

Процедура ЧтениеОбменаПослеОбновленияКонфигурации1()
	
	Если ИмяПользователя() = "Exchange" Тогда
		Обр = Обработки.ОбменРИБпоПочте.Создать();
		Обр.КнопкаВыполнитьНажатие();
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕСЛИ;
	
КонецПроцедуры

 Процедура ОбновлениеКонфигурацииИБ1() 
   СтрокаСоединения=СтрокаСоединенияИнформационнойБазы();
   ПутьКСкрипту=КаталогВременныхФайлов()+"exchange.vbs";
   Скрипт=Новый ЗаписьТекста(ПутьКСкрипту,КодировкаТекста.ANSI);
   Скрипт.ЗаписатьСтроку("WScript.Sleep 3000"); // на всякий случай
   Скрипт.ЗаписатьСтроку("Set WshShell=CreateObject(""WScript.Shell"")");
   Команда=""""""+КаталогПрограммы()+"1CV8.EXE"""" CONFIG"+?(НСтр(СтрокаСоединения,"File")<>""," /F "+НСтр(СтрокаСоединения,"File")," /S"+НСтр(СтрокаСоединения,"Srvr")+"\"+НСтр(СтрокаСоединения,"Ref"))+" /NExchange /PExchange /UpdateDBCfg";
   Скрипт.ЗаписатьСтроку("ReturnCode=WshShell.Run("""+Команда+""",1,1)");
   Скрипт.ЗаписатьСтроку("If ReturnCode=0 Then"); // если обновились удачно, то пытаемся дочитать сообщение
   Команда=""""""+КаталогПрограммы()+"1CV8.EXE"""" ENTERPRISE"+?(НСтр(СтрокаСоединения,"File")<>""," /F "+НСтр(СтрокаСоединения,"File")," /S"+НСтр(СтрокаСоединения,"Srvr")+"\"+НСтр(СтрокаСоединения,"Ref"))+" /NExchange /PExchange";
   //Запускаем программу для пользователя
   Команда=""""""+КаталогПрограммы()+"1CV8.EXE"""" ENTERPRISE"+?(НСтр(СтрокаСоединения,"File")<>""," /F "+НСтр(СтрокаСоединения,"File")," /S"+НСтр(СтрокаСоединения,"Srvr")+"\"+НСтр(СтрокаСоединения,"Ref"))+" /N"""""+ИмяПользователя()+""""" /P";
   Скрипт.ЗаписатьСтроку("WshShell.Run """+Команда+""",1,0");
   Скрипт.ЗаписатьСтроку("End If");
   Скрипт.ЗаписатьСтроку("Set FSO=CreateObject(""Scripting.FileSystemObject"")");
   Скрипт.ЗаписатьСтроку("Set File=FSO.GetFile(WScript.ScriptFullName)");
   Скрипт.ЗаписатьСтроку("File.Delete");
   Скрипт.Закрыть();
   ЗапуститьПриложение(ПутьКСкрипту);
   //ЗавершитьРаботуСистемы(Ложь) ;  
КонецПроцедуры


