Функция ПроверкаОтветсвенного(ссВидДДД) Экспорт
	
	Если ЗначениеЗаполнено(ссВидДДД)=Ложь ТОгда Возврат Истина; КонецЕсли; 
	
	текФЛ = ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
	//Если ЗначениеЗаполнено(текФЛ)=Ложь Тогда
	//	Сообщить("У пользователя "+ПараметрыСеанса.ТекущийПользователь+" не выбрано поле <Физ лицо>");
	//	Возврат Ложь;
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФЛ",текФЛ);
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Ссылка",ссВидДДД);
	Запрос.УстановитьПараметр("Дт",ТекущаяДата());
	Запрос.Текст = "ВЫБРАТЬ TOP 1
	               |	уатВидыДДДОтветственныеЛица.Ответственный
	               |ИЗ
	               |	Справочник.уатВидыДДД.ОтветственныеЛица КАК уатВидыДДДОтветственныеЛица
	               |ГДЕ
	               |	уатВидыДДДОтветственныеЛица.Ответственный в (&ФЛ,&Пользователь)
	               |	И уатВидыДДДОтветственныеЛица.Ссылка = &Ссылка
				   |
				   |UNION ALL
				   |
				   |
|ВЫБРАТЬ
|	уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации
|ИЗ
|	РегистрСведений.уатСведенияОСотрудниках.СрезПоследних(&Дт, Сотрудник.ФизЛицо = &фл и (Сотрудник.ДатаУвольнения > &Дт or Сотрудник.ДатаУвольнения = ДатаВремя(1,1,1)) ) КАК уатСведенияОСотрудникахСрезПоследних
|		INNER JOIN Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
|		ПО уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации = ПодразделенияОрганизаций.Ссылка
|		
|WHERE  ПодразделенияОрганизаций.Ссылка в иерархии (SELECT Ответственный FROM Справочник.уатВидыДДД.ОтветственныеЛица КАК спр1 WHERE спр1.ссылка = &Ссылка)
|		
|";
		
		
Рез = Запрос.Выполнить().Пустой();	
Если Рез ТОгда
	Сообщить("У пользователя "+ПараметрыСеанса.ТекущийПользователь+" нет прав для редактирования документа "+ссВидДДД);
	Возврат ЛОжь;
КонецеСЛИ;

Возврат Истина;
	
КонецФункции

Функция ПолучитьМассивДоступныхДокументов(дляСотр=Неопределено,дляТС=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
|ВЫБРАТЬ DISTINCT
|	СправочникуатВидыДДД.Ссылка
|ИЗ
|	Справочник.уатВидыДДД КАК СправочникуатВидыДДД
|INNER JOIN Справочник.уатВидыДДД.ОтветственныеЛица СпрОтв ON СпрОтв.ссылка = СправочникуатВидыДДД.ссылка

|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр1 ON Спр1.ссылка IN (SELECT ПодразделениеОрганизации FROM РегистрСведений.уатСведенияОСотрудниках.СрезПоследних(&Дт, Сотрудник.ФизЛицо = &фл и (Сотрудник.ДатаУвольнения > &Дт or Сотрудник.ДатаУвольнения = ДатаВремя(1,1,1)) ) КАК уатСведенияОСотрудникахСрезПоследних)
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр2 ON Спр1.Родитель = Спр2.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр3 ON Спр2.Родитель = Спр3.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр4 ON Спр3.Родитель = Спр4.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр5 ON Спр4.Родитель = Спр5.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр6 ON Спр5.Родитель = Спр6.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр7 ON Спр6.Родитель = Спр7.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр8 ON Спр7.Родитель = Спр8.Ссылка
|LEFT OUTER JOIN Справочник.ПодразделенияОрганизаций Спр9 ON Спр8.Родитель = Спр9.Ссылка

|WHERE (СпрОтв.Ответственный IN (&ФЛ,&Пользователь) 
|  или СпрОтв.Ответственный = Спр1.ссылка
|  или СпрОтв.Ответственный = Спр2.ссылка
|  или СпрОтв.Ответственный = Спр3.ссылка
|  или СпрОтв.Ответственный = Спр4.ссылка
|  или СпрОтв.Ответственный = Спр5.ссылка
|  или СпрОтв.Ответственный = Спр6.ссылка
|  или СпрОтв.Ответственный = Спр7.ссылка
|  или СпрОтв.Ответственный = Спр8.ссылка
|  или СпрОтв.Ответственный = Спр9.ссылка
|  )
|  и ( СправочникуатВидыДДД.дляТС   = &дляТС   или &дляТС = Неопределено)
|  и ( СправочникуатВидыДДД.дляСотр = &дляСотр или &дляСотр = Неопределено)
|
|";
	Запрос.УстановитьПараметр("ФЛ",ПараметрыСеанса.ТекущийПользователь.ФизЛицо);
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Дт",ТекущаяДата());
	Запрос.УстановитьПараметр("дляТС",дляТС);
	Запрос.УстановитьПараметр("дляСотр",дляСотр);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьТблНачАвтоколон(Сотр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
|ВЫБРАТЬ
|	уатСведенияОСотрудникахСрезПоследних.Сотрудник,
|	уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации,
|	уатСведенияОСотрудникахСрезПоследних.Должность
|ИЗ
|	РегистрСведений.уатСведенияОСотрудниках.СрезПоследних(,Сотрудник.ФизЛицо = &Сотр или &Сотр=Значение(Справочник.ФизическиеЛица.ПустаяСсылка) ) КАК уатСведенияОСотрудникахСрезПоследних
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.уатСотрудники КАК уатСотрудники
|		ПО уатСведенияОСотрудникахСрезПоследних.Сотрудник = уатСотрудники.Ссылка
|ГДЕ
|	уатСведенияОСотрудникахСрезПоследних.Должность.Наименование ПОДОБНО ""%начальник%""
|	И (уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации.Наименование ПОДОБНО ""%колон%""
|			ИЛИ уатСведенияОСотрудникахСрезПоследних.ПодразделениеОрганизации.Наименование ПОДОБНО ""%цех%"")
|	И уатСотрудники.ДатаУвольнения = ДатаВремя(1,1,1)
|
|";
	Запрос.УстановитьПараметр("Сотр",Сотр);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура Отчет(Зн) Экспорт
	Если ЗначениеЗаполнено(Зн) =Ложь ТОгда Возврат; КонецеСЛИ;
	
	Обк = Отчеты.ОтчетПоДокументам.Создать();
	Обк.ФильтрСотрТС = Зн;
	Обк.ПолучитьФорму("ФормаОтчета1",,"МенеджерУатВидыДДД").Открыть();
	
КонецПроцедуры