////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения



// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик ПередЗаписью элемента справочника
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда Возврат; КонецЕсли;
	
	ОбязательноеПодразделениеЕсть = Ложь;
	МасПодр = Новый Массив;
	Для каждого Стр из ПодразделенияФильтр Цикл
		Если масПодр.Найти(Стр.Подразделение)<>Неопределено ТОгда
			Сообщить("Подразделение "+Стр.Подразделение+" уже есть в таблице исключений!");
			отказ=Истина;
		КонецеСЛИ;
		масПодр.Добавить(Стр.Подразделение);
		
		Если Стр.Исключить = Ложь ТОгда
			ОбязательноеПодразделениеЕсть = истина;
			Прервать;
		КонецеСЛИ;
	КонецЦикла;
	
	пСтр = "";
	Для каждого Стр из ОтветственныеЛица Цикл
		пСтр = пСтр + ФИО(СТр.Ответственный)+" ";
	КонецЦикла;
	стрОтветсвенные = пСтр;
	
КонецПроцедуры

Функция ФИО(Стр)
	РЕз = "";
	пСтр = СтрЗаменить(СокрЛП(Стр)," ",Символы.ПС);
	
	п=СтрПолучитьСтроку(пСтр,1);
	ЕСли п = "" ТОгда Возврат Рез; КонецеСЛИ;
	Рез = РЕз+п;
	
	//п=СтрПолучитьСтроку(пСтр,2);
	//ЕСли п = "" ТОгда Возврат Рез; КонецеСЛИ;
	//Рез = РЕз+" "+Лев(п,1)+".";
	//
	//п=СтрПолучитьСтроку(пСтр,3);
	//ЕСли п = "" ТОгда Возврат Рез; КонецеСЛИ;
	//Рез = РЕз+""+Лев(п,1)+".";
	
	Возврат Рез;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПраваУАТ;
#КонецЕсли