// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	мЗапрос = Новый Запрос;
	мЗапрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	мЗапрос.Текст =
	"ВЫБРАТЬ
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.Ссылка КАК Регистратор,
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.приход) КАК ВидДвижения,
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.Ссылка КАК ЗаявкаНаРасходование,
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.ДоговорКонтрагента,
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.Сделка,
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.Ссылка.Организация,
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.СуммаПлатежа КАК Сумма,
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.КурсВзаиморасчетов,
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.КратностьВзаиморасчетов
	|ИЗ
	|	Документ.уатЗаявкаНаРасходованиеДС.РасшифровкаПлатежа КАК уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа
	|ГДЕ
	|	уатЗаявкаНаРасходованиеДСРасшифровкаПлатежа.Ссылка = &Ссылка";
	
	
	ТабЗаявок = мЗапрос.Выполнить().Выгрузить();
	ТабЗаявок.Колонки.Добавить("СуммаУпр");
	Для каждого ТекСтрока ИЗ ТабЗаявок Цикл
		ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаВзаиморасчетов,
																				   ТекСтрока.ДоговорКонтрагента.ВалютаВзаиморасчетов,
																				   СтруктураДополнительныеСвойства.ВалютаУпрУчета,
																				   ТекСтрока.КурсВзаиморасчетов,
																				   СтруктураДополнительныеСвойства.КурсУпр,
																				   ТекСтрока.КратностьВзаиморасчетов,
																				   СтруктураДополнительныеСвойства.КратностьУпр);
	КонецЦикла;
	
	ТабБюджетов = Новый ТаблицаЗначений;
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаявокНаРасходованиеДС"        , ТабЗаявок);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаКонтролируемыхЗначенияБюджетов", ТабБюджетов);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
КонецПроцедуры
