
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.УчетДанныхВПЛПоБСМТС.Записывать = Истина;
	Движения.УчетДанныхВПЛПоБСМТС.Очистить();
	Для Каждого ТекСтрокаПереченьТС Из ПереченьТС Цикл
		Движение = Движения.УчетДанныхВПЛПоБСМТС.Добавить();
		Движение.Период = Дата;
		Движение.ТС = ТекСтрокаПереченьТС.ТС;
		Движение.ИспользоватьДанныеБСМТС = ТекСтрокаПереченьТС.ИспользоватьДанныеБСМТС;
		Движение.Комментарий = Комментарий;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Мас = Новый Массив;
	Для Каждого ХХХ Из ПереченьТС Цикл
		Мас.Добавить(ХХХ.ТС);
	КонецЦикла;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатПутевойЛист.ТранспортноеСредство КАК ТранспортноеСредство,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Документ.уатПутевойЛист КАК уатПутевойЛист
		|ГДЕ
		|	уатПутевойЛист.ТранспортноеСредство В(&Мас)
		|	И уатПутевойЛист.ДатаВыезда МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И уатПутевойЛист.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	уатПутевойЛист.ТранспортноеСредство";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Мас", Мас);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Отказ = глОбщий.ЕстьРасходГСМзаМесяц(Дата);
КонецПроцедуры
