Функция ПолучитьТС(ГаражныйНомер) Экспорт
	
	Возврат Справочники.уатТС.НайтиПоРеквизиту("ГаражныйНомер", ГаражныйНомер);
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	уатТС.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.уатТС КАК уатТС
	//|ГДЕ
	//|	уатТС.ГаражныйНомер = &ГаражныйНомер");
	//
	//Запрос.УстановитьПараметр("ГаражныйНомер", ГаражныйНомер);
	//
	//Результат = Запрос.Выполнить();
	//Если Результат.Пустой() Тогда
	//	Возврат Справочники.уатТС.ПустаяСсылка();
	//КонецЕсли;
	//
	//Выборка = Результат.Выбрать();
	//Выборка.Следующий();
	//
	//Возврат Выборка.Ссылка;
	
КонецФункции

Функция ПолучитьМассивЦветовФона() Экспорт
	
	МассивЦветов = Новый Массив;
	МассивЦветов.Добавить(Новый Цвет(  0, 138,   0));
	МассивЦветов.Добавить(Новый Цвет( 96, 169,  23));
	МассивЦветов.Добавить(Новый Цвет(213, 232, 212));
	МассивЦветов.Добавить(Новый Цвет(255, 255, 136));
	МассивЦветов.Добавить(Новый Цвет(255, 204, 153));
	МассивЦветов.Добавить(Новый Цвет(248, 206, 204));
	
	Возврат МассивЦветов;
	
КонецФункции
