
&НаКлиенте
Процедура ПереместитьВ(Команда)
	мТекущиеДанные = Элементы.ТаблицаТС.ТекущиеДанные;
	Если мТекущиеДанные <> Неопределено Тогда
		мОписаниеЗавершенияВводаНовойПозиции = Новый ОписаниеОповещения("ОбработкаЗавершенияВводаНовогоНомераСтроки", ЭтаФорма);
		ПоказатьВводЗначения(мОписаниеЗавершенияВводаНовойПозиции, 1, "Введите новый номер строки");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗавершенияВводаНовогоНомераСтроки(пРезультат, пДополнительныеПараметры) Экспорт
	Если пРезультат <> Неопределено Тогда
		мТекущиеДанные = Элементы.ТаблицаТС.ТекущиеДанные;
		мИндексСтроки = Объект.ТаблицаТС.Индекс(мТекущиеДанные);
		Объект.ТаблицаТС.Сдвинуть(мИндексСтроки , (пРезультат - мИндексСтроки) - 1);
	КонецЕсли;
КонецПроцедуры