
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЛогСогласовал="" ТОгда Отказ = Истина; Возврат; КонецеСлИ;
	
	Наб = Движения.ДокументыИсключения;
	Для каждого Стр из ТранспортныеСредства Цикл
		Зап = Наб.Добавить();
		Зап.Период = Дата;
		Зап.ВидДокумента = ВидДокумента;
		Зап.ОбъектДок = Стр.ТС;
		Зап.Исключить = Исключить;
	Конеццикла;
	Для каждого Стр из Сотрудники Цикл
		Зап = Наб.Добавить();
		Зап.Период = Дата;
		Зап.ВидДокумента = ВидДокумента;
		Зап.ОбъектДок = Стр.Сотрудник;
		Зап.Исключить = Исключить;
	Конеццикла;
	Наб.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ТОгда
		ЛогСогласовал = "";
	КонецЕСЛИ;
КонецПроцедуры
