Процедура Печать() Экспорт
	
	Если Не уатОбщегоНазначенияТиповые.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
|	
|	
|	ВЫБРАТЬ
|		уатМестонахождениеТССрезПоследних.ТС,
|		уатМестонахождениеТССрезПоследних.Подразделение,
|		уатМестонахождениеТССрезПоследних.Период
|		INTO ВРТбл
|	ИЗ
|		РегистрСведений.уатМестонахождениеТС.СрезПоследних(&Дт) КАК уатМестонахождениеТССрезПоследних
|		
|	UNION ALL
|		
|	ВЫБРАТЬ
|		уатМестонахождениеТС.ТС,
|		уатМестонахождениеТС.Подразделение,
|		уатМестонахождениеТС.Период
|	ИЗ
|		РегистрСведений.уатМестонахождениеТС КАК уатМестонахождениеТС
|		WHERE Период > &Дт и Период < &Дт1
|	;
|		
|	SELECT  DISTINCT
|		Тбл.ТС,
|		Тбл.Подразделение,
|		Тбл.Период,
|		MIN(ISNULL(Т.Период,&Дт1)) ПериодКон,
|		Тбл.Период изначДт
|	INTO ВРТбл1	
|	FROM ВРТбл Тбл 
|	LEFT OUTER JOIN ВРТбл Т ON Т.ТС = Тбл.ТС и Т.Период > Тбл.Период
|	GROUP BY		
|		Тбл.ТС,
|		Тбл.Подразделение,
|		Тбл.Период
|	;	
|	SELECT DISTINCT
|		Тбл.ТС,
|		Тбл.Подразделение,
|		Тбл.Период,
|		Тбл.ПериодКон
|	INTo ВРПодр
|	FROM ВРТбл1 Тбл
|	INNER JOIN (SELECT ТС,Период,MAX(изначДт) изНачДт FROM ВРТбл1 Т1 GROUP BY ТС,Период) Т ON Т.ТС = Тбл.ТС и Т.Период = ТБл.Период и Т.ИзначДт = Тбл.ИзначДт
|	
|	;
|	////////////////////////////////////////////////////
|
|
|
|
|ВЫБРАТЬ
|	тбПодр.Подразделение,
|	уатРемонтныйЛист.Ссылка,
|	уатРемонтныйЛист.Номер,
|	уатРемонтныйЛист.Дата,
|	уатРемонтныйЛист.ТС,
|	уатРемонтныйЛист.ТС.ГаражныйНомер ГаражныйНомер,
|	уатРемонтныйЛист.ТС.ГосударственныйНомер ГосударственныйНомер,
|	уатРемонтныйЛист.ДатаНачала,
|	уатРемонтныйЛист.ДатаНачала врНач,
|	уатРемонтныйЛист.ДатаОкончания,
|	уатРемонтныйЛист.ДатаОкончания врКон,
|	уатРемонтныйЛист.Водитель,
|	уатРемонтныйЛист.ВидОбслуживания,
|	уатРемонтныйЛист.СтрОсновнаяРабота,
|	уатРемонтныйЛист.ЛогПроведен,
|	CASE WHEN ДатаОкончания = ДатаВремя(1,1,1)             THEN FALSE ELSE TRUE END Закрыт,
|	CASE WHEN ДатаОкончания <> ДатаВремя(1,1,1) и Проведен THEN TRUE  ELSE FALSE END Проведен
|ИЗ
|	Документ.уатРемонтныйЛист КАК уатРемонтныйЛист
|LEFT OUTER JOIN ВРПодр тбПодр ON тбПодр.ТС = уатРемонтныйЛист.ТС и тбПодр.Период <= уатРемонтныйЛист.Дата  и тбПодр.ПериодКон > уатРемонтныйЛист.Дата
|
|WHERE  уатРемонтныйЛист.Ссылка в (&Мас)
//|ORDER BY Дата,Номер	  
|ORDER BY Номер	  
|";	

	Запрос.УстановитьПараметр("сс",ссылка);
	Запрос.УстановитьПараметр("Дт",НачалоМесяца(Дата)-32 * 3600*24);
	Запрос.УстановитьПараметр("Дт1",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Мас",Доки.ВыгрузитьКолонку("Док"));
	Тбл =Запрос.Выполнить().Выгрузить();
	
	
	Таб = новый ТабличныйДокумент;
	врТаб = новый ТабличныйДокумент;
	Таб.ИмяПараметровПечати = "ПечатьРеестр";
	врТаб.ИмяПараметровПечати = "ПечатьРеестр";
	Макет = ПолучитьМакет("Макет");
	
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ОблЗаг = Макет.ПолучитьОбласть("Заг");
	Обл = Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.Номер = СокрЛП(Номер);
	Обл.Параметры.ДатаДок = Формат(Дата,"ДФ=dd.MM.yyyy");
	врТаб.Вывести(Обл);
	врТаб.Вывести(ОблЗаг);
	
	Обл = Макет.ПолучитьОбласть("Строка");
	Мас = Новый Массив;
	Мас.Добавить(Обл);

	Ном=0;
	Для а=1 по Тбл.Количество() Цикл
		Стр = Тбл[а-1];
		Ном = ном+1;
		
		Обл.Параметры.Заполнить(Стр);
		Обл.Параметры.Ном = ном;
		
		Если а=Тбл.Количество() Тогда
			Мас.Добавить(ОблПодвал);
		КонецеСЛИ;
		Если врТаб.ПроверитьВывод(Мас)=Ложь Тогда
			Таб.Вывести(врТаб);
			Таб.ВывестиГоризонтальныйРазделительСтраниц();
			врТаб.Очистить();
			врТаб.Вывести(облЗаг);
		КонеЦЕСЛИ;
			
		
		врТаб.Вывести(Обл);
		
	КонецЦикла;
	
	Таб.Вывести(врТаб);
	
	С = уатОбщегоНазначенияТиповые.ДанныеФизЛица(Организация,Ответственный.ФизЛицо,Дата);
	ОблПодвал.Параметры.ФИОСдал = С.Представление;
	ОблПодвал.Параметры.ДлжСдал = С.Должность;
	
	С = уатОбщегоНазначенияТиповые.ДанныеФизЛица(Организация,Принял,Дата);
	ОблПодвал.Параметры.ФИОПринял = С.Представление;
	ОблПодвал.Параметры.ДлжПринял = С.Должность;
	
	ОблПодвал.Параметры.ТекВремя = ТекущаяДата();
	
	
	Таб.Вывести(ОблПодвал);
	
	//Таб.ПовторятьПриПечатиСтроки = Таб.Область(3,,3);
	
	Таб.ФиксацияСверху = 3;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.ТолькоПросмотр = Истина;
	
	Таб.Показать();
	
КонецПроцедуры