//==================================================================================
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
	
		Если НЕ ЭтоГруппа И НЕ ЗначениеЗаполнено(ВалютаДенежныхСредств) Тогда
			Сообщить("Не указана валюта денежных средств.",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

	КонецЕсли; 
	
КонецПроцедуры


//==================================================================================
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

