////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения


// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик ПередЗаписью элемента справочника
//
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Найти(ИмяПользователя(),"1с")=0
		и Найти(ИмяПользователя(),"1c")=0
		и (ЭтотОбъект.ПринадлежитЭлементу(Справочники.уатТипыТС.ЮРАЛС) 
		или 
		   (ЗначениеЗаполнено(ЭтотОбъект.Ссылка) и ЭтотОбъект.Ссылка.ПринадлежитЭлементу(Справочники.уатТипыТС.ЮРАЛС))
		)
		ТОгда
		ЕСли Ссылка.Родитель <> Родитель или ссылка.Наименование <> Наименование ТОгда
			Сообщить("Запрещено редактировать типы в папке ЮРАЛС");
			Отказ = Истина;
		КонецЕСЛИ;
	КонецЕСЛИ;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

