
&НаСервере
Процедура ЗаписатьНаСервере(Рек,Провести)
	Если ПередЗаписьюПроверка(Ложь) = Ложь Тогда Возврат; КонецЕСЛИ;
	Обк = РеквизитФормыВЗначение("Объект");
	Обк[Рек] = ""+ТекущаяДата()+" "+ИмяПользователя();
	Если Провести = ЛОжь ТОгда
		Обк.Записать();
	ИНАче
		Обк.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕСЛИ;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекПользователь()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура ЗаписатьЗапрос(Команда)
	
	Если ПередЗаписьюПроверка(Ложь) = Ложь Тогда Возврат; КонецЕСЛИ;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
		Объект.Ответсвенный = ТекПользователь();
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(ПараметрыЗаписи);	
	КонецЕСЛИ;
	
	ЗаписатьНаСервере("ЛогЗапрос",Ложь);
	ОбновлениеФормыПриЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	ЗаписатьНаСервере("ЛогСогласовал",Истина);
	ОбновлениеФормыПриЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДОступностьЭлементов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьОтветсвенного(ВидДокумента)
	
	Возврат Справочники.уатВидыДДД.ПроверкаОтветсвенного(ВидДокумента);
	
КонецФункции

&НаКлиенте
Процедура ДОступностьЭлементов()
	
	Элементы.ЗаписатьЗапрос.Видимость = Ложь;
	Элементы.Согласовать.Видимость = Ложь;
	Элементы.Отменить.Видимость = Ложь;
	ЭтаФорма.ТолькоПросмотр = Истина;
		
	Если Объект.Проведен ТОгда
		Возврат;
	КонецЕСЛИ;
	
	Если  СокрЛП(Объект.ЛогЗапрос)="" Тогда
		Если ЗначениеЗаполнено(Объект.Ответсвенный) = Ложь или Объект.Ответсвенный = ТекПользователь() Тогда
			Элементы.ЗаписатьЗапрос.Видимость = Истина;
			Элементы.Отменить.Видимость = Истина;
			ЭтаФорма.ТолькоПросмотр = Ложь;
		КонецЕсли;
	ИНачеЕсли ПроверитьОтветсвенного(Объект.ВидДокумента) Тогда
		Элементы.Согласовать.Видимость = Истина;
		Элементы.Отменить.Видимость = Истина;
	КонецеСЛИ;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		//Вставить содержимое обработчика
		Если ЗначениеЗаполнено(ОБъект.Ссылка) = Ложь ТОгда
			Объект.ЛогЗапрос = "";
			ОБъект.ЛогСогласовал = "";
			Объект.Исключить = Истина;
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтменитьНаСервере()
	Если ПередЗаписьюПроверка(Ложь) = Ложь Тогда Возврат; КонецЕСЛИ;
	
	Обк = РеквизитФормыВЗначение("Объект");
	Если СокрЛП(Обк.ЛогСогласовал)<>"" ТОгда
		Обк.ЛогСогласовал = "";
	ИНаче
		Обк.ЛогЗапрос = "";
	КонецЕслИ;
	Обк.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ОтменитьНаСервере();
	ОбновлениеФормыПриЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеФормыПриЗаписи() 
	
	ЭтаФорма.Прочитать();
	ДОступностьЭлементов();
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СотрудникиСотрудникАвтоПодборНаСервере(Текст)
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ top 7
				   |	уатСотрудники.Ссылка
	               |ИЗ
	               |	Справочник.уатСотрудники КАК уатСотрудники
	               |ГДЕ
	               |	уатСотрудники.Наименование ПОДОБНО &Наименование
	               |	И уатСотрудники.ДатаПриема <> ДатаВремя(1,1,1)
	               |	И уатСотрудники.ДатаУвольнения = ДатаВремя(1,1,1)
				   |
				   |";
	Запрос.УстановитьПараметр("Наименование",""+Текст+"%");
	Выб = Запрос.Выполнить().Выбрать();
	Спк = Новый СписокЗначений;
	Пока Выб.Следующий() Цикл
		Спк.Добавить(Выб.ссылка);
	КонецЦикла;
	
	Возврат Спк;
	
КонецФункции

&НаКлиенте
Процедура СотрудникиСотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Спк = СотрудникиСотрудникАвтоПодборНаСервере(Текст);
	
	Если Спк.Количество()<>0 Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Спк;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Спк = СотрудникиСотрудникАвтоПодборНаСервере(Текст);
	
	Если Спк.Количество()<>0 Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Спк;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПередЗаписьюПроверка(Отказ);
КонецПроцедуры

Функция ПередЗаписьюПроверка(Отказ)
	
	Для каждого стр из Объект.Сотрудники Цикл
		Если Стр.Сотрудник.ДатаПриема < Дата(1900,1,1) 
			или Стр.Сотрудник.ДатаУвольнения >= Дата(1900,1,1) Тогда
			Сообщить("Выбран неактуальный сотрудник : "+Стр.Сотрудник);
			Отказ = Истина;
		Конецесли;
	Конеццикла;
	
	Возврат Не Отказ;
	
КонецФункции
