//СткПЛ - структура данных по путевому листу
//СткБСМТС - структура параметров БСМТС, возвращаемая функцией "глСистемыМониторингаСервер.ПолучитьДанныеПоТС(...)"
Процедура СделатьЗапись(СткПЛ,СткБСМТС) Экспорт
	Зап = РегистрыСведений.ксДанныеАтографа.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Зап,СткБСМТС);
	ЗаполнитьЗначенияСвойств(Зап,СткПЛ);
	//Зап.ПутевойЛист = ПЛ;
	//Зап.Лог = Строка(ТекущаяДата()) + " - " + Пользователь;
	//Зап.ДтНач = ПЛ.ДатаВыезда;
	//Зап.ДтКон = ПЛ.ДатаВозвращения;
	//Зап.ТранспортноеСредство = ПЛ.ТранспортноеСредство;
	//+Lexx - запишем в реквизит с типом "ХранилищеЗначений" весь перечень параметров из БСМТС
	Хранилище = Новый ХранилищеЗначения(СткБСМТС.ПараметрыБСМТС);
	Зап.ПараметрыБСМТС = Хранилище;
	Зап.Записать();
КонецПроцедуры
