// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	
	
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказовНаТС"   , ТабЗаказыНаТС);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
	
	//мЗапрос = Новый Запрос;
	//мЗапрос.Текст =
	//"ВЫБРАТЬ
	//|	уатЗаказыНаТСОстатки.Заказчик,
	//|	уатЗаказыНаТСОстатки.Номенклатура,
	//|	уатЗаказыНаТСОстатки.ДатаВыполнения,
	//|	уатЗаказыНаТСОстатки.КоличествоОстаток
	//|ИЗ
	//|	РегистрНакопления.уатЗаказыНаТС.Остатки(
	//|			&МоментВремени,
	//|			ЗаказНаТС В
	//|				(ВЫБРАТЬ
	//|					Док.ЗаказНаТС
	//|				ИЗ
	//|					Документ.уатЗакрытиеЗаказовНаТС.Заказы КАК Док
	//|				ГДЕ
	//|					Док.Ссылка = &Ссылка)) КАК уатЗаказыНаТСОстатки
	//|ГДЕ
	//|	уатЗаказыНаТСОстатки.КоличествоОстаток < 0";
	//
	//мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	//
	//Выборка = мЗапрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	ТекстСообщения = "Получены отрицательные остатки по заказчику """ + Выборка.Заказчик + """ для номенклатуры " + Выборка.Номенклатура;
	//	ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ, Заголовок, СтатусСообщения.Внимание);	
	//КонецЦикла;
	
КонецПроцедуры
						  
