Процедура ДобавитьЗаписьАналитику(СоответствиеРеквизита, СтрокаТЧ, Контрагент) Экспорт
	
	НаборЗаписей = РегистрыСведений.юкАналитикаПоискаExcel.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Значение.Установить(СтрокаТЧ);
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
	НаборЗаписей.Прочитать();
		
	Если ЗначениеЗаполнено(СоответствиеРеквизита) Тогда
			
		Для Каждого Набор Из НаборЗаписей Цикл
			Если Набор.Объект <> СоответствиеРеквизита Тогда
				НаборЗаписей.Очистить();
				Прервать;
			КонецЕсли;			
		КонецЦикла;	
		
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Значение = СокрЛП(СтрокаТЧ);
			НоваяЗапись.Контрагент = Контрагент;
			НоваяЗапись.Объект = СоответствиеРеквизита;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	Иначе
		
		Если НаборЗаписей.Количество() <> 0 Тогда
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;    		
		
	КонецЕсли;
		
КонецПроцедуры 