
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	АдресСервиса = "http://hosting.wialon.com";
	
	// адрес не должен оканчиваться символом "/"
	Если Прав(АдресСервиса, 1) = "/" Тогда
		АдресСервиса = Лев(АдресСервиса, СтрДлина(АдресСервиса)-1);
	КонецЕсли;
	
	// адрес должен начинаться на "http" или "https"
	Если Не НРег(Лев(АдресСервиса, 7)) = "http://" Тогда 
		Если Не НРег(Лев(АдресСервиса, 8)) = "https://" Тогда 
			АдресСервиса = "http://" + АдресСервиса;
		КонецЕсли;
	КонецЕсли;
	
	HTML = АдресСервиса + "/login.html?client_id=""1C:Enterprise""&access_type=-1&activation_time=0&duration=0&lang=ru&response_type=token";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьТокен(Команда)
	
	Токен = "";
	
	Попытка
		Поз = Найти(Элементы.HTML.Документ.URL, "access_token=");
		Если Поз <> 0 Тогда 
			Токен = Прав(Элементы.HTML.Документ.URL, СтрДлина(Элементы.HTML.Документ.URL)-Поз-12);
			Поз = Найти(Токен, "&");
			Если Поз <> 0 Тогда 
				Токен = Лев(Токен, Поз-1);
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если Токен = "" Тогда 
		ТекстОшибки = НСтр("en='Session token is not received and could not be installed.';ru='Токен сессии не получен и не может быть установлен.'");
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Закрыть(Токен);
	
КонецПроцедуры

#КонецОбласти
