
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТребованиеНаВыдачуМаслаМатериалы.Количество,
	               |	ТребованиеНаВыдачуМаслаМатериалы.Агрегат,
	               |	ТребованиеНаВыдачуМаслаМатериалы.Ссылка.ТС ТС,
	               |	ТребованиеНаВыдачуМаслаМатериалы.Ссылка.Номер Номер,
	               |	ТребованиеНаВыдачуМаслаМатериалы.Ссылка.Водитель Сотрудник,
				   |    Ссылка.Дата Период,
				   |    0 Замена,
				   |    4 КодВида,
				   |    ""Требование на выдачу масла"" ВидДок
	               |ИЗ
	               |	Документ.ТребованиеНаВыдачуМасла.Материалы КАК ТребованиеНаВыдачуМаслаМатериалы
				   |WHERE ссылка = &сс";
				   Запрос.УстановитьПараметр("сс",Ссылка);
				   Тбл = Запрос.Выполнить().Выгрузить();
	   
	   Рег = Движения.РазрешениеНаЗаменуМасла;
	   Рег.Загрузить(Тбл);
	   Рег.Записать();
				   
				   
КонецПроцедуры
