Перем ОтветственныеЛицаОрганизации Экспорт; // Хранит ответственных лиц организации.

// Процедура заполняет структуру ответственных лиц.
//
Процедура ИнициализироватьОтветственныеЛица() Экспорт
	ОтветственныеЛицаОрганизации = ?(Метаданные.РегистрыСведений.Найти("ОтветственныеЛицаОрганизаций") <> Неопределено,
		РегистрыСведений.ОтветственныеЛицаОрганизаций.СоздатьНаборЗаписей(), РегистрыСведений.ОтветственныеЛицаОрганизации.СоздатьНаборЗаписей());
КонецПроцедуры // ИнициализироватьОтветственныеЛица()


ИнициализироватьОтветственныеЛица();