// Процедура выполняет инициализацию параметров сеанса, связанных с
// механизмами ограничения прав доступа на уровне строк
//
// Параметры:
//   Нет.
//
Процедура УстановитьПараметрыМеханизмаОграниченияПравДоступа() Экспорт
	
	ПараметрыСеанса.ItobИспользоватьОграниченияПравДоступаНаУровнеЗаписей = Константы.ItobИспользоватьОграниченияПравДоступаНаУровнеЗаписей.Получить();
		
КонецПроцедуры

// Процедура выполняет запись строки в регистр сведений для механизмов
// ограничений прав на уровне строк
//
// Параметры:
//   Ссылка - ссылка на элемент справочника или документа, для которого требуется запись.
//
Процедура ЗаписатьСтрокуВРегистрПрав(Ссылка) Экспорт
	
	Если ПараметрыСеанса.ItobИспользоватьОграниченияПравДоступаНаУровнеЗаписей и НЕ РольДоступна("ItobАдминистраторМониторинга") И Не РольДоступна("ПолныеПрава") И ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь.ОсновнаяГруппаПользователей) Тогда
		МенеджерЗаписи = РегистрыСведений.ItobНастройкиПравДоступаГруппПользователей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ГруппаПользователей = ПараметрыСеанса.ТекущийПользователь.ОсновнаяГруппаПользователей;
		МенеджерЗаписи.ОбъектДоступа = Ссылка;
		МенеджерЗаписи.Запись = истина;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры
