Перем  обработка501;

Процедура АЛГА() Экспорт
	обработка501 = Обработки.ОтправкаОф501.Создать();
	МестоНаДисках();
	
КонецПроцедуры


Процедура МестоНаДисках()
	
	fso = Новый COMObject("Scripting.FileSystemObject");
	text = "";
	Состояние = "Выполнено";
	Для каждого  drv из fso.Drives Цикл
		
		If drv.DriveType = 2 Then
			
			If drv.IsReady Then
				
				свободно = Round(drv.AvailableSpace / 1024 / 1024 / 1024, 2);
				Всего = Round(drv.TotalSize / 1024 / 1024 / 1024, 2);
				
				text = text +"Диск " + drv.DriveLetter +" ("+drv.RootFolder.Type+") : - Свободно " + свободно + " Gb. из "+ Всего+" Gb."+ Символы.ПС;
				Если свободно < 7 Тогда
					Состояние = "Ошибка";
				КонецЕСЛИ;
				
			Endif;
			
		EndIf;
		
	КонецЦикла;
	
	Тхт501 = обработка501.СформироватьСообщение("Свободное место",Состояние,text);
	обработка501.Почта(Тхт501);
	
	
	
КонецПроцедуры