Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
// 
Процедура ВыполнитьПриход() Экспорт
	
	Если НЕ ЗначениеЗаполнено(мПериод) тогда
		мПериод = ЭтотОбъект.Отбор.Регистратор.Значение.Дата;
	КонецЕсли;

	Для каждого текСтрока Из мТаблицаДвижений Цикл
		НоваяЗапись = Добавить();
		НоваяЗапись.ВидДвижения           = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Период                = мПериод;
		НоваяЗапись.Регистратор           = ЭтотОбъект.Отбор.Регистратор.Значение;
		НоваяЗапись.Контрагент            = ТекСтрока.Контрагент;
		НоваяЗапись.ДоговорКонтрагента    = текСтрока.ДоговорКонтрагента;
		НоваяЗапись.ЗаказГрузоотправителя = текСтрока.ЗаказГрузоотправителя;
		НоваяЗапись.Пакет                 = текСтрока.Пакет;
		НоваяЗапись.Количество            = текСтрока.Количество;
	КонецЦикла; 
	Записать();
	
КонецПроцедуры

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт
	
	Если НЕ ЗначениеЗаполнено(мПериод) тогда
		мПериод = ЭтотОбъект.Отбор.Регистратор.Значение.Дата;
	КонецЕсли;
	
	Для каждого текСтрока Из мТаблицаДвижений Цикл
		НоваяЗапись = Добавить();
		НоваяЗапись.ВидДвижения           = ВидДвиженияНакопления.Расход;
		НоваяЗапись.Период                = мПериод;
		НоваяЗапись.Регистратор           = ЭтотОбъект.Отбор.Регистратор.Значение;
		НоваяЗапись.Контрагент            = ТекСтрока.Контрагент;
		НоваяЗапись.ДоговорКонтрагента    = текСтрока.ДоговорКонтрагента;
		НоваяЗапись.ЗаказГрузоотправителя = текСтрока.ЗаказГрузоотправителя;
		НоваяЗапись.Пакет                 = ТекСтрока.Пакет;
		НоваяЗапись.Количество            = текСтрока.Количество;
	КонецЦикла; 
	// запись движений
	Записать();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	#Если Клиент Тогда
		Оповестить("Изменен заказ грузоотправителя");
	#КонецЕсли
КонецПроцедуры
