Функция ПЕчДанные()
	
	Запрос =Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаботаЗаСменуИсполнители.Ссылка.Номер КАК НомерДОк,
	               |	РаботаЗаСменуИсполнители.Ссылка.Дата КАК ДатаДОк,
	               |	РаботаЗаСменуИсполнители.Ссылка.Организация КАК Организация,
	               |	РаботаЗаСменуИсполнители.Сотрудник.Наименование КАК Сотрудник,
	               |	РаботаЗаСменуИсполнители.Сотрудник.Код КАК ТабНом,
	               |	РаботаЗаСменуИсполнители.ДокументЛист.Номер КАК НомерРЛ,
	               |	РаботаЗаСменуИсполнители.ДокументЛист.Дата КАК ДатаРЛ,
	               |	ВЫБОР
	               |		КОГДА РаботаЗаСменуИсполнители.ДокументЛист ССЫЛКА Документ.уатПутевойЛист
	               |			ТОГДА РаботаЗаСменуИсполнители.ДокументЛист.ТранспортноеСредство
	               |		ИНАЧЕ РаботаЗаСменуИсполнители.ДокументЛист.ТС
	               |	КОНЕЦ КАК ТС,
	               |	ВЫБОР КОГДА РаботаЗаСменуИсполнители.ДокументЛист.Номер IS null ТОгда "" ""
	               |		КОГДА РаботаЗаСменуИсполнители.ДокументЛист ССЫЛКА Документ.уатПутевойЛист
	               |			ТОГДА ""ПЛ""
	               |		ИНАЧЕ ""РЛ""
	               |	КОНЕЦ КАК ВидДОк,
	               |	ВЫБОР
	               |		КОГДА РаботаЗаСменуИсполнители.ДокументЛист ССЫЛКА Документ.уатПутевойЛист
	               |			ТОГДА РаботаЗаСменуИсполнители.ДокументЛист.ТранспортноеСредство.ГаражныйНомер
	               |		ИНАЧЕ РаботаЗаСменуИсполнители.ДокументЛист.ТС.ГаражныйНомер
	               |	КОНЕЦ КАК ГарНом,
	               |	РаботаЗаСменуИсполнители.ВремяРаботы,
	               |	уатСведенияОСотрудникахСрезПоследних.Должность.Наименование КАК имяДолжность
	               |ИЗ
	               |	Документ.РаботаЗаСмену.Исполнители КАК РаботаЗаСменуИсполнители
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСведенияОСотрудниках.СрезПоследних КАК уатСведенияОСотрудникахСрезПоследних
	               |		ПО РаботаЗаСменуИсполнители.Сотрудник = уатСведенияОСотрудникахСрезПоследних.Сотрудник
	               |ГДЕ
	               |	РаботаЗаСменуИсполнители.Ссылка = &сс";
	Запрос.УстановитьПараметр("сс",Ссылка);			   
	Тбл = Запрос.Выполнить().Выгрузить();
	Тбл.Колонки.Добавить("Должность",Новый ОписаниеТипов("Строка"));
	
	Для каждого стр из Тбл Цикл
		Стр.Должность = Сокрлп(Стр.ИмяДолжность);	
	КонецЦикла;
	
	Возврат Тбл;
	
КонецФункции

Процедура Печать() экспорт
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	Таб.ИмяПараметровПечати = "ПечСписокРРМпо рвепыавилывтдаь";
	
	облШапка = МАкет.ПолучитьОбласть("Шапка");
	облСтрока = МАкет.ПолучитьОбласть("Строка");
	
	ТБл = ПЕчДанные();
	Если Тбл.КОличество()>0 ТОгда
		облШапка.Параметры.Заполнить(ТБл[0]);
	КонецеСЛИ;
	Таб.Вывести(облШапка);

	Ном = 0;
	ДЛЯ каждого стр из Тбл ЦИкл
		Ном= Ном+1;
		облСТрока.Параметры.Ном = Ном;
		облСТрока.Параметры.Заполнить(СТр);
		Таб.Вывести(ОблСтрока);
	КонецЦИкла;
	
	Таб.ПовторятьПриПечатиСтроки = Таб.Область(6,,7);
	
	Таб.ТолькоПросмотр = Истина;
	ТАб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.Показать();
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = " 
	| SELECT
	| ТблЗП.Ссылка.Дата Период,
	| ТблЗП.Сотрудник Водитель,
	| ISNULL(ПланВР.Ссылка,&ВР) ВидРасчета,
	| НачалоПериода(ТблЗП.Ссылка.Дата,МЕсяц) ПериодРаботы,
	| ТблЗП.Ссылка.Дата ДатаРаботы,
	|	cASE WHEN ДокументЛист ССЫЛКА Документ.уатПутевойЛист THEN ДокументЛист.ТранспортноеСредство 
	|		 ELSE ДокументЛист.ТС END КАК ТС,
	| ISNULL(тбСОтр.Тариф,0) Тариф,
	
	| CASE WHEN Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 = 0 THEN 1 ELSE 0 END ЧасыДляОборота,
	
	| ВЫразить(Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 как Число(10,3)) Количество,
	| ВЫразить(Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 как Число(10,3))*ISNULL(тбСОтр.Тариф,0) Сумма
	|
	|FROM Документ.РаботаЗаСмену.Исполнители как тблЗП
	| LEFT OUTER JOIN РегистрСведений.уатТарифыСотрудников.СрезПоследних(&Дт,Сотрудник в (&МасСотр) ) тбСотр ON тбСотр.Сотрудник = тблЗП.Сотрудник
	| LEFT OUTER JOIN Справочник.уатКлассификаторИспользованияРабочегоВремени СпрКЛ ON СпрКЛ.Ссылка = ТБлЗП.КадровыеДанные
	| LEFT OUTER JOIN ПланВидовРасчета.уатОсновныеНачисления ПланВР ON ПланВР.Ссылка = ТБлЗП.КадровыеДанные
	|WHERE тблЗП.ссылка = &сс  
	|    и ТблЗП.ВремяРаботы <> Неопределено
	|    и СпрКЛ.Ссылка IS NULL
	|    и ТблЗП.ВремяРаботы <> ДатаВремя(1,1,1,0,0,0)
	|
	|UNION ALL
	|
	|SELECT
	| ТблЗП.Ссылка.Дата Период,
	| ТблЗП.Сотрудник Водитель,
	| тбВР.ССылка ВидРасчета,
	| НачалоПериода(ТблЗП.Ссылка.Дата,МЕсяц) ПериодРаботы,
	| ТблЗП.Ссылка.Дата ДатаРаботы,
	|	cASE WHEN ДокументЛист ССЫЛКА Документ.уатПутевойЛист THEN ДокументЛист.ТранспортноеСредство 
	|		 ELSE ДокументЛист.ТС END КАК ТС,
	| тбВР.КоэфНачисления * ISNULL(тбСОтр.Тариф,0) Тариф,
	
	| CASE WHEN Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 = 0 THEN 1 ELSE 0 END ЧасыДляОборота,
	
	| ВЫразить(Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 как Число(10,3)) Количество,
	| ВЫразить(Час(ВЫразить(ТБлЗП.ВремяРаботы как дата)) + Минута(ВЫразить(ТБлЗП.ВремяРаботы как дата))/60 как Число(10,3))*ISNULL(тбСОтр.Тариф,0) Сумма
	|
	|FROM Документ.РаботаЗаСмену.Исполнители как тблЗП
	| LEFT OUTER JOIN Справочник.уатКлассификаторИспользованияРабочегоВремени СпрКЛ ON СпрКЛ.Ссылка = ТБлЗП.ВремяРаботы
	
	|INNER JOIN ПланВидовРасчета.уатОсновныеНачисления тбВР ON тбВР.Ссылка = Значение(ПланВидовРасчета.уатОсновныеНачисления.ДоплатаЗаПраздничныеИВыходные)
	
	|INNER JOIN РегистрСведений.уатРегламентированныйПроизводственныйКалендарь КАК уатРегламентированныйПроизводственныйКалендарь
	|       ON ДатаКалендаря = &нДт и ВидДня = Значение(Перечисление.уатВидыДнейПроизводственногоКалендаря.Праздник)
	 
	| LEFT OUTER JOIN РегистрСведений.уатТарифыСотрудников.СрезПоследних(&Дт,Сотрудник в (&МасСотр) ) тбСотр ON тбСотр.Сотрудник = тблЗП.Сотрудник
	|WHERE тблЗП.ссылка = &сс  
	|    и ТблЗП.ВремяРаботы <> Неопределено
	|    и СпрКЛ.Ссылка IS NULL
	|    и ТблЗП.ВремяРаботы <> ДатаВремя(1,1,1,0,0,0)
    |    
	|";
	
	запрос.УстановитьПараметр("сс",Ссылка);
	запрос.УстановитьПараметр("ВР",ПланыВидовРасчета.уатОсновныеНачисления.ФиксированнойСуммой);
	запрос.УстановитьПараметр("Дт",КонецДня(Дата));
	запрос.УстановитьПараметр("нДт",НачалоДня(Дата));
	Запрос.УстановитьПараметр("МасСотр",Исполнители.ВыгрузитьКолонку("Сотрудник"));
	
	Тбл = Запрос.Выполнить().Выгрузить();
	
	Рег = Движения.РаботаВодителей;
	Рег.Загрузить(Тбл);
	Рег.Записать();
	
	
	//Кадровые отклонения
	Запрос.Текст = " 
	| SELECT
	| ТблЗП.Ссылка.Дата Период,
	| ТблЗП.Ссылка.Дата ДатаРаботы,
	| ТблЗП.Сотрудник,
	| ТблЗП.ссылка.Организация Организация,
	| ТБлЗП.КадровыеДанные ВидИспользованияРабочегоВремени,
	| 1 Дней,
	| 28800 Время	
	|
	|FROM Документ.РаботаЗаСмену.Исполнители как тблЗП
	| INNER JOIN Справочник.уатКлассификаторИспользованияРабочегоВремени СпрКЛ ON СпрКЛ.Ссылка = ТБлЗП.КадровыеДанные
	|WHERE тблЗП.ссылка = &сс  
	|    
	|";

	Тбл = Запрос.Выполнить().Выгрузить();
	
	Рег = Движения.уатРабочееВремяСотрудников;
	Рег.Загрузить(Тбл);
	Рег.Записать();
	

КонецПроцедуры

