//=================================================================================
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура вызывается перед записью в регистр.
//
Процедура ПередЗаписью(Отказ, Замещение = Истина)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РольДоступна("уатАдминистратор") Тогда
		Отказ = Истина;
		Сообщить("Изменение даты запрета редактирования разрешено только для роли <Администратор УАТ>", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
		
	Для каждого Запись из ЭтотОбъект Цикл
		Запись.ГраницаЗапретаИзменений = КонецДня(Запись.ГраницаЗапретаИзменений);
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
