
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Зап из ЭтотОбъект Цикл
		Если Зап.ДатаНачала >= Зап.ДатаОкончания Тогда
			Сообщить("Дата начала зимнего периода "+Зап.ДатаНачала+" больше даты окнчания "+Зап.ДатаОкончания);
			Отказ = Истина;
		КонецеСЛИ;
	КонецЦиклА;
		
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗимниеПериоды.ДатаНачала КАК ДатаНачала,
	               |	ЗимниеПериоды.ДатаОкончания
	               |ИЗ
	               |	РегистрСведений.ЗимниеПериоды КАК ЗимниеПериоды
	               |
	               |УПОРЯДОЧИТЬ ПО
				   |	ДатаНачала";
				   Тбл = Запрос.Выполнить().Выгрузить();
				   Для а=1 по Тбл.Количество()-1 Цикл
					   Стр = Тбл[а];
					   Если Тбл[а].ДатаНачала <= Тбл[а-1].ДатаОкончания Тогда
						 Сообщить("Дата начала зимнего периода "+Тбл[а].ДатаНачала+" меньше даты окончания предыдущего "+Тбл[а-1].ДатаОкончания);  
						 Отказ = Истина;
					   КонецЕсли;
				   КонецЦиклА;
				   
	КонецПроцедуры
