////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Код) Тогда 
		Сообщить("Необходимо заполнить номер карты!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	уатОбщегоНазначения.уатПроверкаПравПередЗаписьюВСправочниках(ЭтотОбъект, Отказ, , Права);
	НайдЭлем = Справочники.уатПластиковыеКарты.НайтиПоКоду(Код);
	Если ЗначениеЗаполнено(НайдЭлем) И НайдЭлем <> Ссылка тогда
		ТекстСообщения = "Запись карты с номером """ + Код + """ не возможно. Уже существует карта с таким номером";
		ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения,Отказ);
	КонецЕсли;
	
		
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПраваУАТ;
#КонецЕсли