
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Стр Из Модели Цикл
		Движение = Движения.НормыГСМ.Добавить();
		Движение.Период   = Дата;
		Если ЗначениеЗаполнено(Стр.Модель) ТОгда
			Движение.Модель   = Стр.Модель;
		ИНАче
			Движение.Модель   = Неопределено;
		КонецЕСЛИ;
		Движение.Вес	  = Стр.Вес;
		Движение.ЛС	  	  = Стр.ЛС;
		Движение.ОборудованиеРабота  = Стр.ОборудованиеРабота;
		Движение.Норма	  = Стр.Норма;
		Движение.ТКоэф    = Стр.ТКоэф;
		Движение.НормаНаОборудование = Стр.НормаНаОборудование;
	КонецЦикла;
	Движения.НормыГСМ.Записать();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)        
	Если ОбменДанными.Загрузка = Истина ТОгда Возврат; КонецеСЛИ;
	Если ДополнительныеСвойства.Свойство("ПровестиБезПроверок") = Истина ТОгда Возврат; КонецесЛИ;
	
	Если ИзЦентра Тогда Отказ = Истина; Возврат; КонецеСЛИ;
	
	Если глОбщий.ИмяПользователяС1С() Тогда Возврат; КонецеСЛИ;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОборудованиеРаботыГСМ.Ссылка
	               |ИЗ
	               |	Справочник.ОборудованиеРаботыГСМ КАК ОборудованиеРаботыГСМ
	               |ГДЕ
	               |	ОборудованиеРаботыГСМ.Родитель В ИЕРАРХИИ(&Родитель)";
				   
				   Мас = Новый МАссив;
				   Мас.Добавить(Справочники.ОборудованиеРаботыГСМ.Надбавки);
				   Мас.Добавить(Справочники.ОборудованиеРаботыГСМ.УсловияРаботы);
					Мас.Добавить(Справочники.ОборудованиеРаботыГСМ.Отопители);
				   Запрос.УстановитьПараметр("Родитель",мАС);
				   ТБл = Запрос.Выполнить().Выгрузить();
	
	Для каждого стр из Модели Цикл
		Если Тбл.Найти(Стр.ОборудованиеРабота)=Неопределено Тогда
			Сообщить("Норма "+Стр.ОборудованиеРабота+" устанавливается только из управляющей компании!
			|Можно устанавливать только надбавки.");
			Отказ = Истина;
			ВозвраТ;
		КонецесЛИ;
	КонецЦиклА;

КонецПроцедуры

