
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Запись.ИдентификаторСтрокиОтчета) Тогда
		Запись.ИдентификаторСтрокиОтчета = Новый УникальныйИдентификатор;
	КонецЕсли;
	Если Параметры.Свойство("Год") И ЗначениеЗаполнено(Параметры.Год) Тогда
		Запись.Год = Параметры.Год;
	КонецЕсли;
	Если Параметры.Свойство("ТС") И ЗначениеЗаполнено(Параметры.ТС) Тогда
		Запись.ТС = Параметры.ТС;
	ИначеЕсли Параметры.Свойство("Колонна") И ЗначениеЗаполнено(Параметры.Колонна) Тогда
		Запись.Колонна = Параметры.Колонна;
		Запись.ГруппаТипов = Параметры.ГруппаТипов;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры
