////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С СЕРИЙНЫМИ НОМЕРАМИ

// Функция создает список серийных номеров с НачСН по КонСН
// Для создания списка получаем кусок серийного номера слева, который можно преобразовать в число.
//Создаем список исходя из диапазона полученных чисел
//
//Параметры: НачСН - начальное значение серийного номера 
//			 КонСН - Конечное значение серийного номера
//
//Возвращаемое значение:
//Список - список серийных номеров
Функция СоздатьСписокСерийныхНомеров(НачСН, КоличествоСН) Экспорт
	Список = новый СписокЗначений();
	ДлиннаЧисловойЧасти = 0;
	
	ЦифроваяЧастьСН = 0;
	БуквЧастьСН = "";
	сч = СтрДлина(НачСН);
	Пока сч >= 1 Цикл //идем посимвольно справа налево и ищем букву
		Стр = Сред(НачСН, сч, 1);
		Если Найти("0123456789", Стр) = 0 Тогда //это не цифра
			БуквЧастьСН = Лев(НачСН, сч);
			ДлиннаЧисловойЧасти = СтрДлина(Прав(НачСН, СтрДлина(НачСН) - сч));
			ЦифроваяЧастьСН = ?(сч = СтрДлина(НачСН), 0, Число(Прав(НачСН, СтрДлина(НачСН) - сч)));
			Прервать;
		КонецЕсли;
		сч = сч - 1;
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(БуквЧастьСН) тогда
		Попытка 
			ДлиннаЧисловойЧасти = СтрДлина(НачСН);
			ЦифроваяЧастьСН = Число(НачСН);
		Исключение
		КонецПопытки;
	КонецЕсли;
	Если ДлиннаЧисловойЧасти = 0 тогда
		ДлиннаЧисловойЧасти = 1;
	КонецЕсли;
	Список.Добавить(НачСН);                      
	ПредНомер = НачСН;
	
	Для сч = 1 по КоличествоСН-1 Цикл //один мы уже ранее добавили, поэтому здесь на 1 меньше
		Если СтрДлина(БуквЧастьСН + СтрЗаменить(Строка(ПредНомер)," ","")) < СтрДлина(БуквЧастьСН + Формат(ЦифроваяЧастьСН + сч ,"ЧГ=")) тогда
			ДлиннаЧисловойЧасти = ДлиннаЧисловойЧасти + 1;
		КонецЕсли;
		сн = БуквЧастьСН + Формат(ЦифроваяЧастьСН + сч, "ЧВН=; ЧГ=" + ?(ДлиннаЧисловойЧасти <> 0,";ЧЦ=" + ДлиннаЧисловойЧасти,""));
		Список.Добавить(сн);	
		ПредНомер = ЦифроваяЧастьСН + сч;
	КонецЦикла;	
	
	Возврат Список;	
КонецФункции
