
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ИмяКа = СокрЛП(Контрагент);
	
	Дата = НачалоДня(Дата)+КодСимвола(Лев(ИмяКА,1));
	
	псДень = День(КонецМЕсяца(Дата))+1;
	Для каждого стр из Маршруты Цикл
		
		Если Стр.Маршрут.Владелец <> Контрагент ТОгда
			Сообщить("В строке "+(Маршруты.Индекс(Стр)+1)+" выбран маршрут другого заказчика! "+Стр.Маршрут.Владелец);
			Отказ = Истина;
		КонецЕСЛИ;
		
		Для а=псДень по 31 Цикл
			Стр["д"+а] = Ложь;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
