&НаСервере
Процедура ДобавитьЗаписьАналитикуФорма(СоответствиеРеквизита, СтрокаТЧ)
	РеквизитФормыВЗначение("Объект").ДобавитьЗаписьАналитику(СоответствиеРеквизита, СтрокаТЧ, Объект.Контрагент);	
КонецПроцедуры

#Область КомандыВыбора

&НаКлиенте
Процедура Выбрать(Команда)	
	ВыбраноСоответствие();	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеРеквизитаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(СоответствиеРеквизита) И БыстрыйВыбор Тогда
		ВыбраноСоответствие();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраноСоответствие(ВыбранноеЗначение = "")
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		СоответствиеРеквизита = ВыбранноеЗначение;		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СоответствиеРеквизита) Тогда
		ДобавитьЗаписьАналитикуФорма(СоответствиеРеквизита, СтрокаТЧ);
		
		Результат = Новый Структура;
		Результат.Вставить("СтрокаТЧ", СтрокаТЧ);
		Результат.Вставить("СоответствиеРеквизита", СоответствиеРеквизита);
		Результат.Вставить("ИмяКолонки", ИмяКолонки);
		Результат.Вставить("БыстрыйВыбор", БыстрыйВыбор);
		
		Закрыть(Результат);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажате соответствие для " + """" + СтрокаТЧ + """";
		Сообщение.Поле = "СоответствиеРеквизита";
		Сообщение.УстановитьДанные("Объект");
		//Сообщение.Поле = "ВыбранныеКолонки[" + Строка.НомерСтроки + "].КолонкаExcel";
		//Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Пропустить(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("СтрокаТЧ", СтрокаТЧ);
	Результат.Вставить("ИмяКолонки", ИмяКолонки);
	Результат.Вставить("СоответствиеРеквизита", ПредопределенноеЗначение("Справочник.уатТипыТС.ПустаяСсылка"));
	Результат.Вставить("БыстрыйВыбор", БыстрыйВыбор);
	Закрыть(Результат); 	
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " " + Параметры.Заголовок;		
	КонецЕсли;	
		
	Если Параметры.Свойство("СтрокаТЧ") И Параметры.Свойство("МасТип") И Параметры.Свойство("Контрагент") И Параметры.Свойство("ИмяКолонки") Тогда
				
		СтрокаТЧ = Параметры.СтрокаТЧ;
		Объект.Контрагент = Параметры.Контрагент;
		ИмяКолонки = Параметры.ИмяКолонки;
		
		Для каждого ЭлементТип Из Параметры.МасТип Цикл
			Если ЭлементТип.Ссылка = Null Тогда
				Продолжить;	
			КонецЕсли;	
			Элементы.СоответствиеРеквизита.СписокВыбора.Добавить(ЭлементТип.Ссылка, Строка(ЭлементТип.Процент) + "%  " + СокрЛП(ЭлементТип.Ссылка.Код) + " " + ЭлементТип.Ссылка.Наименование);
		КонецЦикла;
		
		Если Параметры.Свойство("БыстрыйВыбор") Тогда
			БыстрыйВыбор = Параметры.БыстрыйВыбор;			
		КонецЕсли;	
		
	КонецЕсли;
			
	Если Параметры.Свойство("кТипы") Тогда
		
		Массив = Новый Массив;
		Для каждого кТип Из Параметры.кТипы Цикл
			Массив.Добавить(кТип);
		КонецЦикла;	
		
		ОписаниеТиповС = Новый ОписаниеТипов(Массив);

		Элементы.СоответствиеРеквизита.ОграничениеТипа = ОписаниеТиповС;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СоответствиеРеквизита = Неопределено;
	Элементы.СоответствиеРеквизита.ВыбиратьТип = Истина;
	Элементы.СоответствиеРеквизита.РежимВыбораИзСписка = Ложь; 	
			
КонецПроцедуры












