
&НаКлиенте
Процедура РежимДвиженияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.РежимДвижения.ТекущиеДанные.ТипДанныхТЧ = Объект.ТипДанныхТЧ;
		Элементы.РежимДвижения.ТекущиеДанные.ОдинВодитель = 2;
		Если Объект.ТипДанныхТЧ = 2 Тогда
			Элементы.РежимДвижения.ТекущиеДанные.ОдинВодитель = Объект.ОдинВодитель;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовФормы()
	Элементы.ОдинВодитель.Видимость = (Объект.ТипДанныхТЧ = 2);
	Элементы.РежимДвижения.ОтборСтрок = Новый ФиксированнаяСтруктура("ТипДанныхТЧ", Объект.ТипДанныхТЧ);
	Если Объект.ТипДанныхТЧ = 2 Тогда
		Элементы.РежимДвижения.ОтборСтрок = Новый ФиксированнаяСтруктура("ОдинВодитель", Объект.ОдинВодитель);
	КонецЕсли;
	Элементы.РежимДвиженияТипДанныхТЧ.Видимость = глОбщий.ИмяПользователяС1С();;
	Элементы.РежимДвиженияОдинВодитель.Видимость = глОбщий.ИмяПользователяС1С();;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьТЧПоВодителям(ОдинВодитель)
	Элементы.РежимДвижения.ОтборСтрок = Новый ФиксированнаяСтруктура("ОдинВодитель", ОдинВодитель);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Описание параметров видимости данных в табличной части
	//Реквизит "ТипДанныхТЧ":
	// 0 - данные об опасных участках
	// 1 - данные о дорожно-климатических условиях
	// 2 - данные о режиме движения/отдыха водителей
	//Реквизит "ОдинВодитель"
	// 0 - данные о поездке с одним водителем
	// 1 - данные о поездке с двумя водителем
	
	ВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОдинВодительПриИзменении(Элемент)
	ВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ТипДанныхТЧПриИзменении(Элемент)
	ВидимостьЭлементовФормы();
КонецПроцедуры
