Процедура СделатьЗапись(ТС,ПЛ) Экспорт
	
	Зап = РегистрыСведений.ОшибкиБСМТС.СоздатьМенеджерЗаписи();
	Зап.ТС = ТС;
	Зап.Прочитать();
	
	Если Зап.Выбран() Тогда 
		Если Зап.ДатаИсправления=Дата(1,1,1) Тогда
			Возврат;
		ИНачеЕсли Зап.ПутЛистИсп.Дата > ПЛ.Дата Тогда
			Возврат;
		КонецЕСли;;
	КонецЕСли;
	
	Зап.ТС = ТС;
	Зап.ПутЛист = ПЛ;
	Зап.ДатаОшибки = ТекущаяДАта();
	Зап.ДатаИсправления=Дата(1,1,1);
	Зап.ПутЛистИсп = Неопределено;
	Зап.Записать();
	
КонецПроцедуры

Процедура СнятьЗапись(ТС,ПЛ) Экспорт
	Зап = РегистрыСведений.ОшибкиБСМТС.СоздатьМенеджерЗаписи();
	Зап.ТС = ТС;
	Зап.Прочитать();
	
	Если Зап.Выбран()=Ложь Тогда Возврат; КонецЕСли;
	
	Если Зап.ДатаИсправления<>Дата(1,1,1) Тогда
		Возврат; 
	ИНачеЕсли Зап.ПутЛист.Дата > ПЛ.Дата Тогда
			Возврат;
	КонецЕСли;
	
	
	Зап.ТС = ТС;
	Зап.ПутЛистИсп = ПЛ;
	Зап.ДатаИсправления = ТекущаяДАта();
	Зап.Записать();
		
КонецПроцедуры