
&НаКлиенте
Процедура Заполнить(Команда)
	мДанные = ПолучитьДанныеНаСервере(фПериод.ДатаНачала, фПериод.ДатаОкончания, фКонтрагент, фСписокПутевых.ВыгрузитьЗначения());
	ЗаполнитьТаблицуИзМассива(Объект.ПутевыеЛисты, мДанные);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНаСервере(пДатаНачала, пДатаОкончания, пКонтрагент, пМассивПутевыхЛистов)
	мОбъектОбработки = Обработки.ВыгрузкаСМАГазпром.Создать();
	мОбъектОбработки.Дата1 = пДатаНачала;
	мОбъектОбработки.Дата2 = пДатаОкончания;
	мОбъектОбработки.Заполнить( , пКонтрагент, пМассивПутевыхЛистов);
	
	Возврат ПреобразоватьТаблицуВМассивСтруктур(мОбъектОбработки.ПутевыеЛисты.Выгрузить());
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВсе(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Функция ПреобразованиеВСтруктуру(пСтрокаТаблицы)
	
	мСтрокаИменКолонок = ПолучитьСтрокуКолонок();
	мСтрокаИменКолонок = Сред(мСтрокаИменКолонок, 2);
	вСтруктура = Новый Структура(мСтрокаИменКолонок);
	ЗаполнитьЗначенияСвойств(вСтруктура, пСтрокаТаблицы);
	
	Возврат вСтруктура;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтрокуКолонок(пТаблица = Неопределено)
	мСтрокаИменКолонок = "";
	Если пТаблица = Неопределено Тогда
		мОбъектОбработки = Обработки.ВыгрузкаСМАГазпром.Создать();
		мТаблица = мОбъектОбработки.ПутевыеЛисты.Выгрузить();
	Иначе
		мТаблица = пТаблица;
	КонецЕсли;
	Для Каждого мКолонка Из мТаблица.Колонки Цикл
		мСтрокаИменКолонок = мСтрокаИменКолонок + "," + мКолонка.Имя;
	КонецЦикла;
	
	Возврат Сред(мСтрокаИменКолонок, 2);
КонецФункции

&НаСервереБезКонтекста
Функция ПреобразоватьТаблицуВМассивСтруктур(пТаблица, пЧистыйМассив = Ложь)
	вМассив = Новый Массив;
	мСтрокаИменКолонок = ПолучитьСтрокуКолонок(пТаблица);
	
	
	мЧистыйМассив = пЧистыйМассив И Найти(мСтрокаИменКолонок, ",") = 0;
	
	Для Каждого мСтрока Из пТаблица Цикл
		Если Не мЧистыйМассив Тогда
			мСтруктура = Новый Структура(мСтрокаИменКолонок);
			ЗаполнитьЗначенияСвойств(мСтруктура, мСтрока);
			вМассив.Добавить(мСтруктура);
		Иначе
			вМассив.Добавить(мСтрока[мСтрокаИменКолонок]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат вМассив;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	фПериод.ДатаНачала = ТекущаяДата();
	фПериод.ДатаОкончания = ТекущаяДата();
	Если фСписокПутевых.Количество() > 0 Тогда
		Заполнить(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуИзМассива(пТаблицаЗначенийФормы, пМассивСтруктур, пОчищать = Истина, пИменаЗаполняемыхПолей = "")
	Если пОчищать Тогда
		пТаблицаЗначенийФормы.Очистить();
	КонецЕсли;
	
	Если пМассивСтруктур.Количество() > 0 Тогда
		Для Каждого мЭлемент Из пМассивСтруктур Цикл
			мСтрока = пТаблицаЗначенийФормы.Добавить();
			ЗаполнитьЗначенияСвойств(мСтрока, мЭлемент);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутевыеЛистыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ПутевыеЛистыПолеВыгрузки" ТОгда
		мСтрокаТаблицы = Объект.ПутевыеЛисты.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если мСтрокаТаблицы.ФлагНеЗагружен Тогда
			мСтруктураВыбраннойСтроки = ПреобразованиеВСтруктуру(мСтрокаТаблицы);
			Выгрузить(мСтруктураВыбраннойСтроки);
		Иначе
			Текст = "Внимание!!!
			|Путевой лист - " + Строка(мСтрокаТаблицы.ПутевойЛист) + " уже загружен в СМА!
			|Вы хотите повторить выгрузку?";
			
			мДополнительныеПараметры = Новый Структура("СтрокаТаблицы", мСтрокаТаблицы);
			мОписаниеОповещенияОбработкаОтветаНаВопросПовторитьВыгрузку = Новый ОписаниеОповещения("ОбработкаОтветаНаВопросПовторитьВыгрузку", ЭтаФорма, мДополнительныеПараметры);
			ПоказатьВопрос(мОписаниеОповещенияОбработкаОтветаНаВопросПовторитьВыгрузку, Текст, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;	
	КонецЕСЛИ;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаВопросПовторитьВыгрузку(пРезультат, пДополнительныеПараметры) Экспорт
	Если пРезультат = КодВозвратаДиалога.Да Тогда
		пДополнительныеПараметры.СтрокаТаблицы.ФлагНеЗагружен = Истина;
		мСтруктураВыбраннойСтроки = ПреобразованиеВСтруктуру(пДополнительныеПараметры.СтрокаТаблицы);
		Выгрузить(мСтруктураВыбраннойСтроки);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Выгрузить(флтСтр = Неопределено, ПосмотретьФайлВыгрузки = Ложь) Экспорт
	
	Отказ = Ложь;
	Если флтСтр = Неопределено Тогда
		//Для каждого Стр из ПутевыеЛисты Цикл
		//	
		//	// + Lexx от 23.03.2017
		//	//Принимаем новую систему логина и пароля для получение Токена
		//	//Данные берутся из карточки контрагента, указанного в путевом листе
		//	//- это может быть непосредственно контрагент СМА - работа напрямую, а может быть субподрядчик, через которого идет работа с контрагентом СМА
		//	//Обязательно проверим заполнение этих реквизитов
		//	ЛогинСМА = Стр.ПутевойЛист.Контрагент.ПользовательСМА;
		//	ПарольСМА = Стр.ПутевойЛист.Контрагент.ПарольСМА;
		//	Если СокрЛП(ЛогинСМА) = "" Или СокрЛП(ПарольСМА) = "" Тогда
		//		Сообщить("В путевом листе - " + СокрЛП(Стр.ПутевойЛист.Номер) + " для контрагента " + Стр.ПутевойЛист.Контрагент + "  не указаны данные для входа в СМА! ПЛ не выгружен!");
		//		Продолжить;
		//	КонецЕсли;	
		//	
		//	Токен = ПолучитьТОКЕН(ЛогинСМА,ПарольСМА);
		//	Если ТОкен = Неопределено ТОгда
		//		Сообщить("В путевом листе - " + СокрЛП(Стр.ПутевойЛист.Номер) + " для контрагента " + Стр.ПутевойЛист.Контрагент + " не удается получить токен для входа в СМА! ПЛ не выгружен!");
		//		Возврат;
		//	КонецЕсЛИ;
		//	// - Lexx от 23.03.2017
		//	
		//	
		//	
		//	// + Lexx от 12.09.2017
		//	//А если путевой лист уже выгружался, то его повторно отправлять не будем
		//	//Если Не Стр.ФлагНеЗагружен Тогда
		//	//	Продолжить;
		//	//КонецЕсли;	
		//	// - Lexx от 12.09.2017
		//	ОтправкаВСМА(Отказ,Стр,Токен);
		//КонеЦЦикла;
	Иначе
		// + Lexx от 09.10.2017
		//Попытаемся выгрузить ПЛ по этой строке, если он еще не был загружен в СМА
		мОбъектОбработки = Обработки.ВыгрузкаСМАГазпром.Создать();
		
		Если флтСтр.ФлагНеЗагружен Тогда
			// + Lexx от 23.03.2017
			ЛогинСМА = флтСтр.ПутевойЛист.Контрагент.ПользовательСМА;
			ПарольСМА = флтСтр.ПутевойЛист.Контрагент.ПарольСМА;
			Если СокрЛП(ЛогинСМА) = "" Или СокрЛП(ПарольСМА) = "" Тогда
				Сообщить("В путевом листе - " + СокрЛП(флтСтр.ПутевойЛист.Номер) + " для контрагента " + флтСтр.ПутевойЛист.Контрагент + " не указаны данные для входа в СМА! ПЛ не выгружен!");
				Возврат;
			КонецЕсли;
			
			Токен = мОбъектОбработки.ПолучитьТОКЕН(ЛогинСМА, ПарольСМА);
			Если Токен = Неопределено Тогда
				Сообщить("В путевом листе - " + СокрЛП(флтСтр.ПутевойЛист.Номер) + " для контрагента " + флтСтр.ПутевойЛист.Контрагент + " не удается получить токен для входа в СМА! ПЛ не выгружен!");
				Возврат;
			КонецЕсли;
			// - Lexx от 23.03.2017
			
			мОбъектОбработки.ОтправкаВСМА(Отказ, флтСтр, Токен, ПосмотретьФайлВыгрузки);
			флтСтр.ФлагНеЗагружен = Отказ;
		КонецЕсли;	
		// - Lexx от 09.10.2017
	КонецЕСЛИ;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивПутевыхЛистов") Тогда
		фСписокПутевых.ЗагрузитьЗначения(Параметры.МассивПутевыхЛистов);
	КонецЕсли;
КонецПроцедуры
