
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НомерСтрокиДокумента") Тогда
		//TODO: добавить НомерСтрокиЭксель ?
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " " + Формат(Параметры.НомерСтрокиДокумента, "ЧГ=");
	КонецЕсли;
	Если Не Параметры.Свойство("СтрокаИсходныхДанных") Тогда
		Возврат;
	Иначе
		
		//Заявка.ТипТСExcel) 
		//Заявка.ЦехМаршрутExcel
		//Заявка.КоличествоТСExcel
		//Заявка.РаботаСExcel
		//Заявка.ДнейРаботыExcel
		//Заявка.СменаExcel
		//Заявка.ВремяПодачиExcel
		//Заявка.ОтветственныйExcel
		//Заявка.РежимРаботыExcel
		//Заявка.СуточныйПробегExcel
		//Заявка.МестоОказанияУслуг);
		мЗаголовки = "Тип ТС
		|Цех/Маршрут
		|Кол-во ТС
		|Работа с...
		|ДнейРаботы
		|Смена
		|ВремяПодачи
		|Ответственный
		|РежимРаботы
		|СуточныйПробег
		|Комментарий
		|Задание";
		
		мСтрокаИсходныхДанных = Параметры.СтрокаИсходныхДанных;
		мСтрока = СтрЗаменить(мСтрокаИсходныхДанных, "&", Символы.ПС);
		мВсегоСтрок = СтрЧислоСтрок(мСтрока);
		фТекст.ДобавитьСтроку("
		|" + СтрПолучитьСтроку(мЗаголовки, 1) + "			= " + СтрПолучитьСтроку(мСтрока, 1) + "
		|" + СтрПолучитьСтроку(мЗаголовки, 2) + "	= " + ?(мВсегоСтрок >= 2, СтрПолучитьСтроку(мСтрока, 2), "") + "
		|" + СтрПолучитьСтроку(мЗаголовки, 3) + "	= " + ?(мВсегоСтрок >= 3, СтрПолучитьСтроку(мСтрока, 3), "") + "
		|" + СтрПолучитьСтроку(мЗаголовки, 4) + "	= " + ?(мВсегоСтрок >= 4, СтрПолучитьСтроку(мСтрока, 5), "") + "
		|" + СтрПолучитьСтроку(мЗаголовки, 5) + "		= " + ?(мВсегоСтрок >= 5, СтрПолучитьСтроку(мСтрока, 6), "") + "
		|" + СтрПолучитьСтроку(мЗаголовки, 6) + "	= " + ?(мВсегоСтрок >= 6, СтрПолучитьСтроку(мСтрока, 7), "") + "
		|" + СтрПолучитьСтроку(мЗаголовки, 7) + "	= " + ?(мВсегоСтрок >= 7, СтрПолучитьСтроку(мСтрока, 8), "") + "
		|" + СтрПолучитьСтроку(мЗаголовки, 8) + "	= " + ?(мВсегоСтрок >= 8, СтрПолучитьСтроку(мСтрока, 9), "") + "
		|" + СтрПолучитьСтроку(мЗаголовки, 9) + "	= " + ?(мВсегоСтрок >= 9, СтрПолучитьСтроку(мСтрока, 10), "") + "
		|" + СтрПолучитьСтроку(мЗаголовки, 10) + "	= " + ?(мВсегоСтрок >= 10, СтрПолучитьСтроку(мСтрока, 11), "") + "
		|" + СтрПолучитьСтроку(мЗаголовки, 11) + "	= " + ?(мВсегоСтрок >= 11, СтрПолучитьСтроку(мСтрока, 12), "") + "
		|" + СтрПолучитьСтроку(мЗаголовки, 12) + "	= " + ?(мВсегоСтрок >= 12, СтрПолучитьСтроку(мСтрока, 13), "") + "
		|");
		
		фТабличныйДокумент = Новый ТабличныйДокумент;
		мМакет = Документы.Заявка.ПолучитьМакет("МакетИсходныхДанных");
		мОбластьОтступШапка = мМакет.ПолучитьОбласть("ОбластьОтступШапка");
		мОбластьОтступ = мМакет.ПолучитьОбласть("ОбластьОтступ");
		мОбластьОтступШапкаЗаголовок = мМакет.ПолучитьОбласть("ОбластьОтступШапкаЗаголовок");
		мОбластьЗаголовок = мМакет.ПолучитьОбласть("ОбластьЗаголовок");
		мОбластьЗначение = мМакет.ПолучитьОбласть("ОбластьЗначение");
		
		фТабличныйДокумент.Вывести(мОбластьОтступШапка);
		фТабличныйДокумент.Вывести(мОбластьОтступШапкаЗаголовок);
		Для Итр = 1 По мВсегоСтрок Цикл
			//мОбластьЗаголовок = мМакет.ПолучитьОбласть("ОбластьЗначение");
			мОбластьЗаголовок.Параметры.Заголовок = СтрПолучитьСтроку(мЗаголовки, Итр);
			фТабличныйДокумент.Присоединить(мОбластьЗаголовок);
		КонецЦикла;
		
		фТабличныйДокумент.Вывести(мОбластьОтступ);
		Для Итр =1 По мВсегоСтрок Цикл
			мОбластьЗначение.Параметры.Значение = СтрПолучитьСтроку(мСтрока, Итр);
			фТабличныйДокумент.Присоединить(мОбластьЗначение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
