//Глобальные переменные модуля УАТ==============================================
// УАТ (Управление автотранспортом)
Перем глПраваУАТ											Экспорт;  // Соответствие со значениями прав текущего пользователя
Перем глКомпонентаЗащитыУАТ                                 Экспорт;  // Переменная для загрузки внешней компоненты защиты


// УАТ (Управление автотранспортом)
//==============================================================================
Перем глОбщиеЗначения Экспорт; // Переменная содержит список значений требующихся при работе конфигурации


// СписокЗначений для накапливания пакета сообщений в журнал регистрации, 
// формируемых в клиентской бизнес-логике.
Перем СообщенияДляЖурналаРегистрации Экспорт; 