// Обработчик события УстановкаПараметровСеанса()
//
Процедура УстановкаПараметровСеанса()    

	ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(Новый Структура);
	ПолныеПрава.ОпределитьФактИспользованияРИБ();
	ПолныеПрава.УстановитьПараметрыСеанса();
	
	///////////////////////////////////////////////////
	//УАТ ПРОФ
	// ITOB +++
	ПараметрыСеанса.ItobИспользоватьОграниченияПравДоступаНаУровнеЗаписей = Ложь;
	// ITOB ---
	
	ПараметрыСеанса.уатSMSНомерСессииSMS4B    = 0;
	ПараметрыСеанса.уатSMSОсновнойСерверSMS4B = Истина;
	//УАТ ПРОФ
	//////////////////////////////////////////////////
	
	//Распределенная база
	ПараметрыСеанса.ксУдаленнаяБазаДляРегистрацииОбмена    = Константы.ксУдаленнаяБазаДляРегистрацииОбмена.Получить();
	//Если ЗначениеЗаполнено(ПараметрыСеанса.ксУдаленнаяБазаДляРегистрацииОбмена) Тогда
	//	ПараметрыСеанса.ксДатаЗапретаРедактирования = ПараметрыСеанса.ксУдаленнаяБазаДляРегистрацииОбмена.ДатаЗапретаРедактирования;
	//ИНаче
		ПараметрыСеанса.ксДатаЗапретаРедактирования = Дата(1,1,1,0,0,0);
	//КонецЕСЛИ;
	
КонецПроцедуры // УстановкаПараметровСеанса
