Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанныМи.Загрузка = Истина Тогда Возврат; КонецЕСЛИ;
	Если ЭтотОбъект.Количество()>1 Тогда Возврат; КонецеСЛИ;
	
	ЕСли Справочники.уатВидыДДД.ПроверкаОтветсвенного(ЭтотОбъект.Отбор.ВидДокумента.Значение)=ЛОжь ТОгда
		Отказ = Истина;
		Возврат;
	КонецЕСЛИ;
	
	Если ЭтотОбъект.Количество() = 0 И ЭтотОбъект.Модифицированность() = Истина Тогда
		#Если Клиент Тогда
			Предупреждение("Вам не дано право удалять этот объект!",,"ВНИМАНИЕ!!!");
		#КонецЕсли
		Отказ = Истина;
	КонецЕсли;	
	
	Для каждого Зап из ЭтотОбъект Цикл
		Зап.Лог = ""+ТекущаяДата()+" / "+ИмяПользователя()+" / "+ИмяКомпьютера();
		Зап.ДатаИзменения = ТекущаяДата();
	КонецЦикла;
КонецПроцедуры
