#Если Клиент Тогда
	
	////////////////////////////////////////////////////////////////////////////////
	// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА
	
	// Процедура установки начальных настроек отчета с использованием текста запроса
	//
	Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
		
		УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
		УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
		
		Если ДополнительныеПараметры <> Неопределено Тогда
			
			уатОбщегоНазначения.уатВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
			
		ИначеЕсли ДанныеОтчета.Количество() = 0 Тогда
			
			НоваяСтрока = ДанныеОтчета.Добавить();
			НоваяСтрока.ТипДанных = "План";
			
			НоваяСтрока = ДанныеОтчета.Добавить();
			НоваяСтрока.ТипДанных = "Факт";
			
		КонецЕсли;
		
		ТекстЗапроса = ПолучитьТекстЗапроса();
		
		// Инициализация текста запроса построителя отчета
		УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
		
		// Представления полей отчета.
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТипДанных", "Источник данных");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Организация", "Организация");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Сценарий", "Сценарий");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент", "Контрагент");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Договор", "Договор");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Заказ", "Заказ");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", "Подразделение");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Номенклатура", "Номенклатура");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТС", "Транспортное средство");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("МодельТС", "Модель ТС");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТипТС", "Тип ТС");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПараметрВыработки", "Параметр выработки");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДокументПланирования", "Документ планирования");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Маршрут", "Маршрут");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВидБилета", "Вид билета");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТСВыбыло", "ТС выбыло");
		
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Количество", "Количество (в единицах хранения)");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоБазовыхЕдиниц", "Количество (в базовых единицах)");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоЕдиницОтчетов", "Количество (в единицах отчетов)");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоОтклонение", "Отклонение (в единицах хранения)");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоБазовыхЕдиницОтклонение", "Отклонение (в базовых единицах)");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоЕдиницОтчетовОтклонение", "Отклонение (в единицах отчетов)");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("КоличествоОтклонениеПроцент", "Отклонение количества (%)");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьБезНДС", "Стоимость без НДС");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьБезНДСОтклонение", "Отклонение стоимости без НДС");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьБезНДСОтклонениеПроцент", "Отклонение стоимости без НДС (%)");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДС", "НДС");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСОтклонение", "Отклонение НДС");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("НДСОтклонениеПроцент", "Отклонение НДС (%)");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьСНДС", "Стоимость с НДС");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьСНДСОтклонение", "Отклонение стоимости с НДС");
		УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтоимостьСНДСОтклонениеПроцент", "Отклонение стоимости с НДС (%)");
		
		// Добавление показателей
		УниверсальныйОтчет.ДобавитьПоказатель("Количество", "Ед. хранения", Истина, "ЧЦ=15; ЧДЦ=3", "Количество", "Количество");
		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдиниц", "Базовых ед.", Ложь, "ЧЦ=15; ЧДЦ=3", "Количество");
		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетов", "Ед. отчетов", Ложь, "ЧЦ=15; ЧДЦ=3", "Количество");
		
		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоОтклонение", "Ед. хранения", Истина, "ЧЦ=15; ЧДЦ=3", "ОтклонениеКоличества", "Отклонение количества");
		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоБазовыхЕдиницОтклонение", "Базовых ед.", Ложь, "ЧЦ=15; ЧДЦ=3", "ОтклонениеКоличества");
		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдиницОтчетовОтклонение", "Ед. отчетов", Ложь, "ЧЦ=15; ЧДЦ=3", "ОтклонениеКоличества");
		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоОтклонениеПроцент", "%", Истина, "ЧЦ=15; ЧДЦ=2", "ОтклонениеКоличества");
		
		УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьБезНДС", "Без НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "Стоимость", "Стоимость");
		УниверсальныйОтчет.ДобавитьПоказатель("НДС", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "Стоимость", "Стоимость");
		УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьСНДС", "С НДС", Истина, "ЧЦ=15; ЧДЦ=2", "Стоимость");
		
		УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьБезНДСОтклонение", "Без НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "ОтклонениеСтоимости", "Отклонение стоимости");
		УниверсальныйОтчет.ДобавитьПоказатель("НДСОтклонение", "НДС", Ложь, "ЧЦ=15; ЧДЦ=2", "ОтклонениеСтоимости");
		УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьСНДСОтклонение", "С НДС", Истина, "ЧЦ=15; ЧДЦ=2", "ОтклонениеСтоимости");
		
		УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьБезНДСОтклонениеПроцент", "Без НДС, %", Ложь, "ЧЦ=15; ЧДЦ=2", "ОтклонениеСтоимости");
		УниверсальныйОтчет.ДобавитьПоказатель("НДСОтклонениеПроцент", "НДС, %", Ложь, "ЧЦ=15; ЧДЦ=2", "ОтклонениеСтоимости");
		УниверсальныйОтчет.ДобавитьПоказатель("СтоимостьСНДСОтклонениеПроцент", "С НДС, %", Истина, "ЧЦ=15; ЧДЦ=2", "ОтклонениеСтоимости");
		
		// Добавление предопределенных группировок строк отчета.
		УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Сценарий");
		УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ТС");
		
		// Добавление предопределенных группировок колонок отчета.
		УниверсальныйОтчет.ДобавитьИзмерениеКолонки("ТипДанных");
		
		// Добавление предопределенных отборов отчета.
		// Необходимо вызывать для каждого добавляемого отбора.
		// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
		УниверсальныйОтчет.ДобавитьОтбор("Сценарий");
		УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
		УниверсальныйОтчет.ДобавитьОтбор("ТС");
		УниверсальныйОтчет.ДобавитьОтбор("ТСВыбыло", Ложь, ВидСравнения.Равно, Ложь);
		
		// Добавление предопределенных полей порядка отчета.
		// Необходимо вызывать для каждого добавляемого поля порядка.
		// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
		
		// Установка связи подчиненных и родительских полей
		// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
		
		// Установка связи полей и измерений
		// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
		
		// Установка представлений полей
		УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
		
		// Установка типов значений свойств в отборах отчета
		УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
		
		// Заполнение начальных настроек универсального отчета
		УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
		
		// Добавление дополнительных полей
		// Необходимо вызывать для каждого добавляемого дополнительного поля.
		// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
		
	КонецПроцедуры // УстановитьНачальныеНастройки()
	
	Функция ПолучитьТекстЗапроса() Экспорт
		
		ТекстЗапроса = "";
		
		ЭталонныйТипДанных = ДанныеОтчета[0].ТипДанных;
		
		Для каждого СравниваемыеДанные из ДанныеОтчета Цикл
			
			СравниваемыйТипДанных = СравниваемыеДанные.ТипДанных;
			
			Если ЭталонныйТипДанных = "План" И СравниваемыйТипДанных = "Факт" Тогда
				
				ДобавитьФакт_План(ТекстЗапроса, СравниваемыеДанные, ДанныеОтчета[0]);
				
			ИначеЕсли ЭталонныйТипДанных = "Факт" И СравниваемыйТипДанных = "План" Тогда
				
				ДобавитьПлан_Факт(ТекстЗапроса, СравниваемыеДанные, ДанныеОтчета[0]);
				
			ИначеЕсли ЭталонныйТипДанных = "План" И СравниваемыйТипДанных = "План" Тогда
				
				ДобавитьПлан_План(ТекстЗапроса, СравниваемыеДанные, ДанныеОтчета[0]);
				
			ИначеЕсли ЭталонныйТипДанных = "Факт" И СравниваемыйТипДанных = "Факт" Тогда
				
				ДобавитьФакт_Факт(ТекстЗапроса, СравниваемыеДанные, ДанныеОтчета[0]);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "
		|{УПОРЯДОЧИТЬ ПО
		|	ТипДанных,
		|	Организация.*,
		|	Сценарий.*,
		|	Подразделение.*,
		|	ТС.*,
		|	МодельТС.*,
		|	ТипТС.*,
		|	ДокументПланирования.*,
		|	Номенклатура.*,
		|	ПараметрВыработки.*,
		|	Заказ.*,
		|	Контрагент.*,
		|	Договор.*,
		|	Маршрут.*,
		|	ВидБилета.*,
		|	Регистратор.*,
		|	Период,
		|	ПериодДень,
		|	ПериодНеделя,
		|	ПериодДекада,
		|	ПериодМесяц,
		|	ПериодКвартал,
		|	ПериодПолугодие,
		|	ПериодГод,
		|	Количество,
		|	КоличествоБазовыхЕдиниц,
		|	КоличествоЕдиницОтчетов,
		|	КоличествоОтклонение,
		|	КоличествоБазовыхЕдиницОтклонение,
		|	КоличествоЕдиницОтчетовОтклонение,
		|	КоличествоОтклонениеПроцент,
		|	СтоимостьБезНДС,
		|	НДС,
		|	СтоимостьСНДС,
		|	СтоимостьБезНДСОтклонение,
		|	СтоимостьБезНДСОтклонениеПроцент,
		|	НДСОтклонение,
		|	НДСОтклонениеПроцент,
		|	СтоимостьСНДСОтклонение,
		|	СтоимостьСНДСОтклонениеПроцент}
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(КоличествоБазовыхЕдиниц),
		|	СУММА(КоличествоЕдиницОтчетов),
		|	СУММА(КоличествоОтклонение),
		|	СУММА(КоличествоБазовыхЕдиницОтклонение),
		|	СУММА(КоличествоЕдиницОтчетовОтклонение),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СУММА(КоличествоОтклонение), 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(СУММА(Количество), 0) = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА СУММА(Количество) - СУММА(КоличествоОтклонение) = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ СУММА(КоличествоОтклонение) * 100 / (СУММА(Количество) - СУММА(КоличествоОтклонение))
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
		|	СУММА(СтоимостьБезНДС),
		|	СУММА(НДС),
		|	СУММА(СтоимостьСНДС),
		|	СУММА(СтоимостьБезНДСОтклонение),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СУММА(СтоимостьБезНДСОтклонение), 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(СУММА(СтоимостьБезНДС), 0) = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА СУММА(СтоимостьБезНДС) - СУММА(СтоимостьБезНДСОтклонение) = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ СУММА(СтоимостьБезНДСОтклонение) * 100 / (СУММА(СтоимостьБезНДС) - СУММА(СтоимостьБезНДСОтклонение))
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
		|	СУММА(НДСОтклонение),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СУММА(НДСОтклонение), 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(СУММА(НДС), 0) = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА СУММА(НДС) - СУММА(НДСОтклонение) = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ СУММА(НДСОтклонение) * 100 / (СУММА(НДС) - СУММА(НДСОтклонение))
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК НДСОтклонениеПроцент,
		|	СУММА(СтоимостьСНДСОтклонение),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СУММА(СтоимостьСНДСОтклонение), 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(СУММА(СтоимостьСНДС), 0) = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА СУММА(СтоимостьСНДС) - СУММА(СтоимостьСНДСОтклонение) = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ СУММА(СтоимостьСНДСОтклонение) * 100 / (СУММА(СтоимостьСНДС) - СУММА(СтоимостьСНДСОтклонение))
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
		|ПО
		|	ОБЩИЕ
		|{ИТОГИ ПО
		|	ТипДанных,
		|	Организация.*,
		|	Сценарий.*,
		|	Подразделение.*,
		|	ТС.*,
		|	МодельТС.*,
		|	ТипТС.*,
		|	ДокументПланирования.*,
		|	Номенклатура.*,
		|	ПараметрВыработки.*,
		|	Заказ.*,
		|	Контрагент.*,
		|	Договор.*,
		|	Маршрут.*,
		|	ВидБилета.*,
		|	Регистратор.*,
		|	Период,
		|	ПериодДень,
		|	ПериодНеделя,
		|	ПериодДекада,
		|	ПериодМесяц,
		|	ПериодКвартал,
		|	ПериодПолугодие,
		|	ПериодГод}";
		
		Возврат ТекстЗапроса;
		
	КонецФункции // ПолучитьТекстЗапроса()
	
	// Эталонные данные - "Факт", текущие данные - "План"
	Процедура ДобавитьПлан_Факт(ТекстЗапроса, СравниваемыеДанные, ЭталонныеДанные)
		
		НомерСтроки = СравниваемыеДанные.НомерСтроки;
		
		Если НомерСтроки > 1 Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ " + ?(ПустаяСтрока(ТекстЗапроса), "РАЗРЕШЕННЫЕ", "") + "
		|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
		|	РезультатАнализа.Организация КАК Организация,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Организация) КАК ОрганизацияПредставление,
		|	РезультатАнализа.Сценарий КАК Сценарий,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Сценарий) КАК СценарийПредставление,
		|	РезультатАнализа.Подразделение КАК Подразделение,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Подразделение) КАК ПодразделениеПредставление,
		|	РезультатАнализа.ТС КАК ТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТС) КАК ТСПредставление,
		|	РезультатАнализа.МодельТС КАК МодельТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.МодельТС) КАК МодельТСПредставление,
		|	РезультатАнализа.ТипТС КАК ТипТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТипТС) КАК ТипТСПредставление,
		|	РезультатАнализа.ДокументПланирования КАК ДокументПланирования,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ДокументПланирования) КАК ДокументПланированияПредставление,
		|	РезультатАнализа.Номенклатура КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Номенклатура) КАК НоменклатураПредставление,
		|	РезультатАнализа.ПараметрВыработки КАК ПараметрВыработки,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ПараметрВыработки) КАК ПараметрВыработкиПредставление,
		|	РезультатАнализа.Заказ КАК Заказ,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Заказ) КАК ЗаказПредставление,
		|	РезультатАнализа.Контрагент КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Контрагент) КАК КонтрагентПредставление,
		|	РезультатАнализа.Договор КАК Договор,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Договор) КАК ДоговорПредставление,
		|	РезультатАнализа.Маршрут КАК Маршрут,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Маршрут) КАК МаршрутПредставление,
		|	РезультатАнализа.ВидБилета КАК ВидБилета,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ВидБилета) КАК ВидБилетаПредставление,
		|	РезультатАнализа.Регистратор КАК Регистратор,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
		|	РезультатАнализа.Период КАК Период,
		|	РезультатАнализа.ПериодДень КАК ПериодДень,
		|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
		|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
		|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
		|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
		|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
		|	РезультатАнализа.ПериодГод КАК ПериодГод,
		|	РезультатАнализа.Количество КАК Количество,
		|	РезультатАнализа.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
		|	РезультатАнализа.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
		|	РезультатАнализа.КоличествоОтклонение КАК КоличествоОтклонение,
		|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение КАК КоличествоБазовыхЕдиницОтклонение,
		|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение КАК КоличествоЕдиницОтчетовОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.Количество = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	РезультатАнализа.НДС КАК НДС,
		|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
		|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
		|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.НДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.НДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК НДСОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
		|{ВЫБРАТЬ
		|	Организация.*,
		|	Сценарий.*,
		|	Подразделение.*,
		|	ТС.*,
		|	МодельТС.*,
		|	ТипТС.*,
		|	ДокументПланирования.*,
		|	Номенклатура.*,
		|	ПараметрВыработки.*,
		|	Заказ.*,
		|	Контрагент.*,
		|	Договор.*,
		|	Маршрут.*,
		|	ВидБилета.*,
		|	Регистратор.*,
		|	Период,
		|	ПериодДень,
		|	ПериодНеделя,
		|	ПериодДекада,
		|	ПериодМесяц,
		|	ПериодКвартал,
		|	ПериодПолугодие,
		|	ПериодГод,
		|	Количество,
		|	КоличествоБазовыхЕдиниц,
		|	КоличествоЕдиницОтчетов,
		|	КоличествоОтклонение,
		|	КоличествоБазовыхЕдиницОтклонение,
		|	КоличествоЕдиницОтчетовОтклонение,
		|	КоличествоОтклонениеПроцент,
		|	СтоимостьБезНДС,
		|	НДС,
		|	СтоимостьСНДС,
		|	СтоимостьБезНДСОтклонение,
		|	СтоимостьБезНДСОтклонениеПроцент,
		|	НДСОтклонение,
		|	НДСОтклонениеПроцент,
		|	СтоимостьСНДСОтклонение,
		|	СтоимостьСНДСОтклонениеПроцент}
		|ИЗ
		|	(ВЫБРАТЬ
		|		АнализируемыеДанные.Период КАК Период,
		|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
		|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
		|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
		|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
		|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
		|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
		|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
		|		АнализируемыеДанные.Регистратор КАК Регистратор,
		|		АнализируемыеДанные.Организация КАК Организация,
		|		АнализируемыеДанные.Сценарий КАК Сценарий,
		|		АнализируемыеДанные.Подразделение КАК Подразделение,
		|		АнализируемыеДанные.ТС КАК ТС,
		|		АнализируемыеДанные.МодельТС КАК МодельТС,
		|		АнализируемыеДанные.ТипТС КАК ТипТС,
		|		АнализируемыеДанные.ДокументПланирования КАК ДокументПланирования,
		|		АнализируемыеДанные.Номенклатура КАК Номенклатура,
		|		АнализируемыеДанные.ПараметрВыработки КАК ПараметрВыработки,
		|		АнализируемыеДанные.Заказ КАК Заказ,
		|		АнализируемыеДанные.Контрагент КАК Контрагент,
		|		АнализируемыеДанные.Договор КАК Договор,
		|		АнализируемыеДанные.Маршрут КАК Маршрут,
		|		АнализируемыеДанные.ВидБилета КАК ВидБилета,
		|		СУММА(АнализируемыеДанные.ПланКоличество) КАК Количество,
		|		СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
		|		СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
		|		СУММА(АнализируемыеДанные.ПланКоличество) - СУММА(АнализируемыеДанные.ФактКоличество) КАК КоличествоОтклонение,
		|		СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиниц) - СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиницОтклонение,
		|		СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетов) - СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетовОтклонение,
		|		СУММА(АнализируемыеДанные.ПланСтоимостьБезНДС) КАК СтоимостьБезНДС,
		|		СУММА(АнализируемыеДанные.ПланНДС) КАК НДС,
		|		СУММА(АнализируемыеДанные.ПланСтоимостьСНДС) КАК СтоимостьСНДС,
		|		СУММА(АнализируемыеДанные.ПланСтоимостьБезНДС) - СУММА(АнализируемыеДанные.ФактСтоимостьБезНДС) КАК СтоимостьБезНДСОтклонение,
		|		СУММА(АнализируемыеДанные.ПланНДС) - СУММА(АнализируемыеДанные.ФактНДС) КАК НДСОтклонение,
		|		СУММА(АнализируемыеДанные.ПланСтоимостьСНДС) - СУММА(АнализируемыеДанные.ФактСтоимостьСНДС) КАК СтоимостьСНДСОтклонение
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПланРаботыТСОбороты.Период КАК Период,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ДЕНЬ) КАК ПериодДень,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ДЕКАДА) КАК ПериодДекада,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ГОД) КАК ПериодГод,
		|			ПланРаботыТСОбороты.Регистратор КАК Регистратор,
		|			ПланРаботыТСОбороты.ДокументПланирования.Организация КАК Организация,
		|			ПланРаботыТСОбороты.Сценарий КАК Сценарий,
		|			ПланРаботыТСОбороты.Подразделение КАК Подразделение,
		|			ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|					ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования
		|				ИНАЧЕ &СправочникТСПустаяСсылка
		|			КОНЕЦ КАК Справочник.уатТС) КАК ТС,
		|			ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|					ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.Модель
		|				КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
		|					ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования					
		|				ИНАЧЕ &СправочникМодельТСПустаяСсылка
		|			КОНЕЦ КАК Справочник.уатМоделиТС) КАК МодельТС,
		|			ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|					ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.ТипТС
		|				КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
		|					ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.ТипТС
		|				ИНАЧЕ ПланРаботыТСОбороты.ДетализацияПланирования
		|			КОНЕЦ КАК Справочник.уатТипыТС) КАК ТипТС,
		|			ПланРаботыТСОбороты.ДокументПланирования КАК ДокументПланирования,
		|			ПланРаботыТСОбороты.Номенклатура КАК Номенклатура,
		|			ПланРаботыТСОбороты.ПараметрВыработки КАК ПараметрВыработки,
		|			ПланРаботыТСОбороты.Заказ КАК Заказ,
		|			ПланРаботыТСОбороты.Контрагент КАК Контрагент,
		|			ПланРаботыТСОбороты.Договор КАК Договор,
		|			ПланРаботыТСОбороты.Маршрут КАК Маршрут,
		|			ПланРаботыТСОбороты.ВидБилета КАК ВидБилета,
		|			ПланРаботыТСОбороты.КоличествоОборот КАК ПланКоличество,
		|			ПланРаботыТСОбороты.КоличествоОборот * ПланРаботыТСОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ПланКоличествоБазовыхЕдиниц,
		|			ПланРаботыТСОбороты.КоличествоОборот * ПланРаботыТСОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЕСТЬNULL(ПланРаботыТСОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК ПланКоличествоЕдиницОтчетов,
		|			0 КАК ФактКоличество,
		|			0 КАК ФактКоличествоБазовыхЕдиниц,
		|			0 КАК ФактКоличествоЕдиницОтчетов,
		|			ПланРаботыТСОбороты.СтоимостьОборот КАК ПланСтоимостьБезНДС,
		|			ПланРаботыТСОбороты.НДСОборот КАК ПланНДС,
		|			ПланРаботыТСОбороты.СтоимостьОборот + ПланРаботыТСОбороты.НДСОборот КАК ПланСтоимостьСНДС,
		|			0 КАК ФактСтоимостьБезНДС,
		|			0 КАК ФактНДС,
		|			0 КАК ФактСтоимостьСНДС
		|		ИЗ
		|			РегистрНакопления.уатПланРаботыТС.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ВЫБОР КОГДА &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " = НЕОПРЕДЕЛЕНО ТОГДА ИСТИНА ИНАЧЕ Сценарий = &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " КОНЕЦ) КАК ПланРаботыТСОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВыработкаОбороты.Период,
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ДЕНЬ),
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, НЕДЕЛЯ),
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ДЕКАДА),
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, МЕСЯЦ),
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, КВАРТАЛ),
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ПОЛУГОДИЕ),
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ГОД),
		|			ВыработкаОбороты.Регистратор,
		|			ВыработкаОбороты.Организация,
		|			NULL,
		|			ВыработкаОбороты.Подразделение,
		|			ВыработкаОбороты.ТС,
		|			ВыработкаОбороты.ТС.Модель,
		|			ВыработкаОбороты.ТС.ТипТС,
		|			NULL,
		|			NULL,
		|			ВыработкаОбороты.ПараметрВыработки,
		|			NULL,
		|			ВыработкаОбороты.Контрагент,
		|			NULL,
		|			ВыработкаОбороты.Маршрут,
		|			NULL,
		|			0,
		|			0,
		|			0,
		|			ВЫБОР
		|				КОГДА ВыработкаОбороты.ПараметрВыработки.Временный
		|					ТОГДА -РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, ВыработкаОбороты.КоличествоОборот), ЧАС) * 3600 / 6000 + ВыработкаОбороты.КоличествоОборот / 6000 + РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, ВыработкаОбороты.КоличествоОборот), ЧАС)
		|				ИНАЧЕ ВыработкаОбороты.КоличествоОборот
		|			КОНЕЦ,
		|			NULL,
		|			NULL,
		|			0,
		|			0,
		|			0,
		|			NULL,
		|			NULL,
		|			NULL
		|		ИЗ
		|			РегистрНакопления.уатВыработкаТС.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, ) КАК ВыработкаОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВыручкаОбороты.Период,
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ДЕНЬ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, НЕДЕЛЯ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ДЕКАДА),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, МЕСЯЦ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, КВАРТАЛ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ПОЛУГОДИЕ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ГОД),
		|			ВыручкаОбороты.Регистратор,
		|			ВыручкаОбороты.Организация,
		|			NULL,
		|			NULL,
		|			ВыручкаОбороты.ТС,
		|			ВыручкаОбороты.ТС.Модель,
		|			ВыручкаОбороты.ТС.ТипТС,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			ВыручкаОбороты.Маршрут,
		|			ВыручкаОбороты.Билет.ВидБилета,
		|			0,
		|			0,
		|			0,
		|			ВыручкаОбороты.КоличествоОборот,
		|			NULL,
		|			NULL,
		|			0,
		|			0,
		|			0,
		|			ВыручкаОбороты.СуммаОборот,
		|			NULL,
		|			NULL
		|		ИЗ
		|			РегистрНакопления.уатВыручка.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, ) КАК ВыручкаОбороты) КАК АнализируемыеДанные
		|	
		|	СГРУППИРОВАТЬ ПО
		|		АнализируемыеДанные.Организация,
		|		АнализируемыеДанные.Сценарий,
		|		АнализируемыеДанные.Подразделение,
		|		АнализируемыеДанные.ТС,
		|		АнализируемыеДанные.МодельТС,
		|		АнализируемыеДанные.ТипТС,
		|		АнализируемыеДанные.ДокументПланирования,
		|		АнализируемыеДанные.Номенклатура,
		|		АнализируемыеДанные.ПараметрВыработки,
		|		АнализируемыеДанные.Заказ,
		|		АнализируемыеДанные.Контрагент,
		|		АнализируемыеДанные.Договор,
		|		АнализируемыеДанные.Маршрут,
		|		АнализируемыеДанные.ВидБилета,
		|		АнализируемыеДанные.Регистратор,
		|		АнализируемыеДанные.Период,
		|		АнализируемыеДанные.ПериодДень,
		|		АнализируемыеДанные.ПериодНеделя,
		|		АнализируемыеДанные.ПериодДекада,
		|		АнализируемыеДанные.ПериодМесяц,
		|		АнализируемыеДанные.ПериодКвартал,
		|		АнализируемыеДанные.ПериодПолугодие,
		|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
		|{ГДЕ
		|	РезультатАнализа.Организация.*,
		|	РезультатАнализа.Сценарий.*,
		|	РезультатАнализа.Подразделение.*,
		|	РезультатАнализа.ТС.*,
		|	РезультатАнализа.МодельТС.*,
		|	РезультатАнализа.ТипТС.*,
		|	РезультатАнализа.ДокументПланирования.*,
		|	РезультатАнализа.Номенклатура.*,
		|	РезультатАнализа.ПараметрВыработки.*,
		|	РезультатАнализа.Заказ.*,
		|	РезультатАнализа.Контрагент.*,
		|	РезультатАнализа.Договор.*,
		|	РезультатАнализа.Маршрут.*,
		|	РезультатАнализа.ВидБилета.*,
		|	РезультатАнализа.Регистратор.*,
		|	РезультатАнализа.Период,
		|	РезультатАнализа.ПериодДень,
		|	РезультатАнализа.ПериодНеделя,
		|	РезультатАнализа.ПериодДекада,
		|	РезультатАнализа.ПериодМесяц,
		|	РезультатАнализа.ПериодКвартал,
		|	РезультатАнализа.ПериодПолугодие,
		|	РезультатАнализа.ПериодГод,
		|	РезультатАнализа.Количество,
		|	РезультатАнализа.КоличествоБазовыхЕдиниц,
		|	РезультатАнализа.КоличествоЕдиницОтчетов,
		|	РезультатАнализа.КоличествоОтклонение,
		|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение,
		|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.КоличествоОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.Количество = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьБезНДС,
		|	РезультатАнализа.НДС,
		|	РезультатАнализа.СтоимостьСНДС,
		|	РезультатАнализа.СтоимостьБезНДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.СтоимостьБезНДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК СтоимостьБезНДСОтклонениеПроцент,
		|	РезультатАнализа.НДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.НДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.НДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК НДСОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьСНДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.СтоимостьСНДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК СтоимостьСНДСОтклонениеПроцент,
		|	(ВЫБОР
		|		КОГДА РезультатАнализа.ТС.ДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА РезультатАнализа.ТС.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ЛОЖЬ
		|		КОНЕЦ) КАК ТСВыбыло}";
		
	КонецПроцедуры // ДобавитьПлан_Факт()
	
	// Эталонные данные - "План", текущие данные - "Факт"
	Процедура ДобавитьФакт_План(ТекстЗапроса, СравниваемыеДанные, ЭталонныеДанные)
		
		НомерСтроки = СравниваемыеДанные.НомерСтроки;
		
		Если НомерСтроки > 1 Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ " + ?(ПустаяСтрока(ТекстЗапроса), "РАЗРЕШЕННЫЕ", "") + "
		|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
		|	РезультатАнализа.Организация КАК Организация,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Организация) КАК ОрганизацияПредставление,
		|	РезультатАнализа.Сценарий КАК Сценарий,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Сценарий) КАК СценарийПредставление,
		|	РезультатАнализа.Подразделение КАК Подразделение,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Подразделение) КАК ПодразделениеПредставление,
		|	РезультатАнализа.ТС КАК ТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТС) КАК ТСПредставление,
		|	РезультатАнализа.МодельТС КАК МодельТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.МодельТС) КАК МодельТСПредставление,
		|	РезультатАнализа.ТипТС КАК ТипТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТипТС) КАК ТипТСПредставление,
		|	РезультатАнализа.ДокументПланирования КАК ДокументПланирования,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ДокументПланирования) КАК ДокументПланированияПредставление,
		|	РезультатАнализа.Номенклатура КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Номенклатура) КАК НоменклатураПредставление,
		|	РезультатАнализа.ПараметрВыработки КАК ПараметрВыработки,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ПараметрВыработки) КАК ПараметрВыработкиПредставление,
		|	РезультатАнализа.Заказ КАК Заказ,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Заказ) КАК ЗаказПредставление,
		|	РезультатАнализа.Контрагент КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Контрагент) КАК КонтрагентПредставление,
		|	РезультатАнализа.Договор КАК Договор,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Договор) КАК ДоговорПредставление,
		|	РезультатАнализа.Маршрут КАК Маршрут,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Маршрут) КАК МаршрутПредставление,
		|	РезультатАнализа.ВидБилета КАК ВидБилета,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ВидБилета) КАК ВидБилетаПредставление,
		|	РезультатАнализа.Регистратор КАК Регистратор,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
		|	РезультатАнализа.Период КАК Период,
		|	РезультатАнализа.ПериодДень КАК ПериодДень,
		|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
		|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
		|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
		|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
		|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
		|	РезультатАнализа.ПериодГод КАК ПериодГод,
		|	РезультатАнализа.Количество КАК Количество,
		|	РезультатАнализа.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
		|	РезультатАнализа.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
		|	РезультатАнализа.КоличествоОтклонение КАК КоличествоОтклонение,
		|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение КАК КоличествоБазовыхЕдиницОтклонение,
		|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение КАК КоличествоЕдиницОтчетовОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.Количество = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	РезультатАнализа.НДС КАК НДС,
		|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
		|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
		|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.НДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.НДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК НДСОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
		|{ВЫБРАТЬ
		|	Организация.*,
		|	Сценарий.*,
		|	Подразделение.*,
		|	ТС.*,
		|	МодельТС.*,
		|	ТипТС.*,
		|	ДокументПланирования.*,
		|	Номенклатура.*,
		|	ПараметрВыработки.*,
		|	Заказ.*,
		|	Контрагент.*,
		|	Договор.*,
		|	Маршрут.*,
		|	ВидБилета.*,
		|	Регистратор.*,
		|	Период,
		|	ПериодДень,
		|	ПериодНеделя,
		|	ПериодДекада,
		|	ПериодМесяц,
		|	ПериодКвартал,
		|	ПериодПолугодие,
		|	ПериодГод,
		|	Количество,
		|	КоличествоБазовыхЕдиниц,
		|	КоличествоЕдиницОтчетов,
		|	КоличествоОтклонение,
		|	КоличествоБазовыхЕдиницОтклонение,
		|	КоличествоЕдиницОтчетовОтклонение,
		|	КоличествоОтклонениеПроцент,
		|	СтоимостьБезНДС,
		|	НДС,
		|	СтоимостьСНДС,
		|	СтоимостьБезНДСОтклонение,
		|	СтоимостьБезНДСОтклонениеПроцент,
		|	НДСОтклонение,
		|	НДСОтклонениеПроцент,
		|	СтоимостьСНДСОтклонение,
		|	СтоимостьСНДСОтклонениеПроцент}
		|ИЗ
		|	(ВЫБРАТЬ
		|		АнализируемыеДанные.Период КАК Период,
		|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
		|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
		|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
		|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
		|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
		|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
		|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
		|		АнализируемыеДанные.Регистратор КАК Регистратор,
		|		АнализируемыеДанные.Организация КАК Организация,
		|		АнализируемыеДанные.Сценарий КАК Сценарий,
		|		АнализируемыеДанные.Подразделение КАК Подразделение,
		|		АнализируемыеДанные.ТС КАК ТС,
		|		АнализируемыеДанные.МодельТС КАК МодельТС,
		|		АнализируемыеДанные.ТипТС КАК ТипТС,
		|		АнализируемыеДанные.ДокументПланирования КАК ДокументПланирования,
		|		АнализируемыеДанные.Номенклатура КАК Номенклатура,
		|		АнализируемыеДанные.ПараметрВыработки КАК ПараметрВыработки,
		|		АнализируемыеДанные.Заказ КАК Заказ,
		|		АнализируемыеДанные.Контрагент КАК Контрагент,
		|		АнализируемыеДанные.Договор КАК Договор,
		|		АнализируемыеДанные.Маршрут КАК Маршрут,
		|		АнализируемыеДанные.ВидБилета КАК ВидБилета,
		|		СУММА(АнализируемыеДанные.ФактКоличество) КАК Количество,
		|		СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
		|		СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
		|		СУММА(АнализируемыеДанные.ФактКоличество) - СУММА(АнализируемыеДанные.ПланКоличество) КАК КоличествоОтклонение,
		|		СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиниц) - СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиницОтклонение,
		|		СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетов) - СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетовОтклонение,
		|		СУММА(АнализируемыеДанные.ФактСтоимостьБезНДС) КАК СтоимостьБезНДС,
		|		СУММА(АнализируемыеДанные.ФактНДС) КАК НДС,
		|		СУММА(АнализируемыеДанные.ФактСтоимостьСНДС) КАК СтоимостьСНДС,
		|		СУММА(АнализируемыеДанные.ФактСтоимостьБезНДС) - СУММА(АнализируемыеДанные.ПланСтоимостьБезНДС) КАК СтоимостьБезНДСОтклонение,
		|		СУММА(АнализируемыеДанные.ФактНДС) - СУММА(АнализируемыеДанные.ПланНДС) КАК НДСОтклонение,
		|		СУММА(АнализируемыеДанные.ФактСтоимостьСНДС) - СУММА(АнализируемыеДанные.ПланСтоимостьСНДС) КАК СтоимостьСНДСОтклонение
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВыработкаОбороты.Период КАК Период,
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ДЕНЬ) КАК ПериодДень,
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ДЕКАДА) КАК ПериодДекада,
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
		|			НАЧАЛОПЕРИОДА(ВыработкаОбороты.Период, ГОД) КАК ПериодГод,
		|			ВыработкаОбороты.Регистратор КАК Регистратор,
		|			ВыработкаОбороты.Организация КАК Организация,
		|			NULL КАК Сценарий,
		|			ВыработкаОбороты.Подразделение КАК Подразделение,
		|			ВыработкаОбороты.ТС КАК ТС,
		|			ВыработкаОбороты.ТС.Модель КАК МодельТС,
		|			ВыработкаОбороты.ТС.ТипТС КАК ТипТС,
		|			NULL КАК ДокументПланирования,
		|			NULL КАК Номенклатура,
		|			ВыработкаОбороты.ПараметрВыработки КАК ПараметрВыработки,
		|			NULL КАК Заказ,
		|			ВыработкаОбороты.Контрагент КАК Контрагент,
		|			NULL КАК Договор,
		|			ВыработкаОбороты.Маршрут КАК Маршрут,
		|			NULL КАК ВидБилета,
		|			ВЫБОР
		|				КОГДА ВыработкаОбороты.ПараметрВыработки.Временный
		|					ТОГДА -РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, ВыработкаОбороты.КоличествоОборот), ЧАС) * 3600 / 6000 + ВыработкаОбороты.КоличествоОборот / 6000 + РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, ВыработкаОбороты.КоличествоОборот), ЧАС)
		|				ИНАЧЕ ВыработкаОбороты.КоличествоОборот
		|			КОНЕЦ КАК ФактКоличество,
		|			NULL КАК ФактКоличествоБазовыхЕдиниц,
		|			NULL КАК ФактКоличествоЕдиницОтчетов,
		|			0 КАК ПланКоличество,
		|			0 КАК ПланКоличествоБазовыхЕдиниц,
		|			0 КАК ПланКоличествоЕдиницОтчетов,
		|			NULL КАК ФактСтоимостьБезНДС,
		|			NULL КАК ФактНДС,
		|			NULL КАК ФактСтоимостьСНДС,
		|			0 КАК ПланСтоимостьБезНДС,
		|			0 КАК ПланНДС,
		|			0 КАК ПланСтоимостьСНДС
		|		ИЗ
		|			РегистрНакопления.уатВыработкаТС.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ) КАК ВыработкаОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВыручкаОбороты.Период,
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ДЕНЬ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, НЕДЕЛЯ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ДЕКАДА),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, МЕСЯЦ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, КВАРТАЛ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ПОЛУГОДИЕ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОбороты.Период, ГОД),
		|			ВыручкаОбороты.Регистратор,
		|			ВыручкаОбороты.Организация,
		|			NULL,
		|			NULL,
		|			ВыручкаОбороты.ТС,
		|			ВыручкаОбороты.ТС.Модель,
		|			ВыручкаОбороты.ТС.ТипТС,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			ВыручкаОбороты.Маршрут,
		|			ВыручкаОбороты.Билет.ВидБилета,
		|			ВыручкаОбороты.КоличествоОборот,
		|			NULL,
		|			NULL,
		|			0,
		|			0,
		|			0,
		|			ВыручкаОбороты.СуммаОборот,
		|			NULL,
		|			NULL,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			РегистрНакопления.уатВыручка.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ) КАК ВыручкаОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПланРаботыТСОбороты.Период,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ДЕНЬ),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, НЕДЕЛЯ),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ДЕКАДА),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, МЕСЯЦ),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, КВАРТАЛ),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ПОЛУГОДИЕ),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОбороты.Период, ГОД),
		|			ПланРаботыТСОбороты.Регистратор,
		|			ПланРаботыТСОбороты.ДокументПланирования.Организация,
		|			ПланРаботыТСОбороты.Сценарий,
		|			ПланРаботыТСОбороты.Подразделение,
		|			ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|						ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования
		|					ИНАЧЕ &СправочникТСПустаяСсылка
		|				КОНЕЦ КАК Справочник.уатТС),
		|			ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|						ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.Модель
		|					КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
		|						ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования
		|					ИНАЧЕ &СправочникМодельТСПустаяСсылка
		|				КОНЕЦ КАК Справочник.уатМоделиТС),
		|			ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|						ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.ТипТС
		|					КОГДА ПланРаботыТСОбороты.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
		|						ТОГДА ПланРаботыТСОбороты.ДетализацияПланирования.ТипТС
		|					ИНАЧЕ ПланРаботыТСОбороты.ДетализацияПланирования
		|				КОНЕЦ КАК Справочник.уатТипыТС),
		|			ПланРаботыТСОбороты.ДокументПланирования,
		|			ПланРаботыТСОбороты.Номенклатура,
		|			ПланРаботыТСОбороты.ПараметрВыработки,
		|			ПланРаботыТСОбороты.Заказ,
		|			ПланРаботыТСОбороты.Контрагент,
		|			ПланРаботыТСОбороты.Договор,
		|			ПланРаботыТСОбороты.Маршрут,
		|			ПланРаботыТСОбороты.ВидБилета,
		|			0,
		|			0,
		|			0,
		|			ПланРаботыТСОбороты.КоличествоОборот,
		|			ПланРаботыТСОбороты.КоличествоОборот * ПланРаботыТСОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
		|			ПланРаботыТСОбороты.КоличествоОборот * ПланРаботыТСОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЕСТЬNULL(ПланРаботыТСОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1),
		|			0,
		|			0,
		|			0,
		|			ПланРаботыТСОбороты.СтоимостьОборот,
		|			ПланРаботыТСОбороты.НДСОборот,
		|			ПланРаботыТСОбороты.СтоимостьОборот + ПланРаботыТСОбороты.НДСОборот
		|		ИЗ
		|			РегистрНакопления.уатПланРаботыТС.Обороты(
		|					&ДатаНач1,
		|					&ДатаКон1,
		|					Регистратор,
		|					ВЫБОР
		|						КОГДА &Сценарий1 = НЕОПРЕДЕЛЕНО
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ Сценарий = &Сценарий1
		|					КОНЕЦ) КАК ПланРаботыТСОбороты) КАК АнализируемыеДанные
		|	
		|	СГРУППИРОВАТЬ ПО
		|		АнализируемыеДанные.Организация,
		|		АнализируемыеДанные.Сценарий,
		|		АнализируемыеДанные.Подразделение,
		|		АнализируемыеДанные.ТС,
		|		АнализируемыеДанные.МодельТС,
		|		АнализируемыеДанные.ТипТС,
		|		АнализируемыеДанные.ДокументПланирования,
		|		АнализируемыеДанные.Номенклатура,
		|		АнализируемыеДанные.ПараметрВыработки,
		|		АнализируемыеДанные.Заказ,
		|		АнализируемыеДанные.Контрагент,
		|		АнализируемыеДанные.Договор,
		|		АнализируемыеДанные.Маршрут,
		|		АнализируемыеДанные.ВидБилета,
		|		АнализируемыеДанные.Регистратор,
		|		АнализируемыеДанные.Период,
		|		АнализируемыеДанные.ПериодДень,
		|		АнализируемыеДанные.ПериодНеделя,
		|		АнализируемыеДанные.ПериодДекада,
		|		АнализируемыеДанные.ПериодМесяц,
		|		АнализируемыеДанные.ПериодКвартал,
		|		АнализируемыеДанные.ПериодПолугодие,
		|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
		|{ГДЕ
		|	РезультатАнализа.Организация.*,
		|	РезультатАнализа.Сценарий.*,
		|	РезультатАнализа.Подразделение.*,
		|	РезультатАнализа.ТС.*,
		|	РезультатАнализа.МодельТС.*,
		|	РезультатАнализа.ТипТС.*,
		|	РезультатАнализа.ДокументПланирования.*,
		|	РезультатАнализа.Номенклатура.*,
		|	РезультатАнализа.ПараметрВыработки.*,
		|	РезультатАнализа.Заказ.*,
		|	РезультатАнализа.Контрагент.*,
		|	РезультатАнализа.Договор.*,
		|	РезультатАнализа.Маршрут.*,
		|	РезультатАнализа.ВидБилета.*,
		|	РезультатАнализа.Регистратор.*,
		|	РезультатАнализа.Период,
		|	РезультатАнализа.ПериодДень,
		|	РезультатАнализа.ПериодНеделя,
		|	РезультатАнализа.ПериодДекада,
		|	РезультатАнализа.ПериодМесяц,
		|	РезультатАнализа.ПериодКвартал,
		|	РезультатАнализа.ПериодПолугодие,
		|	РезультатАнализа.ПериодГод,
		|	РезультатАнализа.Количество,
		|	РезультатАнализа.КоличествоБазовыхЕдиниц,
		|	РезультатАнализа.КоличествоЕдиницОтчетов,
		|	РезультатАнализа.КоличествоОтклонение,
		|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение,
		|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.КоличествоОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.Количество = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьБезНДС,
		|	РезультатАнализа.НДС,
		|	РезультатАнализа.СтоимостьСНДС,
		|	РезультатАнализа.СтоимостьБезНДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.СтоимостьБезНДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК СтоимостьБезНДСОтклонениеПроцент,
		|	РезультатАнализа.НДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.НДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.НДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК НДСОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьСНДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.СтоимостьСНДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК СтоимостьСНДСОтклонениеПроцент,
		|	(ВЫБОР
		|		КОГДА РезультатАнализа.ТС.ДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА РезультатАнализа.ТС.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ЛОЖЬ
		|		КОНЕЦ) КАК ТСВыбыло}";
		
	КонецПроцедуры // ДобавитьФакт_План()
	
	// Эталонные данные - "План", текущие данные - "План"
	Процедура ДобавитьПлан_План(ТекстЗапроса, СравниваемыеДанные, ЭталонныеДанные)
		
		НомерСтроки = СравниваемыеДанные.НомерСтроки;
		
		Если НомерСтроки > 1 Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ " + ?(ПустаяСтрока(ТекстЗапроса), "РАЗРЕШЕННЫЕ", "") + "
		|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
		|	РезультатАнализа.Организация КАК Организация,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Организация) КАК ОрганизацияПредставление,
		|	РезультатАнализа.Сценарий КАК Сценарий,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Сценарий) КАК СценарийПредставление,
		|	РезультатАнализа.Подразделение КАК Подразделение,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Подразделение) КАК ПодразделениеПредставление,
		|	РезультатАнализа.ТС КАК ТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТС) КАК ТСПредставление,
		|	РезультатАнализа.МодельТС КАК МодельТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.МодельТС) КАК МодельТСПредставление,
		|	РезультатАнализа.ТипТС КАК ТипТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТипТС) КАК ТипТСПредставление,
		|	РезультатАнализа.ДокументПланирования КАК ДокументПланирования,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ДокументПланирования) КАК ДокументПланированияПредставление,
		|	РезультатАнализа.Номенклатура КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Номенклатура) КАК НоменклатураПредставление,
		|	РезультатАнализа.ПараметрВыработки КАК ПараметрВыработки,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ПараметрВыработки) КАК ПараметрВыработкиПредставление,
		|	РезультатАнализа.Заказ КАК Заказ,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Заказ) КАК ЗаказПредставление,
		|	РезультатАнализа.Контрагент КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Контрагент) КАК КонтрагентПредставление,
		|	РезультатАнализа.Договор КАК Договор,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Договор) КАК ДоговорПредставление,
		|	РезультатАнализа.Маршрут КАК Маршрут,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Маршрут) КАК МаршрутПредставление,
		|	РезультатАнализа.ВидБилета КАК ВидБилета,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ВидБилета) КАК ВидБилетаПредставление,
		|	РезультатАнализа.Регистратор КАК Регистратор,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
		|	РезультатАнализа.Период КАК Период,
		|	РезультатАнализа.ПериодДень КАК ПериодДень,
		|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
		|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
		|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
		|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
		|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
		|	РезультатАнализа.ПериодГод КАК ПериодГод,
		|	РезультатАнализа.Количество КАК Количество,
		|	РезультатАнализа.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
		|	РезультатАнализа.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
		|	РезультатАнализа.КоличествоОтклонение КАК КоличествоОтклонение,
		|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение КАК КоличествоБазовыхЕдиницОтклонение,
		|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение КАК КоличествоЕдиницОтчетовОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.Количество = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	РезультатАнализа.НДС КАК НДС,
		|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
		|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
		|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.НДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.НДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК НДСОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
		|{ВЫБРАТЬ
		|	Организация.*,
		|	Сценарий.*,
		|	Подразделение.*,
		|	ТС.*,
		|	МодельТС.*,
		|	ТипТС.*,
		|	ДокументПланирования.*,
		|	Номенклатура.*,
		|	ПараметрВыработки.*,
		|	Заказ.*,
		|	Контрагент.*,
		|	Договор.*,
		|	Маршрут.*,
		|	ВидБилета.*,
		|	Регистратор.*,
		|	Период,
		|	ПериодДень,
		|	ПериодНеделя,
		|	ПериодДекада,
		|	ПериодМесяц,
		|	ПериодКвартал,
		|	ПериодПолугодие,
		|	ПериодГод,
		|	Количество,
		|	КоличествоБазовыхЕдиниц,
		|	КоличествоЕдиницОтчетов,
		|	КоличествоОтклонение,
		|	КоличествоБазовыхЕдиницОтклонение,
		|	КоличествоЕдиницОтчетовОтклонение,
		|	КоличествоОтклонениеПроцент,
		|	СтоимостьБезНДС,
		|	НДС,
		|	СтоимостьСНДС,
		|	СтоимостьБезНДСОтклонение,
		|	СтоимостьБезНДСОтклонениеПроцент,
		|	НДСОтклонение,
		|	НДСОтклонениеПроцент,
		|	СтоимостьСНДСОтклонение,
		|	СтоимостьСНДСОтклонениеПроцент}
		|ИЗ
		|	(ВЫБРАТЬ
		|		АнализируемыеДанные.Период КАК Период,
		|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
		|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
		|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
		|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
		|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
		|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
		|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
		|		АнализируемыеДанные.Регистратор КАК Регистратор,
		|		АнализируемыеДанные.Организация КАК Организация,
		|		АнализируемыеДанные.Сценарий КАК Сценарий,
		|		АнализируемыеДанные.Подразделение КАК Подразделение,
		|		АнализируемыеДанные.ТС КАК ТС,
		|		АнализируемыеДанные.МодельТС КАК МодельТС,
		|		АнализируемыеДанные.ТипТС КАК ТипТС,
		|		АнализируемыеДанные.ДокументПланирования КАК ДокументПланирования,
		|		АнализируемыеДанные.Номенклатура КАК Номенклатура,
		|		АнализируемыеДанные.ПараметрВыработки КАК ПараметрВыработки,
		|		АнализируемыеДанные.Заказ КАК Заказ,
		|		АнализируемыеДанные.Контрагент КАК Контрагент,
		|		АнализируемыеДанные.Договор КАК Договор,
		|		АнализируемыеДанные.Маршрут КАК Маршрут,
		|		АнализируемыеДанные.ВидБилета КАК ВидБилета,
		|		СУММА(АнализируемыеДанные.ПланКоличествоТекущие) КАК Количество,
		|		СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиницТекущие) КАК КоличествоБазовыхЕдиниц,
		|		СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетовТекущие) КАК КоличествоЕдиницОтчетов,
		|		СУММА(АнализируемыеДанные.ПланКоличествоТекущие) - СУММА(АнализируемыеДанные.ПланКоличествоЭталонные) КАК КоличествоОтклонение,
		|		СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиницТекущие) - СУММА(АнализируемыеДанные.ПланКоличествоБазовыхЕдиницЭталонные) КАК КоличествоБазовыхЕдиницОтклонение,
		|		СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетовТекущие) - СУММА(АнализируемыеДанные.ПланКоличествоЕдиницОтчетовЭталонные) КАК КоличествоЕдиницОтчетовОтклонение,
		|		СУММА(АнализируемыеДанные.ПланСтоимостьБезНДСТекущие) КАК СтоимостьБезНДС,
		|		СУММА(АнализируемыеДанные.ПланНДСТекущие) КАК НДС,
		|		СУММА(АнализируемыеДанные.ПланСтоимостьСНДСТекущие) КАК СтоимостьСНДС,
		|		СУММА(АнализируемыеДанные.ПланСтоимостьБезНДСТекущие) - СУММА(АнализируемыеДанные.ПланСтоимостьБезНДСЭталонные) КАК СтоимостьБезНДСОтклонение,
		|		СУММА(АнализируемыеДанные.ПланНДСТекущие) - СУММА(АнализируемыеДанные.ПланНДСЭталонные) КАК НДСОтклонение,
		|		СУММА(АнализируемыеДанные.ПланСтоимостьСНДСТекущие) - СУММА(АнализируемыеДанные.ПланСтоимостьСНДСЭталонные) КАК СтоимостьСНДСОтклонение
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПланРаботыТСОборотыТекущие.Период КАК Период,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, ДЕНЬ) КАК ПериодДень,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, НЕДЕЛЯ) КАК ПериодНеделя,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, ДЕКАДА) КАК ПериодДекада,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, МЕСЯЦ) КАК ПериодМесяц,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, КВАРТАЛ) КАК ПериодКвартал,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыТекущие.Период, ГОД) КАК ПериодГод,
		|			ПланРаботыТСОборотыТекущие.Регистратор КАК Регистратор,
		|			ПланРаботыТСОборотыТекущие.ДокументПланирования.Организация КАК Организация,
		|			ПланРаботыТСОборотыТекущие.Сценарий КАК Сценарий,
		|			ПланРаботыТСОборотыТекущие.Подразделение КАК Подразделение,
		|			ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|					ТОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования
		|				ИНАЧЕ &СправочникТСПустаяСсылка
		|			КОНЕЦ КАК Справочник.уатТС) КАК ТС,
		|			ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|					ТОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования.Модель
		|				КОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
		|					ТОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования					
		|				ИНАЧЕ &СправочникМодельТСПустаяСсылка
		|			КОНЕЦ КАК Справочник.уатМоделиТС) КАК МодельТС,
		|			ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|					ТОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования.ТипТС
		|				КОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
		|					ТОГДА ПланРаботыТСОборотыТекущие.ДетализацияПланирования.ТипТС
		|				ИНАЧЕ ПланРаботыТСОборотыТекущие.ДетализацияПланирования
		|			КОНЕЦ КАК Справочник.уатТипыТС) КАК ТипТС,
		|			ПланРаботыТСОборотыТекущие.ДокументПланирования КАК ДокументПланирования,
		|			ПланРаботыТСОборотыТекущие.Номенклатура КАК Номенклатура,
		|			ПланРаботыТСОборотыТекущие.ПараметрВыработки КАК ПараметрВыработки,
		|			ПланРаботыТСОборотыТекущие.Заказ КАК Заказ,
		|			ПланРаботыТСОборотыТекущие.Контрагент КАК Контрагент,
		|			ПланРаботыТСОборотыТекущие.Договор КАК Договор,
		|			ПланРаботыТСОборотыТекущие.Маршрут КАК Маршрут,
		|			ПланРаботыТСОборотыТекущие.ВидБилета КАК ВидБилета,
		|			ПланРаботыТСОборотыТекущие.КоличествоОборот КАК ПланКоличествоТекущие,
		|			ПланРаботыТСОборотыТекущие.КоличествоОборот * ПланРаботыТСОборотыТекущие.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ПланКоличествоБазовыхЕдиницТекущие,
		|			ПланРаботыТСОборотыТекущие.КоличествоОборот * ПланРаботыТСОборотыТекущие.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЕСТЬNULL(ПланРаботыТСОборотыТекущие.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК ПланКоличествоЕдиницОтчетовТекущие,
		|			0 КАК ПланКоличествоЭталонные,
		|			0 КАК ПланКоличествоБазовыхЕдиницЭталонные,
		|			0 КАК ПланКоличествоЕдиницОтчетовЭталонные,
		|			ПланРаботыТСОборотыТекущие.СтоимостьОборот КАК ПланСтоимостьБезНДСТекущие,
		|			ПланРаботыТСОборотыТекущие.НДСОборот КАК ПланНДСТекущие,
		|			ПланРаботыТСОборотыТекущие.СтоимостьОборот + ПланРаботыТСОборотыТекущие.НДСОборот КАК ПланСтоимостьСНДСТекущие,
		|			0 КАК ПланСтоимостьБезНДСЭталонные,
		|			0 КАК ПланНДСЭталонные,
		|			0 КАК ПланСтоимостьСНДСЭталонные
		|		ИЗ
		|			РегистрНакопления.уатПланРаботыТС.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ВЫБОР КОГДА &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " = НЕОПРЕДЕЛЕНО ТОГДА ИСТИНА ИНАЧЕ Сценарий = &Сценарий" + Формат(НомерСтроки, "ЧГ=0") + " КОНЕЦ) КАК ПланРаботыТСОборотыТекущие
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ПланРаботыТСОборотыЭталонные.Период,
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, ДЕНЬ),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, НЕДЕЛЯ),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, ДЕКАДА),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, МЕСЯЦ),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, КВАРТАЛ),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, ПОЛУГОДИЕ),
		|			НАЧАЛОПЕРИОДА(ПланРаботыТСОборотыЭталонные.Период, ГОД),
		|			ПланРаботыТСОборотыЭталонные.Регистратор,
		|			ПланРаботыТСОборотыЭталонные.ДокументПланирования.Организация,
		|			ПланРаботыТСОборотыЭталонные.Сценарий,
		|			ПланРаботыТСОборотыЭталонные.Подразделение,
		|			ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|						ТОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования
		|					ИНАЧЕ &СправочникТСПустаяСсылка
		|				КОНЕЦ КАК Справочник.уатТС),
		|			ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|						ТОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования.Модель
		|					КОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
		|						ТОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования
		|					ИНАЧЕ &СправочникМодельТСПустаяСсылка
		|				КОНЕЦ КАК Справочник.уатМоделиТС),
		|			ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования ССЫЛКА Справочник.уатТС
		|						ТОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования.ТипТС
		|					КОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования ССЫЛКА Справочник.уатМоделиТС
		|						ТОГДА ПланРаботыТСОборотыЭталонные.ДетализацияПланирования.ТипТС
		|					ИНАЧЕ ПланРаботыТСОборотыЭталонные.ДетализацияПланирования
		|				КОНЕЦ КАК Справочник.уатТипыТС),
		|			ПланРаботыТСОборотыЭталонные.ДокументПланирования,
		|			ПланРаботыТСОборотыЭталонные.Номенклатура,
		|			ПланРаботыТСОборотыЭталонные.ПараметрВыработки,
		|			ПланРаботыТСОборотыЭталонные.Заказ,
		|			ПланРаботыТСОборотыЭталонные.Контрагент,
		|			ПланРаботыТСОборотыЭталонные.Договор,
		|			ПланРаботыТСОборотыЭталонные.Маршрут,
		|			ПланРаботыТСОборотыЭталонные.ВидБилета,
		|			0 КАК ПланКоличествоТекущие,
		|			0 КАК ПланКоличествоБазовыхЕдиницТекущие,
		|			0 КАК ПланыПродажКоличествоЕдиницОтчетовТекущие,
		|			ПланРаботыТСОборотыЭталонные.КоличествоОборот КАК ПланКоличествоЭталонные,
		|			ПланРаботыТСОборотыЭталонные.КоличествоОборот * ПланРаботыТСОборотыЭталонные.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ПланКоличествоБазовыхЕдиницЭталонные,
		|			ПланРаботыТСОборотыЭталонные.КоличествоОборот * ПланРаботыТСОборотыЭталонные.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент / ЕСТЬNULL(ПланРаботыТСОборотыЭталонные.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК ПланКоличествоЕдиницОтчетовЭталонные,
		|			0 КАК ПланСтоимостьБезНДСТекущие,
		|			0 КАК ПланНДСТекущие,
		|			0 КАК ПланСтоимостьСНДСТекущие,
		|			ПланРаботыТСОборотыЭталонные.СтоимостьОборот КАК ПланСтоимостьБезНДСЭталонные,
		|			ПланРаботыТСОборотыЭталонные.НДСОборот КАК ПланНДСЭталонные,
		|			ПланРаботыТСОборотыЭталонные.СтоимостьОборот + ПланРаботыТСОборотыЭталонные.НДСОборот КАК ПланСтоимостьСНДСЭталонные
		|		ИЗ
		|			РегистрНакопления.уатПланРаботыТС.Обороты(
		|					&ДатаНач1,
		|					&ДатаКон1,
		|					Регистратор,
		|					ВЫБОР
		|						КОГДА &Сценарий1 = НЕОПРЕДЕЛЕНО
		|							ТОГДА ИСТИНА
		|						ИНАЧЕ Сценарий = &Сценарий1
		|					КОНЕЦ) КАК ПланРаботыТСОборотыЭталонные) КАК АнализируемыеДанные
		|	
		|	СГРУППИРОВАТЬ ПО
		|		АнализируемыеДанные.Организация,
		|		АнализируемыеДанные.Сценарий,
		|		АнализируемыеДанные.Подразделение,
		|		АнализируемыеДанные.ТС,
		|		АнализируемыеДанные.МодельТС,
		|		АнализируемыеДанные.ТипТС,
		|		АнализируемыеДанные.ДокументПланирования,
		|		АнализируемыеДанные.Номенклатура,
		|		АнализируемыеДанные.ПараметрВыработки,
		|		АнализируемыеДанные.Заказ,
		|		АнализируемыеДанные.Контрагент,
		|		АнализируемыеДанные.Договор,
		|		АнализируемыеДанные.Маршрут,
		|		АнализируемыеДанные.ВидБилета,
		|		АнализируемыеДанные.Регистратор,
		|		АнализируемыеДанные.Период,
		|		АнализируемыеДанные.ПериодДень,
		|		АнализируемыеДанные.ПериодНеделя,
		|		АнализируемыеДанные.ПериодДекада,
		|		АнализируемыеДанные.ПериодМесяц,
		|		АнализируемыеДанные.ПериодКвартал,
		|		АнализируемыеДанные.ПериодПолугодие,
		|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
		|{ГДЕ
		|	РезультатАнализа.Организация.*,
		|	РезультатАнализа.Сценарий.*,
		|	РезультатАнализа.Подразделение.*,
		|	РезультатАнализа.ТС.*,
		|	РезультатАнализа.МодельТС.*,
		|	РезультатАнализа.ТипТС.*,
		|	РезультатАнализа.ДокументПланирования.*,
		|	РезультатАнализа.Номенклатура.*,
		|	РезультатАнализа.ПараметрВыработки.*,
		|	РезультатАнализа.Заказ.*,
		|	РезультатАнализа.Контрагент.*,
		|	РезультатАнализа.Договор.*,
		|	РезультатАнализа.Маршрут.*,
		|	РезультатАнализа.ВидБилета.*,
		|	РезультатАнализа.Регистратор.*,
		|	РезультатАнализа.Период,
		|	РезультатАнализа.ПериодДень,
		|	РезультатАнализа.ПериодНеделя,
		|	РезультатАнализа.ПериодДекада,
		|	РезультатАнализа.ПериодМесяц,
		|	РезультатАнализа.ПериодКвартал,
		|	РезультатАнализа.ПериодПолугодие,
		|	РезультатАнализа.ПериодГод,
		|	РезультатАнализа.Количество,
		|	РезультатАнализа.КоличествоБазовыхЕдиниц,
		|	РезультатАнализа.КоличествоЕдиницОтчетов,
		|	РезультатАнализа.КоличествоОтклонение,
		|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение,
		|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.КоличествоОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.Количество = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьБезНДС,
		|	РезультатАнализа.НДС,
		|	РезультатАнализа.СтоимостьСНДС,
		|	РезультатАнализа.СтоимостьБезНДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.СтоимостьБезНДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК СтоимостьБезНДСОтклонениеПроцент,
		|	РезультатАнализа.НДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.НДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.НДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК НДСОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьСНДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.СтоимостьСНДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК СтоимостьСНДСОтклонениеПроцент,
		|	(ВЫБОР
		|		КОГДА РезультатАнализа.ТС.ДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА РезультатАнализа.ТС.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ЛОЖЬ
		|		КОНЕЦ) КАК ТСВыбыло}";
		
	КонецПроцедуры // ДобавитьПлан_План()
	
	// Эталонные данные - "Факт", текущие данные - "Факт"
	Процедура ДобавитьФакт_Факт(ТекстЗапроса, СравниваемыеДанные, ЭталонныеДанные)
		
		НомерСтроки = СравниваемыеДанные.НомерСтроки;
		
		Если НомерСтроки > 1 Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ " + ?(ПустаяСтрока(ТекстЗапроса), "РАЗРЕШЕННЫЕ", "") + "
		|	&ТипДанных" + Формат(НомерСтроки, "ЧГ=0") + " КАК ТипДанных,
		|	РезультатАнализа.Организация КАК Организация,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Организация) КАК ОрганизацияПредставление,
		|	РезультатАнализа.Сценарий КАК Сценарий,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Сценарий) КАК СценарийПредставление,
		|	РезультатАнализа.Подразделение КАК Подразделение,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Подразделение) КАК ПодразделениеПредставление,
		|	РезультатАнализа.ТС КАК ТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТС) КАК ТСПредставление,
		|	РезультатАнализа.МодельТС КАК МодельТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.МодельТС) КАК МодельТСПредставление,
		|	РезультатАнализа.ТипТС КАК ТипТС,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ТипТС) КАК ТипТСПредставление,
		|	РезультатАнализа.ДокументПланирования КАК ДокументПланирования,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ДокументПланирования) КАК ДокументПланированияПредставление,
		|	РезультатАнализа.Номенклатура КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Номенклатура) КАК НоменклатураПредставление,
		|	РезультатАнализа.ПараметрВыработки КАК ПараметрВыработки,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ПараметрВыработки) КАК ПараметрВыработкиПредставление,
		|	РезультатАнализа.Заказ КАК Заказ,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Заказ) КАК ЗаказПредставление,
		|	РезультатАнализа.Контрагент КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Контрагент) КАК КонтрагентПредставление,
		|	РезультатАнализа.Договор КАК Договор,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Договор) КАК ДоговорПредставление,
		|	РезультатАнализа.Маршрут КАК Маршрут,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Маршрут) КАК МаршрутПредставление,
		|	РезультатАнализа.ВидБилета КАК ВидБилета,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.ВидБилета) КАК ВидБилетаПредставление,
		|	РезультатАнализа.Регистратор КАК Регистратор,
		|	ПРЕДСТАВЛЕНИЕ(РезультатАнализа.Регистратор) КАК РегистраторПредставление,
		|	РезультатАнализа.Период КАК Период,
		|	РезультатАнализа.ПериодДень КАК ПериодДень,
		|	РезультатАнализа.ПериодНеделя КАК ПериодНеделя,
		|	РезультатАнализа.ПериодДекада КАК ПериодДекада,
		|	РезультатАнализа.ПериодМесяц КАК ПериодМесяц,
		|	РезультатАнализа.ПериодКвартал КАК ПериодКвартал,
		|	РезультатАнализа.ПериодПолугодие КАК ПериодПолугодие,
		|	РезультатАнализа.ПериодГод КАК ПериодГод,
		|	РезультатАнализа.Количество КАК Количество,
		|	РезультатАнализа.КоличествоБазовыхЕдиниц КАК КоличествоБазовыхЕдиниц,
		|	РезультатАнализа.КоличествоЕдиницОтчетов КАК КоличествоЕдиницОтчетов,
		|	РезультатАнализа.КоличествоОтклонение КАК КоличествоОтклонение,
		|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение КАК КоличествоБазовыхЕдиницОтклонение,
		|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение КАК КоличествоЕдиницОтчетовОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.КоличествоОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.Количество = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК КоличествоОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьБезНДС КАК СтоимостьБезНДС,
		|	РезультатАнализа.НДС КАК НДС,
		|	РезультатАнализа.СтоимостьСНДС КАК СтоимостьСНДС,
		|	РезультатАнализа.СтоимостьБезНДСОтклонение КАК СтоимостьБезНДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.СтоимостьБезНДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтоимостьБезНДСОтклонениеПроцент,
		|	РезультатАнализа.НДСОтклонение КАК НДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.НДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.НДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК НДСОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьСНДСОтклонение КАК СтоимостьСНДСОтклонение,
		|	ВЫБОР
		|		КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РезультатАнализа.СтоимостьСНДС = 0
		|					ТОГДА -100
		|				ИНАЧЕ ВЫБОР
		|						КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|							ТОГДА ""-""
		|						ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтоимостьСНДСОтклонениеПроцент
		|{ВЫБРАТЬ
		|	Организация.*,
		|	Сценарий.*,
		|	Подразделение.*,
		|	ТС.*,
		|	МодельТС.*,
		|	ТипТС.*,
		|	ДокументПланирования.*,
		|	Номенклатура.*,
		|	ПараметрВыработки.*,
		|	Заказ.*,
		|	Контрагент.*,
		|	Договор.*,
		|	Маршрут.*,
		|	ВидБилета.*,
		|	Регистратор.*,
		|	Период,
		|	ПериодДень,
		|	ПериодНеделя,
		|	ПериодДекада,
		|	ПериодМесяц,
		|	ПериодКвартал,
		|	ПериодПолугодие,
		|	ПериодГод,
		|	Количество,
		|	КоличествоБазовыхЕдиниц,
		|	КоличествоЕдиницОтчетов,
		|	КоличествоОтклонение,
		|	КоличествоБазовыхЕдиницОтклонение,
		|	КоличествоЕдиницОтчетовОтклонение,
		|	КоличествоОтклонениеПроцент,
		|	СтоимостьБезНДС,
		|	НДС,
		|	СтоимостьСНДС,
		|	СтоимостьБезНДСОтклонение,
		|	СтоимостьБезНДСОтклонениеПроцент,
		|	НДСОтклонение,
		|	НДСОтклонениеПроцент,
		|	СтоимостьСНДСОтклонение,
		|	СтоимостьСНДСОтклонениеПроцент}
		|ИЗ
		|	(ВЫБРАТЬ
		|		АнализируемыеДанные.Период КАК Период,
		|		АнализируемыеДанные.ПериодДень КАК ПериодДень,
		|		АнализируемыеДанные.ПериодНеделя КАК ПериодНеделя,
		|		АнализируемыеДанные.ПериодДекада КАК ПериодДекада,
		|		АнализируемыеДанные.ПериодМесяц КАК ПериодМесяц,
		|		АнализируемыеДанные.ПериодКвартал КАК ПериодКвартал,
		|		АнализируемыеДанные.ПериодПолугодие КАК ПериодПолугодие,
		|		АнализируемыеДанные.ПериодГод КАК ПериодГод,
		|		АнализируемыеДанные.Регистратор КАК Регистратор,
		|		АнализируемыеДанные.Организация КАК Организация,
		|		АнализируемыеДанные.Сценарий КАК Сценарий,
		|		АнализируемыеДанные.Подразделение КАК Подразделение,
		|		АнализируемыеДанные.ТС КАК ТС,
		|		АнализируемыеДанные.МодельТС КАК МодельТС,
		|		АнализируемыеДанные.ТипТС КАК ТипТС,
		|		АнализируемыеДанные.ДокументПланирования КАК ДокументПланирования,
		|		АнализируемыеДанные.Номенклатура КАК Номенклатура,
		|		АнализируемыеДанные.ПараметрВыработки КАК ПараметрВыработки,
		|		АнализируемыеДанные.Заказ КАК Заказ,
		|		АнализируемыеДанные.Контрагент КАК Контрагент,
		|		АнализируемыеДанные.Договор КАК Договор,
		|		АнализируемыеДанные.Маршрут КАК Маршрут,
		|		АнализируемыеДанные.ВидБилета КАК ВидБилета,
		|		СУММА(АнализируемыеДанные.ФактКоличествоТекущие) КАК Количество,
		|		СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиницТекущие) КАК КоличествоБазовыхЕдиниц,
		|		СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетовТекущие) КАК КоличествоЕдиницОтчетов,
		|		СУММА(АнализируемыеДанные.ФактКоличествоТекущие) - СУММА(АнализируемыеДанные.ФактКоличествоЭталонные) КАК КоличествоОтклонение,
		|		СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиницТекущие) - СУММА(АнализируемыеДанные.ФактКоличествоБазовыхЕдиницЭталонные) КАК КоличествоБазовыхЕдиницОтклонение,
		|		СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетовТекущие) - СУММА(АнализируемыеДанные.ФактКоличествоЕдиницОтчетовЭталонные) КАК КоличествоЕдиницОтчетовОтклонение,
		|		СУММА(АнализируемыеДанные.ФактСтоимостьБезНДСТекущие) КАК СтоимостьБезНДС,
		|		СУММА(АнализируемыеДанные.ФактНДСТекущие) КАК НДС,
		|		СУММА(АнализируемыеДанные.ФактСтоимостьСНДСТекущие) КАК СтоимостьСНДС,
		|		СУММА(АнализируемыеДанные.ФактСтоимостьБезНДСТекущие) - СУММА(АнализируемыеДанные.ФактСтоимостьБезНДСЭталонные) КАК СтоимостьБезНДСОтклонение,
		|		СУММА(АнализируемыеДанные.ФактНДСТекущие) - СУММА(АнализируемыеДанные.ФактНДСЭталонные) КАК НДСОтклонение,
		|		СУММА(АнализируемыеДанные.ФактСтоимостьСНДСТекущие) - СУММА(АнализируемыеДанные.ФактСтоимостьСНДСЭталонные) КАК СтоимостьСНДСОтклонение
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВыработкаОборотыТекущие.Период КАК Период,
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, ДЕНЬ) КАК ПериодДень,
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, НЕДЕЛЯ) КАК ПериодНеделя,
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, ДЕКАДА) КАК ПериодДекада,
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, МЕСЯЦ) КАК ПериодМесяц,
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, КВАРТАЛ) КАК ПериодКвартал,
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыТекущие.Период, ГОД) КАК ПериодГод,
		|			ВыработкаОборотыТекущие.Регистратор КАК Регистратор,
		|			ВыработкаОборотыТекущие.Организация КАК Организация,
		|			NULL КАК Сценарий,
		|			ВыработкаОборотыТекущие.Подразделение КАК Подразделение,
		|			ВыработкаОборотыТекущие.ТС КАК ТС,
		|			ВыработкаОборотыТекущие.ТС.Модель КАК МодельТС,
		|			ВыработкаОборотыТекущие.ТС.ТипТС КАК ТипТС,
		|			NULL КАК ДокументПланирования,
		|			NULL КАК Номенклатура,
		|			ВыработкаОборотыТекущие.ПараметрВыработки КАК ПараметрВыработки,
		|			NULL КАК Заказ,
		|			ВыработкаОборотыТекущие.Контрагент КАК Контрагент,
		|			NULL КАК Договор,
		|			ВыработкаОборотыТекущие.Маршрут КАК Маршрут,
		|			NULL КАК ВидБилета,
		|			ВЫБОР
		|				КОГДА ВыработкаОборотыТекущие.ПараметрВыработки.Временный
		|					ТОГДА -РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, ВыработкаОборотыТекущие.КоличествоОборот), ЧАС) * 3600 / 6000 + ВыработкаОборотыТекущие.КоличествоОборот / 6000 + РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, ВыработкаОборотыТекущие.КоличествоОборот), ЧАС)
		|				ИНАЧЕ ВыработкаОборотыТекущие.КоличествоОборот
		|			КОНЕЦ КАК ФактКоличествоТекущие,
		|			NULL КАК ФактКоличествоБазовыхЕдиницТекущие,
		|			NULL КАК ФактКоличествоЕдиницОтчетовТекущие,
		|			0 КАК ФактКоличествоЭталонные,
		|			0 КАК ФактКоличествоБазовыхЕдиницЭталонные,
		|			0 КАК ФактКоличествоЕдиницОтчетовЭталонные,
		|			NULL КАК ФактСтоимостьБезНДСТекущие,
		|			NULL КАК ФактНДСТекущие,
		|			NULL КАК ФактСтоимостьСНДСТекущие,
		|			0 КАК ФактСтоимостьБезНДСЭталонные,
		|			0 КАК ФактНДСЭталонные,
		|			0 КАК ФактСтоимостьСНДСЭталонные
		|		ИЗ
		|			РегистрНакопления.уатВыработкаТС.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ) КАК ВыработкаОборотыТекущие
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВыручкаОборотыТекущие.Период,
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, ДЕНЬ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, НЕДЕЛЯ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, ДЕКАДА),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, МЕСЯЦ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, КВАРТАЛ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, ПОЛУГОДИЕ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыТекущие.Период, ГОД),
		|			ВыручкаОборотыТекущие.Регистратор,
		|			ВыручкаОборотыТекущие.Организация,
		|			NULL,
		|			NULL,
		|			ВыручкаОборотыТекущие.ТС,
		|			ВыручкаОборотыТекущие.ТС.Модель,
		|			ВыручкаОборотыТекущие.ТС.ТипТС,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			ВыручкаОборотыТекущие.Маршрут,
		|			ВыручкаОборотыТекущие.Билет.ВидБилета,
		|			ВыручкаОборотыТекущие.КоличествоОборот КАК ФактКоличествоТекущие,
		|			NULL КАК ФактКоличествоБазовыхЕдиницТекущие,
		|			NULL КАК ФактКоличествоЕдиницОтчетовТекущие,
		|			0 КАК ФактКоличествоЭталонные,
		|			0 КАК ФактКоличествоБазовыхЕдиницЭталонные,
		|			0 КАК ФактКоличествоЕдиницОтчетовЭталонные,
		|			ВыручкаОборотыТекущие.СуммаОборот КАК ФактСтоимостьБезНДСТекущие,
		|			NULL КАК ФактНДСТекущие,
		|			NULL КАК ФактСтоимостьСНДСТекущие,
		|			0 КАК ФактСтоимостьБезНДСЭталонные,
		|			0 КАК ФактНДСЭталонные,
		|			0 КАК ФактСтоимостьСНДСЭталонные
		|		ИЗ
		|			РегистрНакопления.уатВыручка.Обороты(&ДатаНач" + Формат(НомерСтроки, "ЧГ=0") + ", &ДатаКон" + Формат(НомерСтроки, "ЧГ=0") + ", Регистратор, ) КАК ВыручкаОборотыТекущие
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВыработкаОборотыЭталонные.Период,
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, ДЕНЬ),
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, НЕДЕЛЯ),
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, ДЕКАДА),
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, МЕСЯЦ),
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, КВАРТАЛ),
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, ПОЛУГОДИЕ),
		|			НАЧАЛОПЕРИОДА(ВыработкаОборотыЭталонные.Период, ГОД),
		|			ВыработкаОборотыЭталонные.Регистратор,
		|			ВыработкаОборотыЭталонные.Организация,
		|			NULL,
		|			ВыработкаОборотыЭталонные.Подразделение,
		|			ВыработкаОборотыЭталонные.ТС,
		|			ВыработкаОборотыЭталонные.ТС.Модель,
		|			ВыработкаОборотыЭталонные.ТС.ТипТС,
		|			NULL,
		|			NULL,
		|			ВыработкаОборотыЭталонные.ПараметрВыработки,
		|			NULL,
		|			ВыработкаОборотыЭталонные.Контрагент,
		|			NULL,
		|			ВыработкаОборотыЭталонные.Маршрут,
		|			NULL,
		|			0 КАК ФактКоличествоТекущие,
		|			0 КАК ФактКоличествоБазовыхЕдиницТекущие,
		|			0 КАК ФактКоличествоЕдиницОтчетовТекущие,
		|			ВЫБОР
		|				КОГДА ВыработкаОборотыЭталонные.ПараметрВыработки.Временный
		|					ТОГДА -РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, ВыработкаОборотыЭталонные.КоличествоОборот), ЧАС) * 3600 / 6000 + ВыработкаОборотыЭталонные.КоличествоОборот / 6000 + РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), СЕКУНДА, ВыработкаОборотыЭталонные.КоличествоОборот), ЧАС)
		|				ИНАЧЕ ВыработкаОборотыЭталонные.КоличествоОборот
		|			КОНЕЦ КАК ФактКоличествоЭталонные,
		|			NULL КАК ФактКоличествоБазовыхЕдиницЭталонные,
		|			NULL КАК ФактКоличествоЕдиницОтчетовЭталонные,
		|			0 КАК ФактСтоимостьБезНДСТекущие,
		|			0 КАК ФактНДСТекущие,
		|			0 КАК ФактСтоимостьСНДСТекущие,
		|			NULL КАК ФактСтоимостьБезНДСЭталонные,
		|			NULL КАК ФактНДСЭталонные,
		|			NULL КАК ФактСтоимостьСНДСЭталонные
		|		ИЗ
		|			РегистрНакопления.уатВыработкаТС.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, ) КАК ВыработкаОборотыЭталонные
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВыручкаОборотыЭталонные.Период,
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, ДЕНЬ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, НЕДЕЛЯ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, ДЕКАДА),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, МЕСЯЦ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, КВАРТАЛ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, ПОЛУГОДИЕ),
		|			НАЧАЛОПЕРИОДА(ВыручкаОборотыЭталонные.Период, ГОД),
		|			ВыручкаОборотыЭталонные.Регистратор,
		|			ВыручкаОборотыЭталонные.Организация,
		|			NULL,
		|			NULL,
		|			ВыручкаОборотыЭталонные.ТС,
		|			ВыручкаОборотыЭталонные.ТС.Модель,
		|			ВыручкаОборотыЭталонные.ТС.ТипТС,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			NULL,
		|			ВыручкаОборотыЭталонные.Маршрут,
		|			ВыручкаОборотыЭталонные.Билет.ВидБилета,
		|			0 КАК ФактКоличествоТекущие,
		|			0 КАК ФактКоличествоБазовыхЕдиницТекущие,
		|			0 КАК ФактКоличествоЕдиницОтчетовТекущие,
		|			ВыручкаОборотыЭталонные.КоличествоОборот КАК ФактКоличествоЭталонные,
		|			NULL КАК ФактКоличествоБазовыхЕдиницЭталонные,
		|			NULL КАК ФактКоличествоЕдиницОтчетовЭталонные,
		|			0 КАК ФактСтоимостьБезНДСТекущие,
		|			0 КАК ФактНДСТекущие,
		|			0 КАК ФактСтоимостьСНДСТекущие,
		|			ВыручкаОборотыЭталонные.СуммаОборот КАК ФактСтоимостьБезНДСЭталонные,
		|			NULL КАК ФактНДСЭталонные,
		|			NULL КАК ФактСтоимостьСНДСЭталонные
		|		ИЗ
		|			РегистрНакопления.уатВыручка.Обороты(&ДатаНач1, &ДатаКон1, Регистратор, ) КАК ВыручкаОборотыЭталонные) КАК АнализируемыеДанные
		|	
		|	СГРУППИРОВАТЬ ПО
		|		АнализируемыеДанные.Организация,
		|		АнализируемыеДанные.Сценарий,
		|		АнализируемыеДанные.Подразделение,
		|		АнализируемыеДанные.ТС,
		|		АнализируемыеДанные.МодельТС,
		|		АнализируемыеДанные.ТипТС,
		|		АнализируемыеДанные.ДокументПланирования,
		|		АнализируемыеДанные.Номенклатура,
		|		АнализируемыеДанные.ПараметрВыработки,
		|		АнализируемыеДанные.Заказ,
		|		АнализируемыеДанные.Контрагент,
		|		АнализируемыеДанные.Договор,
		|		АнализируемыеДанные.Маршрут,
		|		АнализируемыеДанные.ВидБилета,
		|		АнализируемыеДанные.Регистратор,
		|		АнализируемыеДанные.Период,
		|		АнализируемыеДанные.ПериодДень,
		|		АнализируемыеДанные.ПериодНеделя,
		|		АнализируемыеДанные.ПериодДекада,
		|		АнализируемыеДанные.ПериодМесяц,
		|		АнализируемыеДанные.ПериодКвартал,
		|		АнализируемыеДанные.ПериодПолугодие,
		|		АнализируемыеДанные.ПериодГод) КАК РезультатАнализа
		|{ГДЕ
		|	РезультатАнализа.Организация.*,
		|	РезультатАнализа.Сценарий.*,
		|	РезультатАнализа.Подразделение.*,
		|	РезультатАнализа.ТС.*,
		|	РезультатАнализа.МодельТС.*,
		|	РезультатАнализа.ТипТС.*,
		|	РезультатАнализа.ДокументПланирования.*,
		|	РезультатАнализа.Номенклатура.*,
		|	РезультатАнализа.ПараметрВыработки.*,
		|	РезультатАнализа.Заказ.*,
		|	РезультатАнализа.Контрагент.*,
		|	РезультатАнализа.Договор.*,
		|	РезультатАнализа.Маршрут.*,
		|	РезультатАнализа.ВидБилета.*,
		|	РезультатАнализа.Регистратор.*,
		|	РезультатАнализа.Период,
		|	РезультатАнализа.ПериодДень,
		|	РезультатАнализа.ПериодНеделя,
		|	РезультатАнализа.ПериодДекада,
		|	РезультатАнализа.ПериодМесяц,
		|	РезультатАнализа.ПериодКвартал,
		|	РезультатАнализа.ПериодПолугодие,
		|	РезультатАнализа.ПериодГод,
		|	РезультатАнализа.Количество,
		|	РезультатАнализа.КоличествоБазовыхЕдиниц,
		|	РезультатАнализа.КоличествоЕдиницОтчетов,
		|	РезультатАнализа.КоличествоОтклонение,
		|	РезультатАнализа.КоличествоБазовыхЕдиницОтклонение,
		|	РезультатАнализа.КоличествоЕдиницОтчетовОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.КоличествоОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.Количество = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.КоличествоОтклонение * 100 / РезультатАнализа.Количество - РезультатАнализа.КоличествоОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьБезНДС,
		|	РезультатАнализа.НДС,
		|	РезультатАнализа.СтоимостьСНДС,
		|	РезультатАнализа.СтоимостьБезНДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.СтоимостьБезНДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.СтоимостьБезНДСОтклонение * 100 / РезультатАнализа.СтоимостьБезНДС - РезультатАнализа.СтоимостьБезНДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК СтоимостьБезНДСОтклонениеПроцент,
		|	РезультатАнализа.НДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.НДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.НДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.НДСОтклонение * 100 / РезультатАнализа.НДС - РезультатАнализа.НДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК НДСОтклонениеПроцент,
		|	РезультатАнализа.СтоимостьСНДСОтклонение,
		|	(ВЫБОР
		|			КОГДА РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА РезультатАнализа.СтоимостьСНДС = 0
		|						ТОГДА -100
		|					ИНАЧЕ ВЫБОР
		|							КОГДА РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение = 0
		|								ТОГДА ""-""
		|							ИНАЧЕ РезультатАнализа.СтоимостьСНДСОтклонение * 100 / РезультатАнализа.СтоимостьСНДС - РезультатАнализа.СтоимостьСНДСОтклонение
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ) КАК СтоимостьСНДСОтклонениеПроцент,
		|	(ВЫБОР
		|		КОГДА РезультатАнализа.ТС.ДатаВыбытия <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ИСТИНА
		|			КОГДА РезультатАнализа.ТС.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ЛОЖЬ
		|		КОНЕЦ) КАК ТСВыбыло}";		
		
	КонецПроцедуры // ДобавитьФакт_Факт()
	
	Функция ПолучитьПредставлениеДанных(Данные)
		
		Результат = Формат(Данные.НомерСтроки, "ЧГ=0") + ". ";
		
		Если Данные.НомерСтроки = 1 Тогда
			
			Результат = Результат + "Эталонный период.";
			
		Иначе
			
			Результат = Результат + "Сравниваемый период.";
			
		КонецЕсли;
		
		Результат = Результат + Символы.ПС + Данные.ТипДанных + ". " + Символы.ПС;
		
		Если НЕ Данные.Сценарий.Пустая() Тогда
			
			Результат = Результат + Строка(Данные.Сценарий) + Символы.ПС;
			
		КонецЕсли;
		
		Если Данные.ДатаНач = Дата('00010101') И Данные.ДатаКон = Дата('00010101') Тогда
			
			Если УниверсальныйОтчет.ДатаНач = Дата('00010101') И УниверсальныйОтчет.ДатаКон = Дата('00010101') Тогда
				
				Результат = Результат + "Без ограничения периода.";
				
			Иначе
				
				Результат = Результат + "С " + Формат(УниверсальныйОтчет.ДатаНач, "ДЛФ=Д; ДП = ""...""") + " по " + Формат(УниверсальныйОтчет.ДатаКон, "ДЛФ=Д; ДП = ""...""");
				
			КонецЕсли;
			
		Иначе
			
			Результат = Результат + "С " + Формат(Данные.ДатаНач, "ДЛФ=Д; ДП = ""...""") + " по " + Формат(Данные.ДатаКон, "ДЛФ=Д; ДП = ""...""");
			
		КонецЕсли;
		
		Возврат Результат;
		
	КонецФункции // ПолучитьПредставлениеДанных()
	
	////////////////////////////////////////////////////////////////////////////////
	// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
	// Процедура формирования отчета
	//
	Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
		
		Перем ТекущиеНастройкиОтчета;
		
		СформироватьСтруктуруДляСохраненияНастроек(ТекущиеНастройкиОтчета);
		УстановитьНачальныеНастройки();
		ВосстановитьНастройкиИзСтруктуры(ТекущиеНастройкиОтчета);
		
		УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СправочникТСПустаяСсылка", Справочники.уатТС.ПустаяСсылка());
		УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СправочникМодельТСПустаяСсылка", Справочники.уатМоделиТС.ПустаяСсылка());
		
		Для каждого Данные из ДанныеОтчета Цикл
			
			УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ТипДанных" + Формат(Данные.НомерСтроки, "ЧГ=0"), ПолучитьПредставлениеДанных(Данные));
			УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Сценарий" + Формат(Данные.НомерСтроки, "ЧГ=0"), ?(Данные.Сценарий.Пустая(), Неопределено, Данные.Сценарий));
			
			Если Данные.ДатаНач = Дата('00010101') И Данные.ДатаКон = Дата('00010101') Тогда
				
				УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаНач" + Формат(Данные.НомерСтроки, "ЧГ=0"), ?(УниверсальныйОтчет.ДатаНач = Дата('00010101'), УниверсальныйОтчет.ДатаНач, Новый Граница(НачалоДня(УниверсальныйОтчет.ДатаНач), ВидГраницы.Включая)));
				УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаКон" + Формат(Данные.НомерСтроки, "ЧГ=0"), ?(УниверсальныйОтчет.ДатаКон = Дата('00010101'), УниверсальныйОтчет.ДатаКон, Новый Граница(КонецДня(УниверсальныйОтчет.ДатаКон), ВидГраницы.Включая)));
				
			Иначе
				
				УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаНач" + Формат(Данные.НомерСтроки, "ЧГ=0"), ?(Данные.ДатаНач = Дата('00010101'), Данные.ДатаНач, Новый Граница(НачалоДня(Данные.ДатаНач), ВидГраницы.Включая)));
				УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаКон" + Формат(Данные.НомерСтроки, "ЧГ=0"), ?(Данные.ДатаКон = Дата('00010101'), Данные.ДатаКон, Новый Граница(КонецДня(Данные.ДатаКон), ВидГраницы.Включая)));
				
			КонецЕсли;
			
		КонецЦикла;
		
		УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент,,, ЭтотОбъект);
		
		ОбластьЭталонныйПериод = Неопределено;
		
		Пока Истина Цикл
			
			ОбластьЭталонныйПериод = ТабличныйДокумент.НайтиТекст(ПолучитьПредставлениеДанных(ДанныеОтчета[0]), ОбластьЭталонныйПериод);
			
			Если ОбластьЭталонныйПериод = Неопределено Тогда
				
				Прервать;
				
			Иначе
				
				Для каждого Показатель из УниверсальныйОтчет.Показатели.Строки Цикл
					
					Если (Показатель.Имя = "ОтклонениеКоличества" ИЛИ Показатель.Имя = "ОтклонениеСтоимости") И Показатель.Использование Тогда
						
						Результат = ТабличныйДокумент.НайтиТекст(Показатель.ПредставлениеВОтчете,, ТабличныйДокумент.Область(ОбластьЭталонныйПериод.Верх, ОбластьЭталонныйПериод.Лево, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
						
						Если Результат <> Неопределено Тогда
							
							Индекс = 0;
							
							Для каждого ТекущийПоказатель из Показатель.Строки Цикл
								
								Если ТекущийПоказатель.Использование Тогда
									
									ТабличныйДокумент.Область(, Результат.Лево + Индекс,, Результат.Лево + Индекс).Видимость = Ложь;
									Индекс = Индекс + 1;
									
								КонецЕсли;
								
							КонецЦикла;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецПроцедуры // СформироватьОтчет()
	
	Функция ПолучитьТекстСправкиФормы() Экспорт
		
		Возврат "";
		
	КонецФункции
	
	
	////////////////////////////////////////////////////////////////////////////////
	// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
	
	// Процедура обработки расшифровки
	//
	Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
		
		// Дополнительные параметры в расшифровывающий отчет можно передать
		// посредством инициализации переменной "ДополнительныеПараметры".
		
		ДополнительныеПараметры = уатОбщегоНазначения.уатСохранитьРеквизитыОтчета(ЭтотОбъект);
		УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
		
	КонецПроцедуры // ОбработкаРасшифровки()
	
	// Формирует структуру для сохранения настроек отчета
	//
	Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
		
		УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
		уатОбщегоНазначения.уатСохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
		
	КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()
	
	// Заполняет настройки отчета из структуры сохраненных настроек
	//
	Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
		
		уатОбщегоНазначения.уатВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
		Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
		
	КонецФункции // ВосстановитьНастройкиИзСтруктуры()
	
	// Содержит значение используемого режима ввода периода.
	// Тип: Число.
	// Возможные значения: // (-1) - не выбирать период, 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
	// Значение по умолчанию: 0
	// Пример:
	// УниверсальныйОтчет.мРежимВводаПериода = 1;
	
#КонецЕсли
