
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
    мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ
	|	уатПланированиеРаботыТССоставПлана.Ссылка КАК Регистратор,
	|	Календарь.ДатаКалендаря КАК Период,
	|	уатПланированиеРаботыТССоставПлана.Ссылка.Сценарий,
	|	уатПланированиеРаботыТССоставПлана.Ссылка.Подразделение,
	|	уатПланированиеРаботыТССоставПлана.ДетализацияПланирования,
	|	уатПланированиеРаботыТССоставПлана.Ссылка КАК ДокументПланирования,
	|	уатПланированиеРаботыТССоставПлана.Номенклатура,
	|	уатПланированиеРаботыТССоставПлана.ПараметрВыработки,
	|	уатПланированиеРаботыТССоставПлана.Заказ,
	|	уатПланированиеРаботыТССоставПлана.Контрагент,
	|	уатПланированиеРаботыТССоставПлана.Договор,
	|	уатПланированиеРаботыТССоставПлана.Маршрут,
	|	Выразить(уатПланированиеРаботыТССоставПлана.Количество  * CASE WHEN Календарь.Пятидневка=1 THEN &КоэфРаб / итТбл.Раб ELSE &КоэфВых / итТбл.Вых END как Число(15,3)) Количество,
	|	Выразить(уатПланированиеРаботыТССоставПлана.Сумма       * CASE WHEN Календарь.Пятидневка=1 THEN &КоэфРаб / итТбл.Раб ELSE &КоэфВых / итТбл.Вых END как Число(15,2))  КАК Стоимость,
	|	уатПланированиеРаботыТССоставПлана.СуммаНДС КАК НДС,
	|   уатПланированиеРаботыТССоставПлана.Количество итКол,
	|   уатПланированиеРаботыТССоставПлана.Сумма      итСум,
	|	уатПланированиеРаботыТССоставПлана.Приоритет,
	|	уатПланированиеРаботыТССоставПлана.ВидБилета
	|ИЗ
	|	Документ.уатПланированиеРаботыТС.СоставПлана КАК уатПланированиеРаботыТССоставПлана
	|
	|INNER JOIN (
	|			ВЫБРАТЬ
	|				SUM(уатРегламентированныйПроизводственныйКалендарь.КалендарныеДни) Дни,
	|				SUM(уатРегламентированныйПроизводственныйКалендарь.Пятидневка) Раб,
	|				SUM(уатРегламентированныйПроизводственныйКалендарь.КалендарныеДни) - SUM(уатРегламентированныйПроизводственныйКалендарь.Пятидневка) Вых
	|			ИЗ
	|				РегистрСведений.уатРегламентированныйПроизводственныйКалендарь КАК уатРегламентированныйПроизводственныйКалендарь
	|			WHERE ДатаКалендаря >= &Дт и ДатаКалендаря < &Дт1
	|           ) итТбл On истина
	|
	|INNER JOIN  РегистрСведений.уатРегламентированныйПроизводственныйКалендарь КАК Календарь ON  ДатаКалендаря >= &Дт и ДатаКалендаря < &Дт1 
	|
	|
	|
	|
	|ГДЕ
	|	уатПланированиеРаботыТССоставПлана.Ссылка = &Ссылка";
	
	

	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	мЗапрос.УстановитьПараметр("Дт",НачалоМесяца(ДокументСсылка.Дата));
	мЗапрос.УстановитьПараметр("Дт1",КонецМесяца(ДокументСсылка.Дата)+1);
	мЗапрос.УстановитьПараметр("КоэфВых",0.17);
	мЗапрос.УстановитьПараметр("коэфРаб",0.83);
	
	мТаб = мЗапрос.Выполнить().Выгрузить();
    //ВалютаРеглУчета
	
	итТ = мТаб.Скопировать(,"Контрагент,ДетализацияПланирования,итКол,итСум,Количество,Стоимость");
	итТ.свернуть("итКол,итСум,Контрагент,ДетализацияПланирования","Количество,Стоимость");
	Для каждого итСтр из итТ Цикл
		Если итСтр.итКол <> итСтр.Количество или итСтр.итСум <> итСтр.Стоимость  Тогда
			Мас = мТаб.НайтиСтроки(Новый Структура("Контрагент,ДетализацияПланирования",итСтр.Контрагент,итСтр.ДетализацияПланирования));
			Мас[0].Количество = Мас[0].количество + итСтр.итКол - итСтр.Количество;
			Мас[0].Стоимость = Мас[0].стоимость + итСтр.итСум - итСтр.Стоимость;
		КонецЕсЛИ;
	КонецЦиклА;
	
	
	Для Каждого ТекСтрока ИЗ мТаб Цикл
		
		ТекСтрока.Стоимость = ТекСтрока.Стоимость - ?(ДокументСсылка.УчитыватьНДС И ДокументСсылка.СуммаВключаетНДС, ТекСтрока.НДС,0);
		
		ТекСтрока.Стоимость = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Стоимость, ДокументСсылка.ВалютаДокумента,
		                            СтруктураДополнительныеСвойства.ВалютаРеглУчета, 
		                            ДокументСсылка.КурсДокумента,
		                            СтруктураДополнительныеСвойства.КурсРегл, 
		                            ДокументСсылка.КратностьДокумента,
		                            СтруктураДополнительныеСвойства.КратностьРегл);
		
		ТекСтрока.НДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.НДС, ДокументСсылка.ВалютаДокумента,
		                            СтруктураДополнительныеСвойства.ВалютаРеглУчета, 
		                            ДокументСсылка.КурсДокумента,
		                            СтруктураДополнительныеСвойства.КурсРегл, 
		                            ДокументСсылка.КратностьДокумента,
		                            СтруктураДополнительныеСвойства.КратностьРегл);

		Если НЕ ЗначениеЗаполнено(ТекСтрока.ДокументПланирования) Тогда
			ТекСтрока.ДокументПланирования = ДокументСсылка;
		КонецЕсли;
		
		Если ТекСтрока.ПараметрВыработки.Временный Тогда
			ТекСтрока.Количество = Цел(ТекСтрока.Количество) * 3600 + (ТекСтрока.Количество - Цел(ТекСтрока.Количество))*100*60;
		КонецЕсли;

	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПланаРаботыТС", мТаб);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
	
КонецПроцедуры
