// Возвращает модуль аргумента
//
Функция Abs(Аргумент) Экспорт
	
	Возврат ?(Аргумент>=0, Аргумент, -Аргумент);

КонецФункции // Abs()

// Преобразование цвет в значение хранения
//
Функция ПолучитьЗначениеХраненияЦвета(Красный, Зеленый, Синий) Экспорт
	
    Возврат Синий*256*256 + Зеленый*256 + Красный;
	
КонецФункции // ПолучитьКодЦвета()

// Преобразование значения хранения в цвет
//
Функция ПолучитьЦветПоЗначениюХранения(КодЦвета) Экспорт
	
	Синий = Цел(КодЦвета/(256*256));
    Зеленый = Цел((КодЦвета - Синий*256*256)/256);
    Красный = КодЦвета - Синий*256*256 - Зеленый*256;
	
	Возврат Новый Цвет(Красный,Зеленый,Синий);
	
КонецФункции // ПолучитьЦвет()

// Выполняет форматирование географических координат
//
Функция ФорматироватьКоординаты(к) Экспорт
	
	Возврат Формат(к, "ЧЦ=10; ЧДЦ=6; ЧРД=.; ЧН=0");	

КонецФункции // ФорматироватьКоординаты()
