///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ИНТЕРАКТИВНОГО ОБНОВЛЕНИЯ ИНФОРМАЦИОННОЙ БАЗЫ 

// Проверить, есть ли необходимость выполнять обновление информационной базы, и
// если необходимо - выполняется обновление.
// Если обновление не удалось выполнить, то процедура предлагает завершить работу системы.
//
Процедура ВыполнитьОбновлениеИнформационнойБазы() Экспорт

	Если НЕ ItobОбновлениеИнформационнойБазы.НеобходимоОбновлениеИнформационнойБазы() Тогда
		Возврат;
	КонецЕсли;
	
	// sidm Rarus --->
	////Состояние(НСтр("ru = 'Пожалуйста, подождите, выполняется обновление информационной базы...'"));
	// sidm Rarus ---<

	ДокументОписаниеОбновлений = Неопределено;
	Попытка
		ВыполненныеОбработчикиОбновления = ItobОбновлениеИнформационнойБазы.ВыполнитьОбновлениеИнформационнойБазы();
	Исключение

		ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
			"ru = 'При обновлении информационной базы возникла ошибка:
			|
			|%1
			|
			|Подробности см. в Журнале регистрации.'"), 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение ТекстСообщенияОбОшибке;
	КонецПопытки;
	
	// sidm Rarus --->
	//
	// т.к. в  решение УАТ Проф ЦСМ является одной из подсистем, то инфомация по изменениям в версии выводится в общем 
	// описании макета УАТ
	//
    ////Состояние(НСтр("ru = 'Обновление информационной базы выполнено успешно.'"));
	////Если ВыполненныеОбработчикиОбновления <> Неопределено Тогда	
	////	ОткрытьФорму("ОбщаяФорма.ItobОписаниеИзмененийСистемы", 
	////		Новый Структура("ВыполненныеОбработчикиОбновления", ВыполненныеОбработчикиОбновления));
	////КонецЕсли;
	
	// sidm Rarus ---<
	
КонецПроцедуры

// Проверить, возможно ли выполнять обновление информационной базы.
//
Функция ВозможноВыполнитьОбновлениеИнформационнойБазы() Экспорт
	
	Результат = ItobОбновлениеИнформационнойБазы.ПроверитьНевозможностьОбновленияИнформационнойБазы();
	
	Если Результат Тогда
		Сообщение = НСтр("ru = 'Информационная база заблокирована в связи с обновлением версии конфигурации. Работа системы будет завершена.
		                       |Обратитесь к системному администратору за подробностями.'");
		Предупреждение(Сообщение);
	КонецЕсли;
	
	Возврат НЕ Результат;
	
КонецФункции

