
&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоиск(Команда)
	ЭтаФорма.Закрыть(ПолучитьСтруктуруЗначений());
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруЗначений()
	Если ЗначениеЗаполнено(фЦех) Или ЗначениеЗаполнено(фМаршрут) Или ЗначениеЗаполнено(фСтрока) Тогда
		ВСтруктура = Новый Структура("ЦехМаршрут, Наименование", ?(ЗначениеЗаполнено(фМаршрут), фМаршрут, фЦех), фСтрока);
	Иначе
		ВСтруктура = Неопределено;
	КонецЕсли;
	Возврат ВСтруктура;
КонецФункции