// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ
	|	уатЗаявкиНаРемонтОстатки.Организация,
	|	уатЗаявкиНаРемонтОстатки.ТС,
	|	уатЗаявкиНаРемонтОстатки.Колонна,
	|	уатЗаявкиНаРемонтОстатки.ЗаявкаНаРемонт,
	|	уатЗаявкиНаРемонтОстатки.ВидОбслуживания,
	|	уатЗаявкиНаРемонтОстатки.Номенклатура,
	|	уатЗаявкиНаРемонтОстатки.КоличествоОстаток КАК Количество,
	|	уатЗакрытиеЗаявокНаРемонтыЗаявки.Ссылка КАК Регистратор,
	|	уатЗакрытиеЗаявокНаРемонтыЗаявки.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|ИЗ
	|	РегистрНакопления.уатЗаявкиНаРемонт.Остатки(
	|			&МоментВремени,
	|			ЗаявкаНаРемонт В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					уатЗакрытиеЗаявокНаРемонтыЗаявки.ЗаявкаНаРемонт
	|				ИЗ
	|					Документ.уатЗакрытиеЗаявокНаРемонты.Заявки КАК уатЗакрытиеЗаявокНаРемонтыЗаявки
	|				ГДЕ
	|					уатЗакрытиеЗаявокНаРемонтыЗаявки.Ссылка = &Ссылка)) КАК уатЗаявкиНаРемонтОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатЗакрытиеЗаявокНаРемонты.Заявки КАК уатЗакрытиеЗаявокНаРемонтыЗаявки
	|		ПО уатЗаявкиНаРемонтОстатки.ЗаявкаНаРемонт = уатЗакрытиеЗаявокНаРемонтыЗаявки.ЗаявкаНаРемонт
	|			И уатЗаявкиНаРемонтОстатки.Организация = уатЗакрытиеЗаявокНаРемонтыЗаявки.Ссылка.Организация
	|			И уатЗаявкиНаРемонтОстатки.ТС = уатЗакрытиеЗаявокНаРемонтыЗаявки.ЗаявкаНаРемонт.ТС
	|			И уатЗаявкиНаРемонтОстатки.ВидОбслуживания = уатЗакрытиеЗаявокНаРемонтыЗаявки.ЗаявкаНаРемонт.ВидОбслуживания
	|ГДЕ
	|	уатЗакрытиеЗаявокНаРемонтыЗаявки.Ссылка = &Ссылка";
	
	мЗапрос.УстановитьПараметр("Ссылка"       , ДокументСсылка);
	мЗапрос.УстановитьПараметр("МоментВремени", ДокументСсылка.МоментВремени());
	
	ТаблицаЗаявокНаРемонт = мЗапрос.Выполнить().Выгрузить();   
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаявокНаРемонт"   , ТаблицаЗаявокНаРемонт);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт

КонецПроцедуры
						  
						  
						  
						  
						  
						  
						 