#Если Клиент Тогда
	
//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА


// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		//уатОбщегоНазначения.уатВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
		
	КонецЕсли;
	
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.КоличествоЕдХраненияОстатков КАК КоличествоЕдХраненияОстатков,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Ссылка.Дата КАК Период,
	|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, ДЕНЬ) КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, ГОД) КАК ПериодГод,
	|	ВложенныйЗапрос.Ссылка.ТС КАК ТС,
	|	ВложенныйЗапрос.Ссылка.ТС.ГаражныйНомер КАК ТСГарНомер,
	|	ВложенныйЗапрос.Ссылка.ТС.ГосударственныйНомер КАК ТСГосНомер,
	|	ВложенныйЗапрос.Ссылка.ТС.Колонна КАК Колонна,
	|	ВложенныйЗапрос.ЗапчастиРаботы КАК ЗапчастиРаботы
	|{ВЫБРАТЬ
	|	Номенклатура.*,
	|	ЕдиницаИзмерения.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	ТС.* КАК ТС,
	|	ТСГарНомер,
	|	ТСГосНомер,
	|	Колонна.*,
	|	Количество,
	|	КоличествоЕдХраненияОстатков,
	|	ЗапчастиРаботы}
	|ИЗ
	|	(ВЫБРАТЬ
	|		уатЗаявкаНаРемонтМатериалы.Ссылка КАК Ссылка,
	|		уатЗаявкаНаРемонтМатериалы.Количество КАК Количество,
	|		0 КАК КоличествоЕдХраненияОстатков,
	|		уатЗаявкаНаРемонтМатериалы.Номенклатура КАК Номенклатура,
	|		уатЗаявкаНаРемонтМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаВидНоменклатуры.ЗапасныеЧасти) КАК ЗапчастиРаботы
	|	ИЗ
	|		Документ.уатЗаявкаНаРемонт.Материалы КАК уатЗаявкаНаРемонтМатериалы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		уатЗаявкаНаРемонтРаботы.Ссылка,
	|		уатЗаявкаНаРемонтРаботы.Количество,
	|		уатЗаявкаНаРемонтРаботы.Количество,
	|		уатЗаявкаНаРемонтРаботы.Работа,
	|		уатЗаявкаНаРемонтРаботы.Работа.Номенклатура.БазоваяЕдиницаИзмерения,
	|		ЗНАЧЕНИЕ(Перечисление.уатПолеОтчетаВидНоменклатуры.РаботыПоРемонту)
	|	ИЗ
	|		Документ.уатЗаявкаНаРемонт.Работы КАК уатЗаявкаНаРемонтРаботы) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Ссылка.Проведен
	|	И ВложенныйЗапрос.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|{ГДЕ
	|	ВложенныйЗапрос.Ссылка.Дата,
	|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, ДЕНЬ)) КАК ПериодДень,
	|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, НЕДЕЛЯ)) КАК ПериодНеделя,
	|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, ДЕКАДА)) КАК ПериодДекада,
	|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, МЕСЯЦ)) КАК ПериодМесяц,
	|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, КВАРТАЛ)) КАК ПериодКвартал,
	|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, ПОЛУГОДИЕ)) КАК ПериодПолугодие,
	|	(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Ссылка.Дата, ГОД)) КАК ПериодГод,
	|	ВложенныйЗапрос.Ссылка.ТС.* КАК ТС,
	|	ВложенныйЗапрос.Ссылка.ТС.ГаражныйНомер КАК ТСГарНомер,
	|	ВложенныйЗапрос.Ссылка.ТС.ГосударственныйНомер КАК ТСГосНомер,
	|	ВложенныйЗапрос.Ссылка.ТС.Колонна.* КАК Колонна,
	|	ВложенныйЗапрос.Номенклатура.*,
	|	ВложенныйЗапрос.ЗапчастиРаботы.*}
	|{УПОРЯДОЧИТЬ ПО
	|	Количество,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	ТС.*,
	|	ТСГарНомер,
	|	ТСГосНомер,
	|	Колонна.*,
	|	Номенклатура.*,
	|	ЕдиницаИзмерения.*}
	|ИТОГИ
	|	ВЫБОР
	|		КОГДА Номенклатура ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(Количество)
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА Номенклатура ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ СУММА(КоличествоЕдХраненияОстатков)
	|	КОНЕЦ КАК КоличествоЕдХраненияОстатков
	|ПО
	|	Номенклатура,
	|	ЕдиницаИзмерения,
	|	Период,
	|	ТС,
	|	ТСГарНомер КАК ТСГарНомер,
	|	ТСГосНомер КАК ТСГосНомер,
	|	Колонна,
	|	ЗапчастиРаботы
	|{ИТОГИ ПО
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	ТС.*,
	|	ТСГарНомер,
	|	ТСГосНомер,
	|	Колонна.*,
	|	Номенклатура.*,
	|	ЕдиницаИзмерения.*,
	|	ЗапчастиРаботы}";
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	//Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
	//	
	//	// Добавление свойств и категорий поля запроса в таблицу полей.
	//	// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
	//	
	//	// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , 
	//                                                  <ПсевдонимПоля>, <Представление>, <Назначение>);
	//	УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("уатДТП.Заказчик", "Заказчик", "Заказчик", 
	//                                ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
	//	
	//	// Добавление свойств и категорий в исходный текст запроса.
	//	УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
	//	
	//КонецЕсли;
	
	Если уатРаботаСМетаданными.естьСпрЕдиницыИзмерения() тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"0 КАК КоличествоЕдХраненияОстатков"," ВЫРАЗИТЬ(уатЗаявкаНаРемонтМатериалы.Количество * уатЗаявкаНаРемонтМатериалы.ЕдиницаИзмерения.Коэффициент / уатЗаявкаНаРемонтМатериалы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ЧИСЛО(15,3)) КАК КоличествоЕдХраненияОстатков");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"0 КАК КоличествоЕдХраненияОстатков"," уатЗаявкаНаРемонтМатериалы.Количество КАК КоличествоЕдХраненияОстатков");
	КонецЕсли;
	
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	Пока УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Количество() > 0 Цикл
		
		УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки.Удалить(УниверсальныйОтчет.ПостроительОтчета.ИзмеренияСтроки[0]);
		
	КонецЦикла;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТС"              , "ТС / оборудование (все поля)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТСГарНомер"      , "ТС (гар. номер)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ТСГосНомер"      , "ТС (гос. номер)");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Период"          , "Дата");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЗапчастиРаботы"  , "Запчасти / работы.");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЕдиницаИзмерения", "Ед. изм.");
	
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	//// Заполнение начальных настроек универсального отчета
	//УниверсальныйОтчет.УстановитьНачальныеНастройки(Истина);
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ТС");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ЗапчастиРаботы");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	//
	//УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ЕдиницаИзмерения");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Количество" , "Количество" , Истина,"ЧДЦ=3", , );
	Если уатРаботаСМетаданными.естьСпрЕдиницыИзмерения() тогда
		УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЕдХраненияОстатков", "Количество (в ед. хранения остатков)", Истина,"ЧДЦ=3", , );
	КонецЕсли;

	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	УниверсальныйОтчет.ДобавитьОтбор("ТСГосНомер",Ложь,ВидСравнения.Содержит);
	УниверсальныйОтчет.ДобавитьОтбор("Период"    ,Ложь,ВидСравнения.Интервал);
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	//УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения("ВыполнениеЗаказовНаТС", "ЗаказНаТС");	
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	Если уатРаботаСМетаданными.естьСпрЕдиницыИзмерения() тогда
		УниверсальныйОтчет.ДобавитьДополнительноеПоле("Номенклатура.ЕдиницаХраненияОстатков", ТипРазмещенияРеквизитовИзмерений.ВместеСИзмерениями);
	КонецЕсли;
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("ТСГосНомер"      , ТипРазмещенияРеквизитовИзмерений.Отдельно);
	
	//ПутьКДанным, Размещение = Неопределено, Положение = 3
	
КонецПроцедуры // УстановитьНачальныеНастройки()

//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 

// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);
	ТабличныйДокумент.ТолькоПросмотр = уатПраваИНастройки.уатПраво("ЗащитаПечатныхФорм", глПраваУАТ);
	
КонецПроцедуры // СформироватьОтчет()

//=================================================================================
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = уатОбщегоНазначения.уатСохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	уатОбщегоНазначения.уатСохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	уатОбщегоНазначения.уатВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 
// 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
УниверсальныйОтчет.мРежимВводаПериода = 0;
	
#КонецЕсли
