
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда Возврат; КонецеСЛИ;
	
	Если Найти(ИмяПользователя(),"1с")<>0
		или Найти(ИмяПользователя(),"1c")<>0 Тогда 
		Возврат; 
	КонецЕСЛИ;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОборудованиеРаботыГСМ.Ссылка
	               |ИЗ
	               |	Справочник.ОборудованиеРаботыГСМ КАК ОборудованиеРаботыГСМ
	               |ГДЕ
	               |	ОборудованиеРаботыГСМ.Родитель В ИЕРАРХИИ(&Родитель)";
				   
				   Мас = Новый МАссив;
				   Мас.Добавить(Справочники.ОборудованиеРаботыГСМ.Надбавки);
				   Мас.Добавить(Справочники.ОборудованиеРаботыГСМ.УсловияРаботы);
				   Мас.Добавить(Справочники.ОборудованиеРаботыГСМ.Отопители);
				   Запрос.УстановитьПараметр("Родитель",мАС);
				   ТБл = Запрос.Выполнить().Выгрузить();
				   Для каждого Эл из Мас Цикл
					   ТБл.Добавить().Ссылка = эл;
				   КонецЦикла;
				   
	Если (Тбл.Найти(ССылка)=Неопределено и ЗначениеЗаполнено(ссылка)=истина )
	 или  Тбл.Найти(Родитель)=Неопределено  Тогда
			Сообщить("Запрещено. Можно редактировать оборудование только в папках: Надбавки, Отопители и Условия Работы!");
			Отказ = Истина;
	   
   КонецЕсли;
					  
	
	
КонецПроцедуры
