//==================================================================================
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция проверяет, существуют ли ссылки на договор в движениях регистров накопления.
// Если есть - нельзя менять:
//  - Валюту взаиморасчетов
//  - Ведение взаиморасчетов.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Истина - если есть движения, Ложь - если нет.
//
Функция СуществуютСсылки() Экспорт
      Возврат Ложь;
КонецФункции //  СуществуютСсылки()

//==================================================================================
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура вызывается перед записью элемента справочника.
//
Процедура ПередЗаписью(Отказ)

	// Проверим можно ли изменять реквизиты договора.
	
	Если  МакетСправки <> "Внешний макет"
		и МакетСправки <> "Внешняя обработка" Тогда
		ХранилищеСправка = Новый ХранилищеЗначения(Неопределено);
		ИмяФайлаСправка   = "";
		КомментарийКФайлуИсточникуСправка = "";
	КонецЕСЛИ;
	
	Если  МакетРеестра <> "Внешний макет"  Тогда
		Хранилище = Новый ХранилищеЗначения(Неопределено);
		ИмяФайла   = "";
		КомментарийКФайлуИсточнику = "";
	КонецЕСЛИ;
	
	Если  МакетРеестра <> "Внешняя обработка" Тогда
		ХранилищеОб = Новый ХранилищеЗначения(Неопределено);
		ИмяФайлаОБ   = "";
		КомментарийКФайлуИсточникуОб = "";
	КонецЕСЛИ;
	

КонецПроцедуры // ПередЗаписью()