////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	// Контроль полноты графика
	
	Если Показатели.Количество() < 2 Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'В таблице преобразования должно быть как минимум две строки!'"));		
	КонецЕсли;
	
	// Контроль дублирования строк	
	
	ТЗКонтроль = Показатели.Выгрузить();
	ТЗКонтроль.Колонки.Добавить("Количество");
	ТЗКонтроль.ЗаполнитьЗначения(1,"Количество");
	ТЗКонтроль.Свернуть("Вход,Выход", "Количество");
	
	Для каждого СтрокаТЗ Из ТЗКонтроль Цикл
		Если СтрокаТЗ.Количество > 1 Тогда
			Отказ = Истина;
			Сообщить(НСтр("ru = 'В таблице преобразования дублируются одинаковые строки!'"));	
		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

// Процедура - обработчик события ПриЗаписи.
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	ItobВызовСервера.ЗаписатьСтрокуВРегистрПрав(Ссылка);
	
КонецПроцедуры