////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мСкопированаФорма Экспорт; // Хранит признак скопированной формы.
Перем мТаблицаСоставПоказателей Экспорт; // Хранит таблицу значений - состав показателей отчета.
Перем мСтруктураМногостраничныхРазделов Экспорт; // Хранит структуру многостраничных разделов.
Перем мСтруктураВариантыЗаполнения Экспорт; // Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мДеревоСтраницОтчета Экспорт; // Хранит дерево значений - структуру листов отчета.


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

Процедура ПриКопировании(ОбъектКопирования)

	// Храним информацию о выбранной форме объекта копирования.
	// Она нужна для дальнейшего принятия решения - новый документ создаем
	// с сохранением или с очисткой данных объекта копирования.
	мСкопированаФорма = ОбъектКопирования.ВыбраннаяФорма;
	
КонецПроцедуры // ПриКопировании()

