Процедура ЗафиксироватьФактВыписки(пДатаФормирования, пПутевойЛист, пСтруктураРеквизитов = Неопределено) Экспорт
	мНоваяЗаписьВыписки = РегистрыСведений.ВыпискаПЛПоИдентификаторам.СоздатьМенеджерЗаписи();
	Если пСтруктураРеквизитов <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(мНоваяЗаписьВыписки, пСтруктураРеквизитов);
	КонецЕсли;
	мНоваяЗаписьВыписки.ПутевойЛист = пПутевойЛист;
	мНоваяЗаписьВыписки.ДатаВыписки = НачалоДня(пДатаФормирования);
	мНоваяЗаписьВыписки.ДатаЗаписи = ТекущаяДата();
	мНоваяЗаписьВыписки.Записать(Истина);
КонецПроцедуры