
&НаКлиенте
Процедура СписокТиповВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокТиповВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	мОписаниеОповещенияОбработкаВыбораТипов = Новый ОписаниеОповещения("ОбработкаВыбораТипов", ЭтаФорма);
	ОткрытьФорму("Справочник.уатТипыТС.Форма.ФормаВыбораУпр", , , , , , мОписаниеОповещенияОбработкаВыбораТипов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораТипов(пРезультат, пДополнительныеПараметры) Экспорт
	Если пРезультат <> Неопределено Тогда
		Для Каждого  мЭлемент Из пРезультат Цикл
			мНоваяСтрока = Объект.СписокТипов.Добавить();
			мНоваяСтрока.ТипТС = мЭлемент;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
	