
&НаКлиенте
Процедура фТекущийПроектПриИзменении(Элемент)
	Элементы.фТаблицаФильтров.ОтборСтрок = Новый ФиксированнаяСтруктура("Проект", фТекущийПроект);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	СохранитьНастройку();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мХранилищеДанных = ХранилищеОбщихНастроек.Загрузить("СтруктураСписковСтатистикиРаботыПользователей", "СпискиПользователейДляФильтров", , "ОбщаяНастройка");
	Если мХранилищеДанных <> Неопределено И мХранилищеДанных.Свойство("ДанныеМассив") Тогда
		мДанные = мХранилищеДанных.ДанныеМассив;
		фТаблицаФильтров.Очистить();
		Для Каждого мСтуктура Из мДанные Цикл
			мНоваяСтрока = фТаблицаФильтров.Добавить();
			ЗаполнитьЗначенияСвойств(мНоваяСтрока, мСтуктура);
		КонецЦикла;
	КонецЕсли;
	
	фТекущийПроект = "Доступ";
	Элементы.фТаблицаФильтров.ОтборСтрок = Новый ФиксированнаяСтруктура("Проект", фТекущийПроект);
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройку()
	пДанныеМассив = Новый Массив;
	Для Каждого мСтрока Из фТаблицаФильтров Цикл
		мСтруктураСтроки = Новый Структура("Пользователь, Проект");
		ЗаполнитьЗначенияСвойств(мСтруктураСтроки, мСтрока);
		пДанныеМассив.Добавить(мСтруктураСтроки);
	КонецЦикла;
	пДанные = Новый Структура("ДанныеМассив", пДанныеМассив);
	ХранилищеОбщихНастроек.Сохранить("СтруктураСписковСтатистикиРаботыПользователей", "СпискиПользователейДляФильтров", пДанные, , "ОбщаяНастройка");
КонецПроцедуры

&НаКлиенте
Процедура фТаблицаФильтровПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Элементы.фТаблицаФильтров.ТекущиеДанные.Проект = фТекущийПроект;
КонецПроцедуры
