
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИдентификаторСтрокиЗаявки") Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры);
		Элементы.РеверсивнаяПривязкаКЛоту.Видимость = Истина;
		фПозицияПП = Параметры.ПозицияПП;
	Иначе
		Элементы.РеверсивнаяПривязкаКЛоту.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеверсивнаяПривязкаКЛоту(Команда)
	мСвойстваРазбивки = Новый Структура("ИдентификаторСтрокиЗаявки, ТС, ЦехМаршрут, ВремяПодачи, ВремяВозврата, ПозицияПП, МестоРаботы");
	ЗаполнитьЗначенияСвойств(мСвойстваРазбивки, Запись);
	мСвойстваРазбивки.ПозицияПП = фПозицияПП;
	ОткрытьФорму("Документ.юкЛот.Форма.ФормаПодбораЛота", мСвойстваРазбивки, , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
