
&НаСервере
Функция ПроверкаУстановленногоРелиза(КаталогРелиза)
	Об = РеквизитФормыВЗначение("Объект");
	ЕстьРелиз = Об.ПроверкаУстановленногоРелиза(КаталогРелиза);
	Возврат ЕстьРелиз;
КонецФункции

&НаСервере
Функция ПолучитьКаталогРелиза(КаталогОбновления)
	//Находит в указанном каталоге (это константа) все находящиеся там каталоги/файлы по заданной маске
	//В общем случае - это массив с тем количеством элементов, сколько найдено
	//В нашем случае - это один каталог - наименование - номер устанавливаемой платформы
	МассивКаталогов = НайтиФайлы(КаталогОбновления,"8.3*.*");
	Если МассивКаталогов.Количество() > 0 Тогда
		Возврат МассивКаталогов[0].Имя;
	Иначе
		Возврат "";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура Поехали()
	Стр = МодульСерверный.ПолучитьДанныеПодключения();
	КлючиЗапуска = "";
	Если Стр.КлючиЗапускаПрограммыУстановки <> "" Тогда
		КлючиЗапуска = " " + Стр.КлючиЗапускаПрограммыУстановки;
	КонецЕсли;	
	
	
	//1. Определяем Каталог релиза для установки
	КаталогРелиза = ПолучитьКаталогРелиза(Стр.Каталог);
	
	//2. Если каталог релиза есть, то проверяем: а не установлен ли у нас этот релиз
	Если КаталогРелиза <> "" Тогда
		ЕстьРелиз = ПроверкаУстановленногоРелиза(КаталогРелиза);
		Если ЕстьРелиз Тогда
			ТекстСообщения = "Релиз платформы " + КаталогРелиза + " на Вашем компьютере уже установлен!";
			ПоказатьПредупреждение(, ТекстСообщения);
			Возврат;
		Конецесли;	
	Иначе
		Возврат;
	КонецЕсли;
	
	// 3. Если релиз не установлен - устанавливаем!
	// Тут может случиться так, что файла "runasuser.exe" в каталоге обновления может не быть
	//поэтому мы сначала проверим его наличие.
	//Если он есть - то используем этот файл из каталога обновления
	//а если его нет, то мы его выдернем из макета и скопируем во временный каталог пользователя
	Есть_runasuser = МодульСерверный.ПроверитьСуществованиеФайлаКаталога(Стр.Каталог + "\runasuser.exe");
	Если Есть_runasuser Тогда
		Команда = "start ""Установка платформы"" /min runasuser.exe -u " + Стр.Пользователь + " -p " + Стр.Пароль + " -d "+ Стр.Домен + " " + КаталогРелиза + "\1cEntRepack.exe" + КлючиЗапуска;
	Иначе
		//Функция копирует из макета "Runas" файл во временный каталог пользователя
		//и возвращает имя этого каталога
		КВФ = runasuser();
		Команда = "start ""Установка платформы"" /min " + КВФ + "\runasuser.exe -u " + Стр.Пользователь + " -p " + Стр.Пароль + " -d "+ Стр.Домен + " " + КаталогРелиза + "\1cEntRepack.exe" + КлючиЗапуска;
		
	КонецЕсли;
	МодульКлиентский.ВыполнитьКомандуСистемы(Команда,Стр.Каталог);
	//КомандаСистемы(Команда,Стр.Каталог);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеПлатформы(Команда)
	Поехали();
КонецПроцедуры

&НаСервере
Функция runasuser()
	Об = РеквизитФормыВЗначение("Объект");
	КВФ = КаталогВременныхФайлов(); //C:\Users\sokotovap\AppData\Local\Temp\
	МакетСДанными = Об.ПолучитьМакет("Runas");
	МакетСДанными.Записать(КВФ + "\runasuser.exe");
	Возврат КВФ;
КонецФункции
