// Функция возвращает список возможных наименований для элемента справочника
//
// Параметры:
//  СпрОбъект    - элемент для которого надо получить наименование
Функция ПолучитьСписокВозможныхНаименований(СпрОбъект) Экспорт
	мСписок = Новый СписокЗначений;
	СтрокаНаим = "" + СпрОбъект.Вид + ", от " + СпрОбъект.ЛСилОт + " л.с. до " + СпрОбъект.ЛСилДо + " л.с."; 
	мСписок.Добавить(СтрокаНаим);
	СтрокаНаим = "" + СпрОбъект.Вид + ", от " + СпрОбъект.ЛСилОт + " л.с. до " + СпрОбъект.ЛСилДо + " л.с., ставка " + СпрОбъект.Ставка; 
	мСписок.Добавить(СтрокаНаим);
	СтрокаНаим = "" + СпрОбъект.Вид + ", ставка " + СпрОбъект.Ставка; 
	мСписок.Добавить(СтрокаНаим);
	Возврат мСписок;
КонецФункции
