
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	мНаборДвижений = Движения.ПроизводственнаяПрограмма;
	мНаборДвижений.Очистить();
	мНаборДвижений.Записывать = Истина;
	
	Для Итр = Месяц(Дата) По 12 Цикл
		мДата = ДобавитьМесяц(Дата, Итр - 1);
		Для Каждого мСтрока Из ТаблицаРасчет Цикл
			мЗаписьДвижений = мНаборДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(мЗаписьДвижений, мСтрока);
			мЗаписьДвижений.НомерСтрокиДокумента = мСтрока.НомерСтроки;
			мЗаписьДвижений.Регистратор = Ссылка;
			мЗаписьДвижений.Период = Дата;
			мЗаписьДвижений.Месяц = НачалоМесяца(мДата);
			мЗаписьДвижений.Идентификатор = мСтрока.ИдентификаторСтрокиЛота;
			мЗаписьДвижений.СебестоимостьСубподряда = мСтрока.СуммаСубподряд;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
