Функция ПолучитьПробегШины(Шина,Знач Дата = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(Дата) тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	уатИзносПробегШинОбороты.СерияНоменклатуры,
	|	уатИзносПробегШинОбороты.ТС,
	|	уатИзносПробегШинОбороты.ПробегОборот
	|ИЗ
	|	РегистрНакопления.уатИзносПробегШин.Обороты(, &ДатаКон, , СерияНоменклатуры = &СерияНоменклатуры) КАК уатИзносПробегШинОбороты";
	мЗапрос.УстановитьПараметр("ДатаКон"          , ТекущаяДата());
	мЗапрос.УстановитьПараметр("СерияНоменклатуры", Шина);
	
	Выборка = мЗапрос.Выполнить().Выбрать();
	Если Выборка.Следующий()Тогда
		Возврат Выборка.ПробегОборот;
	Иначе
		Возврат 0;		
	КонецЕсли;
	
КонецФункции
