// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимость();
	
КонецПроцедуры // ПриОткрытии()

// Процедура - обработчик команды "ЗадатьМестоположение".
//
&НаКлиенте
Процедура ЗадатьМестоположение(Команда)
	
	Если НЕ ItobОперативныйМониторингКлиент.ПроверитьДоступностьСервисаCsmSvc(ItobОперативныйМониторинг.ПолучитьАдресСервисаCsmSvc()) Тогда
		Предупреждение("Сервис CsmSvc недоступен! Необходимо воспользоваться мастером настройки службы CsmSvc.");
		Возврат;
	
	КонецЕсли;
	
	ФормаОпределенияПоложения = ПолучитьФорму("Справочник.ItobМестоположенияПоУмолчанию.Форма.ФормаОпределенияПоложения");
		
	ФормаОпределенияПоложения.ВладелецФормы = ЭтаФорма;	
	ФормаОпределенияПоложения.Масштаб = Объект.Масштаб;
	ФормаОпределенияПоложения.Широта = Объект.Широта;
	ФормаОпределенияПоложения.Долгота = Объект.Долгота;
		
	РезультатФормы = ФормаОпределенияПоложения.ОткрытьМодально();
	
	Если РезультатФормы = Истина Тогда
		
		Объект.Масштаб = ФормаОпределенияПоложения.Масштаб;
		Объект.Широта  = ФормаОпределенияПоложения.Широта;
		Объект.Долгота = ФормаОпределенияПоложения.Долгота;
		
		ОбновитьВидимость();
				
	КонецЕсли;
	
	ФормаОпределенияПоложения = Неопределено;
	
КонецПроцедуры // ЗадатьМестоположение()

// Процедура обновляет надписи местоположения.
//
&НаКлиенте
Процедура ОбновитьВидимость()

	Элементы.НадписьМасштаб.Заголовок = "Первоначальный масштаб : "+Объект.Масштаб;
	Элементы.НадписьШирота.Заголовок  = "Широта центра карты  : "+Формат(Объект.Широта,"ЧЦ=10; ЧДЦ=5");
	Элементы.НадписьДолгота.Заголовок = "Долгота центра карты : "+Формат(Объект.Долгота,"ЧЦ=10; ЧДЦ=5");
	
КонецПроцедуры // ОбновитьВидимость()
