// Функция предназначена для получения значения по имени переменной
// Вызывается из функции глЗначениеПеременной
//
// Параметры:
//	Имя - Строка, имя переменной
//
// Возвращаемое значение: 
//  Произвольное значение
//
Функция ПолучитьЗначениеПеременной(ИмяПараметра) Экспорт
	
	ИмяПараметраВР = ВРег(ИмяПараметра);
	Если ИмяПараметраВР = ВРег("ВалютаРегламентированногоУчета") Тогда
		Возврат Константы.ВалютаРегламентированногоУчета.Получить();
		
	ИначеЕсли ИмяПараметраВР = ВРег("ВалютаУправленческогоУчета") Тогда
		Возврат Константы.ВалютаУправленческогоУчета.Получить();
		
		#Если Клиент Тогда
			
		ИначеЕсли ИмяПараметраВР = ВРег("КэшСтратегииАвтонумерации") Тогда	
			Возврат Новый Соответствие;		
			
		#КонецЕсли	
		
	Иначе
		
		// Если имя переменной ни одно из перечисленных выше, считаем что это имя константы.
		// Если константы с таким именем в конфигурации нет, то произойдет ошибка времени выполнения,
		// это значит, что в функцию передали неверное имя переменной
		Возврат Константы[ИмяПараметраВР].Получить();
		
	КонецЕсли;
	
КонецФункции