Функция ПЕчДанные()
	
	Запрос =Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаботаЗаСменуИсполнители.Ссылка.Номер КАК НомерДОк,
	               |	РаботаЗаСменуИсполнители.Ссылка.Дата КАК ДатаДОк,
	               |	РаботаЗаСменуИсполнители.Ссылка.Организация КАК Организация,
	               |	РаботаЗаСменуИсполнители.Сотрудник.Наименование КАК Сотрудник,
	               |	РаботаЗаСменуИсполнители.Сотрудник.Код КАК ТабНом,
	               |	РаботаЗаСменуИсполнители.ДокументЛист.Номер КАК НомерРЛ,
	               |	РаботаЗаСменуИсполнители.ДокументЛист.Дата КАК ДатаРЛ,
	               |	ВЫБОР
	               |		КОГДА РаботаЗаСменуИсполнители.ДокументЛист ССЫЛКА Документ.уатПутевойЛист
	               |			ТОГДА РаботаЗаСменуИсполнители.ДокументЛист.ТранспортноеСредство
	               |		ИНАЧЕ РаботаЗаСменуИсполнители.ДокументЛист.ТС
	               |	КОНЕЦ КАК ТС,
	               |	ВЫБОР КОГДА РаботаЗаСменуИсполнители.ДокументЛист.Номер IS null ТОгда "" ""
	               |		КОГДА РаботаЗаСменуИсполнители.ДокументЛист ССЫЛКА Документ.уатПутевойЛист
	               |			ТОГДА ""ПЛ""
	               |		ИНАЧЕ ""РЛ""
	               |	КОНЕЦ КАК ВидДОк,
	               |	ВЫБОР
	               |		КОГДА РаботаЗаСменуИсполнители.ДокументЛист ССЫЛКА Документ.уатПутевойЛист
	               |			ТОГДА РаботаЗаСменуИсполнители.ДокументЛист.ТранспортноеСредство.ГаражныйНомер
	               |		ИНАЧЕ РаботаЗаСменуИсполнители.ДокументЛист.ТС.ГаражныйНомер
	               |	КОНЕЦ КАК ГарНом,
	               |	РаботаЗаСменуИсполнители.ВремяРаботы,
	               |	уатСведенияОСотрудникахСрезПоследних.Должность.Наименование КАК имяДолжность
	               |ИЗ
	               |	Документ.РаботаЗаСмену.Исполнители КАК РаботаЗаСменуИсполнители
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уатСведенияОСотрудниках.СрезПоследних КАК уатСведенияОСотрудникахСрезПоследних
	               |		ПО РаботаЗаСменуИсполнители.Сотрудник = уатСведенияОСотрудникахСрезПоследних.Сотрудник
	               |ГДЕ
	               |	РаботаЗаСменуИсполнители.Ссылка = &сс";
	Запрос.УстановитьПараметр("сс",Ссылка);			   
	Тбл = Запрос.Выполнить().Выгрузить();
	Тбл.Колонки.Добавить("Должность",Новый ОписаниеТипов("Строка"));
	
	Для каждого стр из Тбл Цикл
		Стр.Должность = Сокрлп(Стр.ИмяДолжность);	
	КонецЦикла;
	
	Возврат Тбл;
	
КонецФункции

Процедура Печать() экспорт
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	Таб.ИмяПараметровПечати = "ПечСписокРРМпо рвепыавилывтдаь";
	
	облШапка = МАкет.ПолучитьОбласть("Шапка");
	облСтрока = МАкет.ПолучитьОбласть("Строка");
	
	ТБл = ПЕчДанные();
	Если Тбл.КОличество()>0 ТОгда
		облШапка.Параметры.Заполнить(ТБл[0]);
	КонецеСЛИ;
	Таб.Вывести(облШапка);

	Ном = 0;
	ДЛЯ каждого стр из Тбл ЦИкл
		Ном= Ном+1;
		облСТрока.Параметры.Ном = Ном;
		облСТрока.Параметры.Заполнить(СТр);
		Таб.Вывести(ОблСтрока);
	КонецЦИкла;
	
	Таб.ПовторятьПриПечатиСтроки = Таб.Область(6,,7);
	
	Таб.ТолькоПросмотр = Истина;
	ТАб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	Таб.Показать();
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	1 КАК колДней,
	               |	ПланРаботыТСПлан.Подразделение,
	               |	ПланРаботыТСПлан.Контрагент,
	               |	ПланРаботыТСПлан.Договор,
	               |	ПланРаботыТСПлан.ТипТС КАК ДетализацияПланирования,
	               |	ПланРаботыТСПлан.Часы КАК итКоличество,
	               |	ПланРаботыТСПлан.Сумма КАК итСтоимость,
	               |	0 КАК Количество,
	               |	0 КАК Стоимость,
	               |	уатРегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК Период
	               |
	               |ИЗ
	               |	Документ.ПланРаботыТС.План КАК ПланРаботыТСПлан
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уатРегламентированныйПроизводственныйКалендарь КАК уатРегламентированныйПроизводственныйКалендарь
	               |		ПО (уатРегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= НАЧАЛОПЕРИОДА(ПланРаботыТСПлан.Ссылка.Дата, МЕСЯЦ))
	               |			И (уатРегламентированныйПроизводственныйКалендарь.ДатаКалендаря < НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПланРаботыТСПлан.Ссылка.Дата, МЕСЯЦ, 1), МЕСЯЦ))
	               |ГДЕ
	               |	ПланРаботыТСПлан.Ссылка = &Ссылка";
				   Запрос.УстановитьПараметр("ссылка",Ссылка);
				   Тбл = Запрос.Выполнить().Выгрузить();
				   
				   
				   
	Т = Тбл.Скопировать();
	Т.свернуть("Подразделение,Контрагент,Договор,ДетализацияПланирования,итКоличество,итСтоимость","КолДней");
	Для каждого С из Т Цикл
		пКол = Окр(С.итКоличество/С.колДней,1,1);
		пСум = ОКР(С.итСтоимость / С.итКоличество,2,1) * пКол;
		итКол = 0;
		итСум = 0;
		
		Мас = Тбл.НайтиСтроки(Новый Структура("Подразделение,Контрагент,Договор,ДетализацияПланирования",с.Подразделение,с.Контрагент,с.Договор,с.ДетализацияПланирования));
		ТекЭл = Неопределено;
		Для каждого Эл из Мас Цикл
			Если итКол > С.итКоличество
			 или итСум > С.итСтоимость Тогда Прервать; КонецЕсЛИ;	
			ТекЭл = Эл;
			
			Эл.Количество = пКол;
			Эл.Стоимость = пСум;
			итКол = итКол + Эл.Количество;
			итСум = итСум + эл.Стоимость;
			
		КонецЦикла;
		ТекЭл.Количество = ТекЭл.Количество +  (С.итКоличество-итКол);
		ТекЭл.Стоимость  = ТекЭл.Стоимость  +  (С.итСтоимость-итСум);
		
	КонецЦикла;
	
				   
	
	Рег = Движения.уатПланРаботыТС;
	Рег.Загрузить(Тбл);
	Рег.Записать();
	

КонецПроцедуры

