// МЕХАНИЗМ ОБЩИХ ПЕРЕМЕННЫХ
//
// Для работы с механизмом общих переменных используются функции
//	1. глЗначениеПеременной - для получения значения переменной
//	2. глЗначениеПеременнойУстановить - для изменения значения переменной 
//									(используется в исключительных ситуациях, не для всех переменных).
// 
// ВАЖНО: не следует явно вызывать экспортные функции этого модуля


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ МЕХАНИЗМА ОБЩИХ ПЕРЕМЕННЫХ

// Функция предназначена для получения значения по имени переменной из КЭШа конфигурации
// Вызывается из функции ПолучитьЗначениеПеременной
//
// Параметры:
//	Имя					- Строка, имя переменной
//	НайденноеЗначение	- Произвольное значение, значение переменной. Заполняется в ходе выполнения функции
//  Кэш					- КЭШ из которого получали значение. Заполняется в ходе выполнения функции
//  ПоместитьВКэш		- Булево, Истина, если значение требуется поместить в КЭШ. Заполняется в ходе выполнения функции
//
// Возвращаемое значение: 
//  Булево - Истина, если значение было получено из КЭШа, иначе Ложь
//
Функция ПолучитьИзКэшаКонфигурации(Имя, НайденноеЗначение, Кэш, ПоместитьВКэш) Экспорт
	
	#Если Клиент ИЛИ ВнешнееСоединение Тогда
	Кэш = глОбщиеЗначения;
	#Иначе	
	Кэш = ПараметрыСеанса.ОбщиеЗначения.Получить();
	#КонецЕсли
	
	Если Кэш <> Неопределено Тогда
		// Ищем значение в структуре
		Если Кэш.Свойство(Имя, НайденноеЗначение) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	//Не нашли значение в кэше - вычисленное значение надо будет поместить в Кэш
	ПоместитьВКэш = Истина;
	
	Возврат Ложь;
	
КонецФункции // 

// Функция предназначена для получения значения по имени переменной
// Вызывается из функции глЗначениеПеременной
//
// Параметры:
//	Имя - Строка, имя переменной
//
// Возвращаемое значение: 
//  Произвольное значение
//
Функция ПолучитьЗначениеПеременной(Имя) Экспорт
	
	ИмяПараметраВР = ВРег(Имя);
	
	НайденноеЗначение = Неопределено;
	
	Кэш = Неопределено;
	ПоместитьВКэш = Ложь;
	
	Если НайденноеЗначение = Неопределено Тогда
		
		Если ИмяПараметраВР = ВРег("глТекущийПользователь") Тогда
			Если НЕ ПолучитьИзКэшаКонфигурации(ИмяПараметраВР, НайденноеЗначение, Кэш, ПоместитьВКэш) Тогда
				НайденноеЗначение = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли; 
			
		Иначе
			
			// Остальные переменные получим используя механизм повторно возвращамых значений
			НайденноеЗначение = РаботаСОбщимиПеременнымиПовтИсп.ПолучитьЗначениеПеременной(Имя);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ПоместитьВКэш Тогда
		
		#Если Клиент ИЛИ ВнешнееСоединение Тогда
			
			Если глОбщиеЗначения = Неопределено Тогда
				глОбщиеЗначения = Новый Структура;
			КонецЕсли; 
			глОбщиеЗначения.Вставить(Имя, НайденноеЗначение);
			
		#Иначе	
			
			// В функции ПолучитьИзКэшаКонфигурации получили значение параметра сеанса
			// Добавим в него новое значение переменной и поместим в КЭШ
			Кэш.Вставить(Имя, НайденноеЗначение);
			ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(Кэш);
			
		#КонецЕсли
		
	КонецЕсли; 
	
	Возврат НайденноеЗначение;
	
КонецФункции

Процедура УстановитьЗначениеПеременной(ИмяПараметра, ЗначениеПараметра, ОбновитьКэшНаСервере = Ложь) Экспорт
	
	#Если Клиент ИЛИ ВнешнееСоединение Тогда
		// обновление переменной на клиенте или во внешнем соединении  
		
		// если глобальная переменная глОбщиеЗначения еще не инициализирована, инициализируем ее 
		Если глОбщиеЗначения = Неопределено Тогда
			глОбщиеЗначения = Новый Структура;
		КонецЕсли;
		
		// Установим новое значение переменной
		глОбщиеЗначения.Вставить(ИмяПараметра, ЗначениеПараметра);
		
		Если НЕ ОбновитьКэшНаСервере Тогда
			Возврат;			
		КонецЕсли;
	#КонецЕсли
	
	// Обновим значение переменной в кэше на сервере. Это происходит в двух случаях:
	// 1. при выполнении на клиенте, когда ОбновитьКэшНаСервере = Истина (см. выше)
	// 2. при выполнении на сервере
	КэшНаСервере = ПараметрыСеанса.ОбщиеЗначения.Получить();
		
	// Если ПараметрыСеанса.ОбщиеЗначения еще не инициализирована, инициализируем ее 
	Если КэшНаСервере = Неопределено Тогда
		КэшНаСервере = Новый Структура;
	КонецЕсли;
	
	КэшНаСервере.Вставить(ИмяПараметра, ЗначениеПараметра);
	
	ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(КэшНаСервере);
	
КонецПроцедуры