Процедура СформироватьФайлДанных_АвтоГРАФ5() Экспорт
	СистемаМониторинга = Справочники.СистемыМониторинга.НайтиПоРеквизиту("ФлагПриоритетнаяСистема",Истина);
	ТекстОшибки			 = "";
	ТекстJSON = "";
	ДанныеЗапроса = Неопределено;
	ВнешняяСистема	 = СистемаМониторинга.ВидСистемыGPS;
	УчетнаяЗапись	 = СистемаМониторинга;
	Если ВнешняяСистема = Перечисления.ВидСистемыGPS.Автограф Тогда
		КодВозврата = глСистемыМониторингаСервер.АвтоГРАФ5_GetOnlineInfoAll(УчетнаяЗапись, ДанныеЗапроса, ТекстОшибки, ТекстJSON);
		Если КодВозврата = 0 И ТекстОшибки = "" Тогда
			Текст = Новый ЗаписьТекста("E:\Work\out.txt");
			Текст.Записать(ТекстJSON);
			Текст.Закрыть();			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
