#Если Клиент Тогда

Перем мТаблицаСоставПоказателей Экспорт; // Хранит таблицу значений - состав показателей отчета.
Перем мСтруктураВариантыЗаполнения Экспорт; // Хранит структуру - состав показателей отчета,
											// значение которых автоматически заполняется по учетным данным.
Перем мДеревоСтраницОтчета Экспорт; // Хранит дерево значений - структуру листов отчета.
Перем мЕстьВыбранные Экспорт; // Хранит признак выбора печатных листов
Перем мВыбраннаяФорма Экспорт; // Хранит имя выбранной формы отчета
Перем мСкопированаФорма Экспорт; // Хранит признак скопированной формы.
Перем мВерсияФормы Экспорт; // Версия формы отчета.
Перем мСохраненныйДок Экспорт; // Хранит ссылку на документ, хранящий данные отчета
//Перем мКоммАвто Экспорт; // флажок на форме выбора страниц, если Истина, то пересчет автоматический убрать
Перем мСчетчикСтраниц Экспорт; // флажок на форме выбора страниц, если Истина, то пересчет автоматический убрать
Перем мАвтоВыборКодов Экспорт; // для флажка "отключить выбор значений из списка"

// Следующие переменные хранят границы периода построения отчета
// и периодичность
Перем мДатаНачалаПериодаОтчета Экспорт; // Граница периода построения отчета
Перем мДатаКонцаПериодаОтчета  Экспорт; // Граница периода построения отчета
Перем мПериодичность Экспорт; // Периодичность построения отчета

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт; // Полное имя файла внешней обработки, соответствующего отчету
Перем мЗаписьЗапрещена Экспорт; // Признак запрета записи в файл
Перем мИнтервалАвтосохранения Экспорт; // Интервал автосохранения отчета, с

Перем мПечатьСДвухмернымШтрихКодом Экспорт; // Признак печати с двухмерным штрих-кодом
Перем мСекцияДляДвухмерногоШтрихКодаПредусмотрена Экспорт; // Признак наличия секции для двухмерного штрих-кода

Перем мРезультатПоиска Экспорт; // Таблица с результатами поиска
Перем мСчетчикиСтраницПриПоиске Экспорт; // Таблица со счетчиками номеров листов при поиске
Перем мТаблицаФормОтчета Экспорт; // Таблица разных версий форм отчета
Перем мЗаписываетсяНовыйДокумент Экспорт; // Признак записи нового документа отчета
Перем мВариант Экспорт; // Вариант отчета

Перем мПечатьБезШтрихКодаРазрешена Экспорт; // Признак разрешения печати отчета без штрих-кода


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ОписаниеТиповСтрока50  = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50);
ОписаниеТиповСтрока15  = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(15);

мТаблицаСоставПоказателей    = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",         ОписаниеТиповСтрока50);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",       ОписаниеТиповСтрока50);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",         ОписаниеТиповСтрока50);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",         ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",          ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСтруктуре",     ОписаниеТиповСтрока50);

мСтруктураВариантыЗаполнения = Новый Структура;

ОписаниеТиповСтрока = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(0);

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);

// Пока не известно, с какого периода действует форма, поэтому необходимо править.
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2006Кв1";
НоваяФорма.ОписаниеОтчета     = "Приказ Минфина РФ от 13.04.2006  № 65н";
НоваяФорма.ДатаНачалоДействия = '20060101';
НоваяФорма.ДатаКонецДействия  = '20061231';

// Пока не известно, с какого периода действует форма, поэтому необходимо править.
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2007Кв1";
НоваяФорма.ОписаниеОтчета     = "Приказ Минфина РФ от 13.04.2006  № 65н (в редакции приказа Минфина РФ от 19.12.2006 г. № 180н)";
НоваяФорма.ДатаНачалоДействия = '20070101';
НоваяФорма.ДатаКонецДействия  = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата"));

#КонецЕсли
