
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр уатПрейскурантыТС
	Движения.уатПрейскурантыТССубПодряд.Записывать = Истина;
	Движения.уатПрейскурантыТССубПодряд.Очистить();
	
	Если ЗначениеЗаполнено(Контрагент)=ЛОжь ТОгда
		пКА = Справочники.Контрагенты.ПустаяСсылка();
	ИНАче
		пКа = Контрагент;
	КонецЕСЛИ;
	
	Если ЗначениеЗаполнено(Номенклатура) ТОгда
		
			Движение = Движения.уатПрейскурантыТССубПодряд.Добавить();
			Движение.Период = Дата;
			Движение.Контрагент = пКа;
			Движение.Номенклатура = Номенклатура;
			Движение.Договор = Договор;
			
		
	ИНаче
		
		Для Каждого ТекСтрокаУсловия Из Условия Цикл
			Движение = Движения.уатПрейскурантыТССубПодряд.Добавить();
			Движение.Период = Дата;
			Движение.Контрагент = пКА;
			Движение.Модель = ТекСтрокаУсловия.Модель;
			Движение.ЦехКонтрагента = ТекСтрокаУсловия.ЦехКонтрагента;
			Движение.Номенклатура = ТекСтрокаУсловия.Номенклатура;
			Движение.Договор = Договор;
			Движение.НомерСтрокиДокумента = Условия.Индекс(ТекСтрокаУсловия);
			
			Движение.Цена    = ТекСтрокаУсловия.Цена;
			Движение.ЦенаКм  = ТекСтрокаУсловия.ЦенаКм;
			Движение.Услуга1 = ТекСтрокаУсловия.Услуга1;
			Движение.Услуга2 = ТекСтрокаУсловия.Услуга2;
			Движение.Услуга3 = ТекСтрокаУсловия.Услуга3;
			Движение.Услуга4 = ТекСтрокаУсловия.Услуга4;
			Движение.Услуга5 = ТекСтрокаУсловия.Услуга5;
			Движение.Услуга6 = ТекСтрокаУсловия.Услуга6;
			
			Движение.БезПрицепа = ТекСтрокаУсловия.БезПрицепа;
			Движение.Процент    = ТекСтрокаУсловия.Процент;
			
			Движение.Номенклатура1 = Услуга1;
			Движение.Номенклатура2 = Услуга2;
			Движение.Номенклатура3 = Услуга3;
			Движение.Номенклатура4 = Услуга4;
			Движение.Номенклатура5 = Услуга5;
			Движение.Номенклатура6 = Услуга6;
		КонецЦикла;
		
	КонецесЛИ;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+Lexx
	//Сделаем проверку на то, чтобы не возникло ситуации, когда заполнена услуга3, но не заполнена вышестоящая услуга2 или услуга1
	Для х = 1 По 5 Цикл
		Пред = 6 - х;
		След = 7 - х;
		Если ЗначениеЗаполнено(ЭтотОбъект["Услуга" + След]) И ( Не ЗначениеЗаполнено(ЭтотОбъект["Услуга" + Пред])) Тогда
			Текст = "Внимание, ошибка!!!
					|У Вас заполнен реквизит ""Услуга " + След + """
					|но при этом пустой реквизит ""Услуга " + Пред + """
					|на закладке ""Настройка колонок услуг""!!!";
			Предупреждение(Текст);
			Отказ = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла	
	//-Lexx
КонецПроцедуры


