Функция Печать (Объект) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
    ТабДокумент.АвтоМасштаб = Истина;
	
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева = 0;
	ТабДокумент.ПолеСнизу = 0;
	ТабДокумент.ПолеСправа = 0;

	Макет = Документы.Заявка.ПолучитьМакет("Макет");
	
	//Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Дата = Формат(Объект.Дата, "ДЛФ=Д"); 	
	Область.Параметры.Номер = Объект.Номер;
	Область.Параметры.Контрагент = Объект.Контрагент;
	ТабДокумент.Вывести(Область);
	
	//Шапка
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(Область);

	сч = 1;
	Для каждого СтрокаТЧ Из Объект.Состав Цикл
		Область = Макет.ПолучитьОбласть("Строка");		
		Область.Параметры.Заполнить(СтрокаТЧ);
		Область.Параметры.Номер = Сч;
		ТабДокумент.Вывести(Область);
		Сч = Сч + 1;		
	КонецЦикла;	                        	
		
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	Возврат ТабДокумент; 	
	
КонецФункции	