
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ТаблицаРабочегоВремени = Новый ТаблицаЗначений;
	ТаблицаРабочегоВремени.Колонки.Добавить("Регистратор");
	ТаблицаРабочегоВремени.Колонки.Добавить("Период");
	ТаблицаРабочегоВремени.Колонки.Добавить("Сотрудник");
	ТаблицаРабочегоВремени.Колонки.Добавить("Организация");
	ТаблицаРабочегоВремени.Колонки.Добавить("ВидИспользованияРабочегоВремени");
	ТаблицаРабочегоВремени.Колонки.Добавить("ДатаРаботы");
	ТаблицаРабочегоВремени.Колонки.Добавить("Дней");
	ТаблицаРабочегоВремени.Колонки.Добавить("Время");
	
	Для Каждого ТекСтрока Из ДокументСсылка.ТабличнаяЧасть Цикл	
		Для ТекДата = 0 по ТекСтрока.Дней - 1 Цикл
			НовСтрока = ТаблицаРабочегоВремени.Добавить();
			НовСтрока.Регистратор                     = ДокументСсылка;
			НовСтрока.Период                          = ДокументСсылка.Дата;
			НовСтрока.Сотрудник                       = ДокументСсылка.Сотрудник;
			НовСтрока.Организация                     = ДокументСсылка.Организация;
			НовСтрока.ВидИспользованияРабочегоВремени = ТекСтрока.ВидИспользованияРабочегоВремени;
			НовСтрока.ДатаРаботы                      = ТекСтрока.ДатаНачала + ТекДата*уатОбщегоНазначения.уатВремяВСекунды(24);
			НовСтрока.Дней                            = 1;
			НовСтрока.Время                           = ТекСтрока.Время - НачалоДня(ТекСтрока.Время);
		КонецЦикла;     
	КонецЦикла;
	
	//управляемая блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатРабочееВремяСотрудников");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаРабочегоВремени;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Организация");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ВидИспользованияРабочегоВремени", "ВидИспользованияРабочегоВремени");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ДатаРаботы", "ДатаРаботы");
	Блокировка.Заблокировать();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРабочегоВремени",ТаблицаРабочегоВремени);
	
КонецПроцедуры

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
КонецПроцедуры
