
Процедура ПриКомпоновкеРезультата(Результат, ДанныеРасшифровки, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
    Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
    //ДокументРезультат.ПоказатьУровеньГруппировокСтрок(2); //Уровень 3
    //ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1); //Уровень 2
    Результат.ПоказатьУровеньГруппировокСтрок(4);   //Уровень 1
    Результат.ПоказатьУровеньГруппировокСтрок(3);   //Уровень 1
    Результат.ПоказатьУровеньГруппировокСтрок(2);   //Уровень 1
    Результат.ПоказатьУровеньГруппировокСтрок(1);   //Уровень 1
    Результат.ПоказатьУровеньГруппировокСтрок(0);   //Уровень 1
КонецПроцедуры
