Функция ПолучитьТаблицуПодписей(Обк,Контрагент=Неопределено) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подписи.Объект,
	               |	Подписи.Контрагент,
	               |	Подписи.уатСотрудники Сотрудник
	               |ИЗ
	               |	РегистрСведений.Подписи КАК Подписи
	               |ГДЕ
	               |	Подписи.Объект = &Объект
	               |	И Подписи.Контрагент = &Контрагент 
				   |";
				   
				   Запрос.УстановитьПараметр("Объект",Обк.Метаданные().ПолноеИмя());
				   Запрос.УстановитьПараметр("Контрагент",Контрагент);
				   
				   Тбл = Запрос.Выполнить().Выгрузить();
				   Если Тбл.Количество()=0 Тогда
					   Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Подписи.Контрагент = &Контрагент","");
					   Тбл = Запрос.Выполнить().Выгрузить();
				   КонецеСЛИ;
				   
	Возврат Тбл;			   
	
КонецФункции